<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Browsereinstellungen</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body lang="de">
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="jondofox.html"><img
src="prev.gif" alt="&lt;-"> JonDoFox</a></span> <span class="midlink"><a
name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_browser"><img src="next.gif" alt="-&gt;">
Browservorbereitung </a></span> <span class="nextlink"><a
href="security_test.html">Test der Browsereinstellungen <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>Konfiguration alternativer Browser</h2>

<p>F&uuml;r eine optimale Nutzung der Programms <b>JonDo</b> empfehlen wir,
zus&auml;tzlich <a href="jondofox.html">JonDoFox</a> zu verwenden. Dadurch
entf&auml;llt f&uuml;r Sie der Konfigurationsaufwand, da <b>JonDoFox</b>
bereits alle notwendigen Einstellungen enth&auml;lt, um mit <b>JonDo</b> anonym
im Web zu surfen. Weitere Information zu <b>JonDoFox</b> finden sie <a
href="jondofox.html">hier</a> oder auf der <a
href="https://www.jondos.de/de/jondofox">JonDoFox-Homepage</a>. Wenn Sie
JonDonym mit einem anderen Browser nutzen wollen, ist es erforderlich, dass Sie
die grundlegenden Einstellungen selbst vornehmen.</p>

<p><b>Bitte beachten Sie:</b><br>
Bei falscher oder unvollst&auml;ndiger Konfiguration hinterlassen Browser beim
Surfen eine Vielzahl digitaler Spuren, auch wenn Sie JonDonym verwenden. Diese
Konfiguration selbst vorzunehmen ist &auml;u&szlig;erst aufwendig und verlangt
ein tieferes Verst&auml;ndnis von Web-Technologien. </p>

<h3>Proxy-Einstellungen</h3>

<p>Durch die Proxy-Einstellungen konfigurieren Sie Ihren Browser so, dass er
die Anfragen f&uuml;r Webseiten nicht direkt &uuml;ber das Internet versendet,
sondern &uuml;ber JonDo, der die Daten anonymisiert. Dazu m&uuml;ssen Sie in
den Proxy-Einstellungen ihres Browsers folgendes f&uuml;r den HTTP-, HTTPS-,
FTP- und gegebenenfalls GOPHER-Proxy eintragen: </p>
<ul>
  <li>Hostname/IP-Adresse: <i><b>127.0.0.1</b></i></li>
  <li>Port: <i><b>4001</b></i> (<b>Hinweis</b>: Falls Sie im JonDo einen
    anderen <a href="net.html">Listenerport</a> als <i>4001</i> eingestellt
    haben, m&uuml;ssen Sie hier diesen anstatt <i>4001</i> eintragen.)</li>
</ul>

<p><!--<br>Beachten Sie bitte, dass solche Ausnahmen flexibler bei einem Filterproxy wie <a href="noactive_proxomitron.html">Proxomitron</a> vorgenommen werden k&ouml;nnen.<BR><BR>
<BR>-->
F&uuml;r einige Browser steht dazu eine Schritt-f&uuml;r-Schritt-Anleitung zur
Verf&uuml;gung: </p>
<ul>
  <li><a href="browser_ie.html">Internet Explorer</a></li>
  <li><a href="browser_firefox2.html">Mozilla Firefox</a></li>
  <li><a href="browser_opera.html">Opera</a></li>
  <li><a href="browser_konqueror.html">Konqueror</a></li>
  <li><a href="browser_safari.html">Safari</a></li>
</ul>

<p>&Uuml;berpr&uuml;fen Sie bitte in jedem Fall Ihre Browsereinstellungen
mithilfe von <a href="security_test.html">Anonymit&auml;tstests</a>.</p>

<h3>Vermeiden von Datenspuren</h3>

<p>Webseiten k&ouml;nnen spezielle (aktive) Inhalte anbieten, die Ihre
Identit&auml;t aufdecken oder sogar ihren Rechner sch&auml;digen, obwohl sie
scheinbar mit JonDo anonym surfen. Das kann z.B. &uuml;ber JavaScript, Java,
Flash, Silverlight und Active Scripting geschehen. Gef&auml;hrlich sind
grunds&auml;tzlich alle Arten von dynamischen Webinhalten, die auf dem Rechner
des Websurfers ausgef&uuml;hrt werden. Die meisten Browser bieten die
M&ouml;glichkeit, die Verwendung von solchen Inhalten zu unterbinden,
allerdings zumeist recht unflexibel, so dass die Inhalte entweder nur
grunds&auml;tzlich blockiert oder freigegeben werden k&ouml;nnen. Dies ist aber
problematisch, da dann einige Webanwendungen nur jeweils nach Eingriffen in die
Konfiguration genutzt werden, wie z.B. Chatrooms, Flash-Men&uuml;s und
-Animationen, oder Online-Spiele. Diese Eingriffe beeintr&auml;chtigen dann
auch die Sicherheit beim gleichzeitigen Surfen auf anderen Webseiten, bei denen
aktive Inhalte gar nicht verwendet werden sollen. Abh&auml;ngig vom von Ihnen
verwendeten Webbrowser kann es auch sehr kompliziert sein, aktive Inhalte
vollst&auml;ndig in der Konfiguration zu deaktivieren. Meist ist dies nur
erfahrenen Computernutzern m&ouml;glich. Von daher sind einfach bedienbare und
flexible Einstellungsm&ouml;glichkeiten, wie sie der <a
href="jondofox.html">JonDoFox</a> bietet, von gro&szlig;em Vorteil. </p>

<p>Weiterhin verschickt der Webbrowser sogenannte HTTP-Header. Diese dienen zur
Kommunikation mit dem Webserver, um Seiten abrufen oder Webdienste nutzen zu
k&ouml;nnen. Sie k&ouml;nnen allerdings auch dazu benutzt werden, Sie zu
identifizieren, oder ein Profil von dem zu erstellen, was Sie im Netz machen.
&Uuml;ber die HTTP-Header lassen sich z.B. der Browsertyp auslesen, Ihre
Sprache oder der sog. <i>Referer</i>, der angibt, welche Seite Sie zuletzt
besucht haben. Auch die in <a href="wwwprivacy.html#cookies">Cookies</a>
enthaltenen Daten werden &uuml;ber HTTP-Header versendet. Zwar filter JonDo
diese HTTP-Header, technisch bedingt aber nur f&uuml;r unverschl&uuml;sselte
Webseiten. Sollte Sie ein Beobachter auf eine vermeintlich sichere HTTPS-Seite
leiten, surfen Sie wieder ohne Filterschutz. Die M&ouml;glichkeiten zum
Anpassen der HTTP-Header sind bei den meisten Browsern leider nur stark
eingeschr&auml;nkt m&ouml;glich. Aus diesen Gr&uuml;nden empfehlen wir die
Benutzung von <a href="jondofox.html">JonDoFox</a>, da hier die kritischen
HTTP-Header bereits f&uuml;r maximale Anonymit&auml;t angepasst sind. </p>

<p>Viele der Informationen, welche Ihr Browser verr&auml;t, k&ouml;nnen Sie
mithilfe von <a href="security_test.html">Anonymit&auml;tstests</a> einsehen
und &uuml;berpr&uuml;fen.</p>
<hr>

<p class="navipar"><span class="prevlink"><a href="jondofox.html"><img
src="prev.gif" alt="&lt;-"> JonDoFox</a></span> <span class="midlink"><a
name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_browser"><img src="next.gif" alt="-&gt;">
Browservorbereitung </a></span> <span class="nextlink"><a
href="security_test.html">Test der Browsereinstellungen <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
