<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->
<H2>Vermeiden von Datenspuren im Internet: Verwendung eines Filterproxys</H2>

<B>Muffin</B><P>
Muffin ist OpenSource und wie JonDo in Java programmiert.
<UL>
<LI><B>Installation</B><P>
Laden Sie sich Muffin <A href="http://muffin.doit.org/">von dieser Seite</A> herunter. Verwenden Sie bei den Downloads die Datei mit der Endung <i>.jar</i> oder verwenden Sie direkt <A href="http://downloads.sourceforge.net/muffin/muffin-0.9.3a.jar">diesen Link</A> zum Download.
<br>Sie k&ouml;nnen Muffin mit einem Doppelklick auf die heruntergeladene Datei &ouml;ffnen oder &uuml;ber den Befehl <i>java -jar Dateiname.jar</i> wenn Sie sich im Verzeichnis von Muffin befinden.
<LI><B>Einrichtung</B><P>
Das Fenster von Muffin &ouml;ffnet sich. &Ouml;ffnen Sie im Men&uuml; <i>Edit</i> -> <i>Options</i>.
<br>
<center><img src="muffin1.gif"></center>
<br>
Geben Sie f&uuml;r <i>HTTP Proxy</i> und <i>HTTPS Proxy</i> jeweils "127.0.0.1" und f&uuml;r den zugeh&ouml;rigen <i>Port</i> "4001" ein.
<br><B>Hinweis:</B> Falls Sie im JonDo einen anderen <A HREF="portlistener.html">Listenerport</A> eingestellt haben m&uuml;ssen Sie diesen anstatt 4001 eintragen.
<br>Lassen Sie alle anderen Felder unver&auml;ndert. Best&auml;tigen Sie mit durch Klicken von <i>Apply</i>, <i>Save</i> und <i>Close</i>. Ohne <i>Apply</i> &uuml;berdauern die Einstellungen einen Neustart von Muffin nicht.
<br>Durch diese Einstellung holt sich Muffin die Daten aus dem Internet nicht direkt, sondern vom JonDo.
<P>
<LI><B>Filter</B><P>
Jetzt m&uuml;ssen die Filter aktiviert werden. &Ouml;ffnen Sie im Men&uuml; <i>Edit</i> -> <i>Filters</i>.
<br>
<center><img src="muffin2.gif"></center>
<br>
W&auml;hlen Sie von den <i>Supported Filters</i> den Eintrag <i>NoCode</i> und klicken Sie <i>Enable</i>. Wiederholen Sie den Schritt f&uuml;r den Eintrag <i>Referer</i>. Dadurch sind beide Eintr&auml;ge jetzt unter <i>Enabled Filters</i> zu sehen.
Es wird empfohlen, beim Filter <i>NoCode</i> nach Klicken auf <i>Preferences</i> alle H&auml;kchen zu setzen. Best&auml;tigen Sie mit <i>Apply</i>, <i>Save</i> und <i>Close</i>.
<br>Dadurch blockiert Muffin unter anderem Java, JavaScript, VBScript und andere Scriptsprachen und sendet keinen Referer. Best&auml;tigen Sie den Dialog mit <i>Save</i> und <i>Close</i>.
<P>
<LI><B>Browser</B><P>
Als letzter Schritt muss der Browser so eingerichtet werden, dass er die Daten nicht von JonDo, sondern von Muffin bezieht. Das Vorgehen ist das selbe wie <A href="browser.html">hier</A> beschrieben, nur verwenden Sie diesmal den Port von Muffin, das ist standardm&auml;ssig 51966.
<br>Somit besteht folgende Kette: Browser <-> Muffin <-> JonDo <-> Internet.
</UL>
<P>
<b>Test:</b> Unterziehen Sie diese Einstellungen einem <A href="security_test.html">Anonymit&auml;tstest</A>.
<P>
<!--#include virtual="/footer.html"-->

</body>
</html>