<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: JonDo</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="jondonym.html"><img
src="prev.gif" alt="&lt;-"> JonDonym</a></span> <span class="midlink"><a
name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="firststeps.html">JonDo &ndash; Erste Schritte <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>Einf&uuml;hrung zum JonDo</h2>

<h3>JonDo - Ihr Privatsph&auml;ren-Generator</h3>

<p>Mit JonDo (eine Weiterentwicklung von <a
href="http://anon.inf.tu-dresden.de">JAP</a>) ist es m&ouml;glich, Webseiten
anonym &uuml;ber den Dienst <a href="jondonym.html">JonDonym</a> aufzurufen.
Das bedeutet, da&szlig; weder der angefragte Server noch ein Lauscher auf den
Verbindungen mitbekommt, welcher Benutzer welche Webseite aufgerufen hat. Wenn
JonDo auf Ihrem Rechner installiert ist, sind Sie in der Lage anonym im
Internet surfen kann. Wenn Sie den JonDo nutzen wird Ihr Datenverkehr nicht
direkt an den Webserver, sondern durch den JonDo &uuml;ber eine sogenannte
<em>Mix-Kaskade</em> geschickt. Dies sind zwischengeschaltete Stationen,
&uuml;ber die alle Nachrichten anonym an Ihr Ziel geleitet werden. Auch das
Zur&uuml;cksenden der Antworten erfolgt anonym &uuml;ber die Mixkaskade. </p>

<p>Da viele Benutzer gleichzeitig den Anonymisierungsdienst nutzen, werden die
Internetverbindungen jedes Benutzers unter denen aller anderen Benutzer
versteckt: Jeder Benutzer k&ouml;nnte der Urheber einer Verbindung gewesen
sein. Niemand, kein Au&szlig;enstehender, kein anderer Benutzer, nicht einmal
der Betreiber des Anonymit&auml;tsdienstes kann herausbekommen, welche
Verbindungen ein bestimmter Benutzer aufgebaut hat. </p>

<p>JonDo verschleiert Ihre <a href="http://www.whatismyip.com">IP-Adresse</a>
gegen&uuml;ber Webseiten, und ersetzt diese durch eine andere, feste IP des
JonDonym-Systems. Allerdings gen&uuml;gt das alleine nicht, um die
Anonymit&auml;t des Websurfers sicherzustellen. Auf vielen Webseiten finden
sich sogenannte <em>aktive Inhalte</em>, die zum Aufdecken der IP-Adresse
f&uuml;hren k&ouml;nnen, und die Webbrowser senden Daten, die zur Profilierung
dienen k&ouml;nnen. Aus diesem Grund wurde <a href="jondofox.html">JonDoFox</a>
entwickelt, der alle weiteren digitalen Spuren verwischt, die Ihre
Privatssp&auml;hre im Web gef&auml;hrden k&ouml;nnen. </p>

<h3>Was JonDo ist</h3>
<ul>
  <li>JonDo ist eine Anwendung zur Verschleierung der eigenen IP-Adresse bei
    Webzugriffen &uuml;ber anonymisierte Anwendungen (<a
    href="supportedPrograms.html">HTTP, FTP-Downloads</a>)</li>
  <li>JonDo ist eine <a
    href="forwarding_client.html">Anti-Zensur-Anwendung</a>, die den Zugriff
    auf ansonsten gesperrte Internetseiten erm&ouml;glicht. JonDonauten
    k&ouml;nnen au&szlig;erdem ihren JonDo als <a
    href="forwarding_server.html">Weiterleitung (Forwarding-Server)</a>
    konfigurieren, um damit anderen Surfen wiederum den Zugriff auf den
    JonDonym-Dienst zu erm&ouml;glichen. </li>
  <li>JonDo ist quelloffen</li>
  <li>JonDo ist kostenlos</li>
  <li>JonDo ist f&uuml;r praktisch alle Betriebssysteme verf&uuml;gbar</li>
  <li>JonDo darf von jedermann zur privaten oder gesch&auml;ftlichen Nutzung
    kostenlos verwendet und ver&auml;ndert werden</li>
  <li>JonDo wurde und wird von der <a href="http://www.jondos.de/de">JonDos
    GmbH</a> in Zusammenarbeit mit deutschen Universit&auml;ten (<a
    href="http://dud.inf.tu-dresden.de">TU Dresden</a>, <a
    href="http://www-sec.uni-regensburg.de">Universit&auml;t Regensburg</a>)
    und Datenschutzorganisationen (<a
    href="http://www.datenschutzzentrum.de">Unabh&auml;ngiges Landeszentrum
    f&uuml;r Datenschutz Schleswig-Holstein</a>) weiterentwickelt</li>
</ul>

<h3>Was JonDo nicht ist</h3>
<ul>
  <li>JonDo macht die IP-Adresse Ihres Rechners (!) NICHT unsichtbar</li>
  <li>JonDo ist KEIN Filesharing-Anonymisierungstool</li>
  <li>JonDo kann KEINE E-Mails anonymisieren (au&szlig;er Web-Mailer) </li>
  <li>JonDo bindet sich NICHT transparent in Ihr Betriebssystem ein, sondern
    muss f&uuml;r jede anonymisierte Anwendung extra <a
    href="browser.html">konfiguriert</a> werden </li>
  <li>JonDo beschleunigt NICHT Ihren Internetzugriff </li>
  <li>JonDo ist NICHT JonDonym (JonDonym ist der angebotene Dienst, JonDo die
    Client-Anwendung zum Zugriff auf den Dienst)</li>
  <li>JonDo kann KEINE beliebigen "anonymen" Proxies (z.B. von Listen offener
    Proxies) nutzen, um eine anonyme Verbindung herzustellen. Dies funktioniert
    ausschlie&szlig;lich mit JonDonym-Mix-Kaskaden, die <a
    href="certificates.html">zertifiziert</a> sind, automatisch im JonDo
    gelistet werden und nicht extra eingetragen werden m&uuml;ssen.</li>
  <li>JonDo wechselt NICHT regelm&auml;&szlig;ig die IP-Adresse, sondern
    beh&auml;lt die gleiche IP-Adresse, solange er mit derselben Mixkaskade
    verbunden ist. Dies k&ouml;nnen Minuten, Stunden oder auch Tage sein. </li>
  <li>JonDo ist keine Ein-Klick-Anonymisierungsanwendung - so etwas kann und
    wird es auch nicht wirklich geben! Vorsicht bei der Internetsicherheit
    bleibt wichtig. </li>
  <li>JonDo filtert KEINE Skripte oder Browserinformationen. Plugins wie <a
    href="noactive.html">Flash/Shockwave/Java</a> m&uuml;ssen im Browser
    deaktiviert sein, um Anonymit&auml;t &uuml;berhaupt m&ouml;glich zu
  machen.</li>
</ul>

<h3>Unterst&uuml;tzte Programme</h3>

<p>JonDo unterst&uuml;tzt die folgenden Internet-Protokolle:</p>
<ul>
  <li>HTTP</li>
  <li>HTTPS</li>
  <li>FTP (nur Download)</li>
  <li>Gopher</li>
</ul>

<p>Die JonDonym-Dienste unterst&uuml;tzen Programme wie:</p>
<ul>
  <li><a href="browser.html">Webbrowser</a></li>
  <li>Download-Manager (JonDo als HTTP-Proxy eintragen <a
    href="browser.html">wie im Browser</a>) </li>
</ul>

<p>Weiterhin k&ouml;nnen Sie mit den <a
href="jondonym.html#premiumservices">Premiumdiensten</a> nutzen: </p>
<ul>
  <li>Chat-Protokolle wie IRC, <a href="http://www.jabber.org/">Jabber</a>
    (alle Dienste, die &uuml;ber einen HTTP- bzw. HTTPS-Proxy genutzt werden
    k&ouml;nnen).</li>
</ul>

<p>JonDo ist haupts&auml;chlich zum anonymen Websurfen gedacht. Folgende
Anwendungen werden deshalb von JonDo <strong>nicht
unterst&uuml;tzt</strong>:</p>
<ul>
  <!--<li>Filesharing, Peer-To-Peer (Emule, BitTorrent, BitComet,...) </li>-->
  <li>E-Mail</li>
  <li>Internet-Telefonie (VoIP, Skype,...)</li>
  <!--<li>FTP, Telnet, SSH,... </li>-->
</ul>

<p>Auch alle skriptgesteuerten Webanwendungen (JavaScript/Java/Flash), wie
Chatrooms, interaktive Karten und Online-Spiele k&ouml;nnen
<strong>nicht</strong> anonymisiert werden. Mithilfe von Skripten k&ouml;nnen
JonDos Schutzmechanismen mehr oder weniger einfach umgangen werden. Wer anonym
sein m&ouml;chte, sollte auf diese Anwendungen ganz verzichten. </p>
<hr>

<p class="navipar"><span class="prevlink"><a href="jondonym.html"><img
src="prev.gif" alt="&lt;-"> JonDonym</a></span> <span class="midlink"><a
name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="firststeps.html">JonDo &ndash; Erste Schritte <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
