<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="net.html"><img src="prev.gif"> Netzwerk</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif"> Konfiguration </a></span>
<span class="nextlink"><a href="services.html">Dienste <img src="next.gif"></a></span> 
</p>
<hr>

<h2>Anonymit&auml;t</h2>
<p>
Die Einstellungsoptionen des JonDos, die den Zugang zu den Anoynmit&auml;tsdiensten und deren Eigenschaften betreffen, finden Sie, wenn Sie im Hauptfenster auf <i>Einstellungen</i> klicken. In dem Einstellungsmen&uuml;, das daraufhin erscheint finden Sie auf der linken Seite finden Sie den Punkt <i>Anonymit&auml;t</i>. Hier haben Sie die M&ouml;glichkeit, die Konfiguration f&uuml;r die folgenden Dienstkomponenten vorzunehmen:
</p>
<ul>
    <li>
	<p>
	<a href="services.html">Dienste</a>:<br>
	Unter diesem Men&uuml;punkt, k&ouml;nnen Sie Informationen, zu den verf&uuml;gbaren Anonymiesierungsdiensten abrufen und weitere Einstellungen vornehmen. 
	</p>
	</li>
	
	<li>
	<p>
	<a href="infoservice.html">InfoService</a>:<br>
	Hier haben Sie die M&ouml;glichkeit, JonDonym-InfoServices auszuw&auml;hlen und den Zugang zu diesen zu konfigurieren. Diese liefern dem JonDo die Informationen, die notwendig sind, um sich mit den verf&uuml;gbaren Mixkaskaden zu verbinden. <br>
	<img src="next.gif"> <i>Verf&uuml;gbar in der <a href="appearance.html#expertView">erweiterten Ansicht</a></i>	
	</p>
	</li>
    
	<li>
	<p>
	<a href="forwarding_server.html">Forwarding-Server</a>:<br>
	Umfasst alle Einstellungen, die erforderlich sind, wenn Sie Ihren JonDo als Forwarding-Server verwenden wollen. Dadurch erm&ouml;glichen Sie anderen JonDonym-Nutzern, deren Netzwerkverkehr &uuml;ber Ihren JonDo zu den Mixkaskaden weiter zu leiten. <br>
	<img src="next.gif"> <i>Verf&uuml;gbar in der <a href="appearance.html#expertView">erweiterten Ansicht</a></i> 
	</p>
	</li>
	
	<li>
	<p>
	<a href="cert.html">Zertifikatsstellen</a>:<br>
	Erm&ouml;glicht Ihnen Zertifikate von Betreibern und Mixen zu importieren und zu verwalten. Zertifikate sind notwendig, um die Authentizit&auml;t der Mixe und deren Betreiber sicher zu stellen.<br>
	<img src="next.gif"> <i>Verf&uuml;gbar in der <a href="appearance.html#expertView">erweiterten Ansicht</a></i> 
	</p>
	</li>
</ul>

<p>
<b>Bitte beachten Sie</b>:<br>
Der JonDo enth&auml;lt f&uuml;r diese Men&uuml;punkte bereits alle notwendigen Voreinstellungen, damit Sie sich mit den verf&uuml;gbaren Anonymisierungsdiensten verbinden k&ouml;nnen. Nur in &auml;u&szlig;erst seltenen F&auml;llen ist es erforderlich, &Auml;nderungen f&uuml;r diese Einstellungen vorzunehmen. Deswegen empfehlen wir, nur dann &Auml;nderungen durchzuf&uuml;hren, wenn Sie wissen, aus welchem Grund dies f&uuml;r Sie notwendig ist.
</p>
<hr>
<p class="navipar">
<span class="prevlink"><a href="net.html"><img src="prev.gif"> Netzwerk</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif"> Konfiguration </a></span>
<span class="nextlink"><a href="services.html">Dienste <img src="next.gif"></a></span> 
</p>

<!--#include virtual="/footer.html"-->
</body>
</html>