<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>JonDo-Hilfe: Erscheinungsbild</title>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="JAP_commandline.html"><img src="prev.gif" alt="<-"> Kommandozeilenargumente</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif" alt="->"> Konfiguration </a></span>
<span class="nextlink"><a href="payment.html">Einstellungen zur Bezahlung <img src="next.gif" alt="->"></a></span> 
</p>
<hr>

<h2>Ver&auml;ndern des Erscheinungsbildes</h2>
<p>
Um zu diesem Einstellungsfenster zu gelangen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Erscheinungsbild</i>.<br>
In diesem Dialog k&ouml;nnen Sie Einstellungen vornehmen, die die grafische
Erscheinung, die Sprache und das Anzeigeverhalten nach dem Starten von JonDo
festlegen.

</p>
<h3>Erscheinungsbild</h3>
	<p>
    JonDo unterst&uuml;tzt verschiedene Formen der Darstellung von Fenstern und Bedienelementen.
	</p>
	
	<ul>
		<li>
		<p>
		<b>Sprache</b><br>
		Hier k&ouml;nnen Sie die Sprache f&uuml;r die Bedienelemente, Men&uuml;s und Dialoge einstellen. Die &Auml;nderungen werden nach dem n&auml;chsten Start von JonDo aktiv. Wenn Sie &Auml;nderungen an der Spracheinstellung vornehmen, werden Sie gefragt, ob Sie den JonDo neu starten m&ouml;chten. 
		</p>
		</li>	
		
		<li>
		<p>
		<b>LookAndFeel</b><br>
		Das <i>LookAndFeel</i> bestimmt die grafische Gesamterscheinung Ihres JonDo. Darunter z&auml;hlt das Aussehen von Buttons, Fenstern und Textfeldern und sonstigen graphischen Elementen. Das LookAndFeel ist dabei jeweils abh&auml;ngig von dem Betriebssystem, das Sie verwenden. 
		Mit dieser Liste haben Sie die M&ouml;glichkeit ein LookAndFeel Ihrer Wahl f&uuml;r JonDo zu verwenden. Dar&uuml;berhinaus k&ouml;nnen Sie neue LookAndFeel-Optionen hinzuf&uuml;gen, indem Sie sich aus dem Internet
		neue Pakete herunterladen und in Ihren JonDo importieren. Diese sind nicht JonDo-spezifisch, d.h. Sie k&ouml;nnen alle Pakete f&uuml;r verwenden, die von Java-Swing unterst&uuml;tzt werden.
		
		</p>
		<ul>
			<li>
			<p>
			<b>Importieren</b><br>
			Neue LookAndFeel-Pakete, die Sie zu Ihrem JonDo hinzuf&uuml;gen k&ouml;nnen, finden Sie z.B. auf <a HREF="http://www.javootoo.com">www.javootoo.com</a>.
		Laden Sie einfach die Pakete Ihrer Wahl auf Ihren Computer und klicken Sie auf <i>Importieren</i>. Daraufhin &ouml;ffnet ein Auswahlfenster. Navigieren Sie zum Speicherort des neuen LookAndFeel Pakets und w&auml;hlen Sie die Datei mit der <span class="nowrap">Endung <i>.jar</i></span>. Ein Dialog leifert Ihnen eine R&uuml;ckmeldung, ob das Paket importiert werden konnte. War der Vorgang erfolgreich, erscheint das neue LookAndFeel in der Auswahlliste.
			</p>
			</li>			
			<li>
			<p>
			<b>Entfernen</b><br>
			Damit k&ouml;nnen Sie die LookAndFeel Paket l&ouml;schen, die Sie selbst hinzugef&uuml;gt haben.
			</p>
			</li>
			
		</ul>
		<p>
		<b>Hinweis:</b><br>
		 Die &Auml;nderungen an den LookAndFeel-Einstellungen werden erst nach einem Neustart des JonDos aktiv.
		</p>
		</li>
		<li>
		<p>
		<b>Schriftgr&ouml;&szlig;e</b><br>
		Hier k&ouml;nnen Sie die Schriftgr&ouml;sse f&uuml;r die Bedienelemente einstellen.<br>
		Diese &Auml;nderungen werden sofort aktiv.
		</p>
		</li>
	</ul>

<h3><a name="expertView"></a>Ansicht von JonDo</h3>
<ul>
    <li>
	<p>
	<b>Erweiterte Ansicht:</b><br>
    In der erweiterten Ansicht werden alle Optionen im Hauptfenster sowie in 
    den Konfigurationsdialogen angezeigt.
    </p>
	</li>
    
	<li>
	<p>
	<b>Vereinfachte Ansicht:</b><br>
    In der vereinfachten Ansicht werden einige fortgeschrittene Optionen nicht
    angezeigt. Die Grundfunktionalit&auml;t des JonDo &auml;ndert sich dadurch nicht.
	</p>
	</li>
	
	<li>
	<p>
	<b>Mini-Ansicht immer im Vordergrund</b><br>
    Schiebt die <a href="miniwindow.html">Mini-Ansicht</a> von JonDo immer vor alle anderen Fenster des Betriebssystems, auch wenn diese aktiv sind. Wenn die Option abgew&auml;hlt ist, wird die <a href="miniwindow.html">Mini-Ansicht </a>hinter anderen Fenstern versteckt. 
	</p>
	</li>
</ul>
<p>
<b>Hinweis:</b><br>
Diese &Auml;nderungen erfordern einen sofortigen Neustart von JonDo.
</p>


<h3><a name="afterStart"></a>Programmstart</h3>
<ul>
    <li>
	<p>
	<b>Gehe nach dem Start...:</b><br>
    Wenn Sie diese Option aktivieren, haben Sie zwei weitere
    Auswahlm&ouml;glichkeiten:
    </p>
	
    <ul>
        <li>
		<p>
		<b>...in die Minimalansicht:</b><br>
        Diese Option minimiert das Hauptfenster des JonDo sofort nach dem Start.
        </p>
		</li>
        
		<li>
		<p>
		<b>...in den Systray:</b><br>
        Wenn diese Einstellung gew&auml;hlt wurde, verschwindet das Hauptfenster
        des JonDo gleich nach dem Start im Systray von Windows.
		</p>
		</li>
    </ul>
	</li>
	
	<li>
	<p>
	<b>Splash-Screen anzeigen:</b><br>
	Falls Sie nicht m&ouml;chten, dass unmittelbar nach dem Start des JonDos der Splash-Screen erscheint, k&ouml;nnen Sie diese Option aktivieren. Dadurch wird beim n&auml;chsten Start des JonDos der Splash-Screen dann nicht mehr angezeigt. Sofern Sie diese Option wieder deaktivieren wird der Splash-Screen wieder erscheinen.
	</p>
	</li>
		
	<li>
	<p>
	<b>Firefox starten (nur JonDo-Portable):</b><br>
	Sollten Sie das JonDo-Portable-Paket oder Ihren JonDo mit der Kommandozeilenoption <code>--portable &lt;Pfad zum Firefox&gt; </code> gestartet haben, wird auch der Firefox automatisch ausgef&uuml;hrt, wenn diese Option aktiviert ist. Allerdings erfolgt der Start des Firefox erst dann, wenn nach dem Start des JonDos eine Verbindung mit einem Anonymisierungsdienst zustande gekommen ist. Falls Sie nicht w&uuml;nschen, dass der Firefox automatisch gestartet wird, deaktivieren Sie diese Option. 
	</p>
	</li>
</ul>

<h3>Fensterposition merken</h3>
<p>
<i>Diese Einstellung steht Ihnen in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i>
</p>
<p>
	Wenn Sie bei einem der folgenden K&auml;stchen einen Haken setzen, dann erscheint das
	entsprechende Fenster von JonDo bei jedem Start an der gleichen Stelle, an der
	es sich beim vorherigen Beenden befand. Sie haben die M&ouml;glichkeit, folgende Fenster wieder an der gleichen Position beim n&auml;chsten Programmstart erscheinen zu lassen: 
</p>
<ul>
	<li>Hauptfenster</li>
	<li>Einstellungsfenster</li>
	<li>Mini-Fenster</li>
	<li>Hilfefenster</li>
</ul>

<h3>Fenstergr&ouml;&szlig;e merken</h3>
<p>
<i>Diese Einstellung steht Ihnen in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i>
</p>
<ul>
	<li>
	<p>
	<b>Hilfefenster</b><br> 
	Wenn Sie diese Option aktivieren, wird JonDo das Hilfefenster in der gleichen Gr&ouml;&szlig;e wie beim letzten Aufruf anzeigen.
	</p>
	</li>
</ul>

<h3>Programmende</h3>
<p>
<i>Diese Einstellung steht Ihnen in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i>
</p>

<ul>
    <li>
	<p>
	<b>Warnung beim Beenden von JonDo</b><br>
    Ist diese Option aktiviert, wird eine Warnung beim Beenden von JonDo angezeigt, in der Sie daran erinnert werden, dass die Proxykonfiguration im Browser ge&auml;ndert werden muss, wenn Sie ohne JonDo weitersurfen m&ouml;chten. Deaktivieren Sie diese Option, wenn Sie m&ouml;chten, dass diese Warnung nicht mehr angzeigt wird.
    </p>
	</li>
</ul>
<hr>
<p class="navipar">
<span class="prevlink"><a href="JAP_commandline.html"><img src="prev.gif" alt="<-"> Kommandozeilenargumente</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif" alt="->"> Konfiguration </a></span>
<span class="nextlink"><a href="payment.html">Einstellungen zur Bezahlung <img src="next.gif" alt="->"></a></span> 
</p>
<!--#include virtual="/footer.html"-->
</body>
</html>