<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="browser.html">&larr; Browsereinstellungen</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_browser"> &rarr; Browservorbereitung </a><a href="browser.html"> &rarr; andere Browser </a><a href="browser_firefox.html"> &rarr; Firefox </a></span>
<span class="nextlink"><a href="noactive_firefox.html">Vermeiden von Datenspuren &rarr;</a></span> 
</p>
<hr>
<H2>Proxy Einstellungen f&uuml;r Browser: Mozilla Firefox 2.x </H2>

<p>
Um JonDo in Mozilla-Firefox einzurichten gehen Sie folgenderma&szlig;en vor :
</p>
<ol>
<li>
<p>
W&auml;hlen Sie im Men&uuml; &quot;Extras&quot; (Windows), bzw. &quot;Firefox&quot; (Mac OS X) das Untermen&uuml; "Einstellungen...". Danach &ouml;ffnet sich das Einstellungsfenster. W&auml;hlen Sie in diesem den Punkt "Erweitert" und dort den Tab "Netzwerk":
</p>
<center><img src="firefox3.gif"></center>
</li>

<li>
<p>
Um den Proxyserver einzustellen klicken Sie auf die Schaltfl&auml;che "Einstellungen...". In dem Fenster das sich nun &ouml;ffnet w&auml;hlen Sie "Manuelle Proxy-Konfiguration" aus. W&auml;hlen Sie "F&uuml;r alle Protokolle diesen Proxyserver verwenden" und tragen sie nun "127.0.0.1" als Server und 4001 als Port ein :
</p>
<center><img src="firefox2.gif"></center>
<p>
Wollen Sie Adressen festlegen, f&uuml;r die JonDo nicht verwendet werden soll, so k&ouml;nnen Sie im Feld <i>Kein Proxy f&uuml;r:</i> Ausnahmen festlegen, jeweils durch ein normales Komma getrennt.
</p>
<!--
<br>Beachten Sie bitte, dass solche Ausnahmen flexibler bei einem Filterproxy wie <a href="noactive_proxomitron.html">Proxomitron</a> vorgenommen werden k&ouml;nnen.
-->
<p><b>Hinweis:</a><br>
Falls Sie im JonDo einen anderen <a href="portlistener.html">Listenerport</a> eingestellt haben m&uuml;ssen Sie diesen anstatt 4001 eintragen.
</p>
</li>
</ol>

<h3>Empfohlene Extensions f&uuml;r Mozilla-Firefox</h3>

<p>
F&uuml;r Firefox wird die Extension <i>SwitchProxy</i> empfohlen. Diese Erweiterung installiert eine Toolbar in Firefox, welche das schnelle Umschalten zwischen Proxies erm&ouml;glicht. So kann schnell zwischen dem Gebrauch von JonDo und nichtanonymen Surfen umgestellt werden.
</p>

<p>
<b>Hinweis</b>:<br>
Im <a href="http://www.jondos.de/de/jondofox">JonDoFox-Browser</a> ist diese Extension bereits enthalten.
</p>


<B>Installation</B><P>
<p>Es gibt zwei M&ouml;glichkeiten, um auf die Installationsseite der Extension zu gelangen:</p>
<ol>
<li>
&Ouml;ffnen Sie <a href="https://addons.mozilla.org/firefox/125/">diesen Link</a> um direkt zur Installationsseite der Extension zu gelangen.
</li>

<li>
<p>
Klicken Sie im Men&uuml; <i>Extras</i> auf <i>Erweiterungen</i>. Ein Fenster mit allen installierten Extensions &ouml;ffnet sich. Klicken Sie auf <i>Erweiterungen herunterladen</i> um auf die Extesnions-Seite f&uuml;r Firefox zu gelangen. Suchen sie dort nach "SwitchProxy Tool".<P>
</p>
<p>
Klicken Sie dann auf den Link "Install Now". Best&auml;tigen Sie die Installation und starten Sie ihren Browser neu.
</p>
</li>
</ol>

<p>
<b>Einrichtung</b><br>
Sie sollten jetzt eine neue Toolbar sehen:
</p>
<center><img src="switchproxy.gif"></center>
<p>
Klicken Sie in der Toolbar auf <i>Add</i>, um einen neuen Proxy einzurichten. W&auml;hlen Sie die den Proxytyp <i>Standard</i> und klicken Sie auf <i>Next</i>.
<br>Geben Sie als <i>Proxy Label</i> z.B. "JonDo" ein, die Bezeichnung ist irrelevant. Geben Sie nun f&uuml;r jeden Proxytyp au&szlig;er SOCKS (HTTP, SSL, FTP, Gopher) die Adresse "127.0.0.1" und den Port 4001 an:
</p>
<center><img src="switchproxy2.gif"></center>
<p>
Best&auml;tigen Sie mit <i>OK</i>.
</p>
<p>
<b>Optionale Einstellungen</b><br>
Sie k&ouml;nnen die SwitchProxy Toolbar ausblenden, damit Sie keinen Platz wegnimmt. S&auml;mtliche Funktionalit&auml;t bleibt erreichbar &uuml;ber das Kontextmen&uuml; (Rechtsklick) sowie &uuml;ber den Men&uuml;punkt <i>Extras</i> -> <i>SwitchProxy</i>.
<br>Um die Toolbar auszublenden, klicken Sie auf <i>Preferences</i> in der Toolbar <b>oder</b> &ouml;ffnen Sie &uuml;ber <i>Extras</i> -> <i>Erweiterungen</i> das Fenster mit allen Erweiterungen, w&auml;hlen das Plugin <i>SwitchProxy</i> aus und klicken auf <i>Einstellungen</i>.
<br>Haken Sie <i>Show toolbar</i> ab, lassen Sie <i>Show Context Menu</i> und <i>Show in Status Bar</i> aktiviert.
</p>
<!--#include virtual="/footer.html"-->
<hr>
<p class="navipar">
<span class="prevlink"><a href="browser.html">&larr; Browsereinstellungen</a></span> 
<span class="midlink">
<a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_browser"> &rarr; Browservorbereitung </a><a href="browser.html"> &rarr; andere Browser </a><a href="browser_firefox.html"> &rarr; Firefox </a>
</span>
<span class="nextlink"><a href="noactive_firefox.html">Vermeiden von Datenspuren &rarr;</a></span> 
</p>

</body>
</html>