<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Browsereinstellungen</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="jondofox.html"><img
src="prev.gif" alt="&lt;-"> JonDoFox</a></span> <span class="midlink"><a
name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_browser"><img src="next.gif" alt="-&gt;">
Browservorbereitung </a></span> <span class="nextlink"><a
href="interface.html">JonDo-Oberfl&auml;che <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>Konfiguration von anderen Browsern</h2>

<p>F&uuml;r eine optimale Nutzung von <b>JonDonym</b> empfehlen wir den
portablen <a href="jondofox.html">JonDoFox</a>. Dadurch ent&auml;llt f&uuml;r
Sie der Konfigurationsaufwand, da <b>JonDoFox</b> bereits alle notwendigen
Einstellungen enth&auml;lt, um mit <b>JonDonym</b> anonym im Web zu surfen.
Weitere Information zu <b>JonDoFox</b> finden sie <a href="jondofox.html">hier
</a> oder auf der <a
href="https://www.jondos.de/de/jondofox">JonDoFox-Homepage</a>. Wenn Sie
JonDonym mit einem anderen Browser nutzen wollen, ist es erforderlich, dass Sie
die grundlegenden Einstellungen selbst vornehmen.<br>
</p>

<p><b>Bitte beachten Sie:</b><br>
Bei falscher Konfiguration hinterlassen Browser beim Surfen eine Vielzahl
digitaler Spuren, auch wenn Sie JonDonym verwenden. Diese Konfiguration selbst
vorzunehmen ist &auml;u&szlig;erst aufwendig und verlangt ein tieferes
Verst&auml;ndnis von Web-Technologien. Dar&uuml;berhinaus ist es bei einigen
Browsern, wie z.B. Internet Explorer, Opera und Safari auch nicht m&ouml;glich
die &Uuml;bertragung solcher Spuren vollst&auml;ndig zu vermeiden. </p>

<h3>Proxy-Einstellungen</h3>

<p>Durch die Proxy-Einstellungen konfigurieren Sie Ihren Browser so, dass er
die Anfragen f&uuml;r Webseiten nicht direkt &uuml;ber das Internet versendet,
sondern &uuml;ber JonDo, der die Daten anonymisiert. </p>

<p><b>Bitte beachten Sie:</b><br>
Wenn diese Einstellungen im Browser gar nicht oder nur unvollst&auml;ndig
vergenommen werden, ist Ihre Anonymit&auml;t nicht gew&auml;hrleistet, auch
wenn Sie den JonDo korrekt gestartet und konfiguriert haben. </p>

<p>W&auml;hlen Sie hier ihren Browser aus, um eine kurze Anleitung f&uuml;r die
Proxy-Konfiguration Ihres Browsers zu erhalten: </p>
<ul>
  <li><a href="browser_ie.html">Internet Explorer</a></li>
  <li><a href="browser_firefox.html">Mozilla Firefox</a></li>
  <li><a href="browser_seamonkey.html">SeaMonkey</a></li>
  <li><a href="browser_opera.html">Opera</a></li>
  <li><a href="browser_konqueror.html">Konqueror</a></li>
  <li><a href="browser_safari.html">Safari</a></li>
  <li><a href="browser_unknown.html">weitere Browser</a></li>
</ul>

<h3>Vermeiden von Datenspuren</h3>

<p>Webseiten k&ouml;nnen spezielle (aktive) Inhalte anbieten, die Ihre
Identit&auml;t aufdecken (oder sogar ihren Rechner sch&auml;digen), obwohl sie
scheinbar mit JonDo anonym surfen. Das kann z.B. &uuml;ber JavaScript, Java,
Flash und Active Scripting geschehen. Gef&auml;hrlich sind grunds&auml;tzlich
alle Arten von dynamischen Webinhalten, die auf dem Rechner des Websurfers
ausgef&uuml;hrt werden. Die meisten Browser bieten die M&ouml;glichkeit, die
Verwendung von solchen Inhalten zu unterbinden, allerdings zumeist recht
unflexibel, da die Inhalte entweder nur grunds&auml;tzlich blockiert oder
freigegeben werden k&ouml;nnen. Dies ist aber problematisch, denn wenn man alle
diese Inhalte grunds&auml;tzlich verbietet k&ouml;nnen einige Webanwendungen
nicht mehr genutzt werden, wie z.B. Chatrooms, Flash-Men&uuml;s und
-Animationen, oder Online-Spiele. Von daher sind flexiblere
Einstellungsm&ouml;glichkeiten, wie sie der <a
href="jondofox.html">JonDoFox</a> bietet, von Vorteil. </p>

<p>Weiterhin verschickt der Webbrowser sogenannte HTTP-Header. Diese dienen zur
Kommunikation mit dem Webserver, um Seiten abrufen oder Webdienste nutzen zu
k&ouml;nnen. Sie k&ouml;nnen allerdings auch dazu benutzt werden, Sie zu
identifizieren, oder ein Profil von dem zu erstellen, was Sie im Netz machen.
&Uuml;ber die HTTP-Header lassen sich z.B. der Browsertyp auslesen, Ihre
Sprache oder der sog. <i>Referrer</i>, der angibt, welche Seite Sie zuletzt
besucht haben. Auch die in <a href="wwwprivacy.html#cookies">Cookies</a>
enthaltenen Daten werden &uuml;ber HTTP-Header versendet. </p>

<p>Im Folgenden finden Sie einige Beschreibungen und HowTos zur Installation
und Konfiguration Ihres Browsers und von Zusatzsoftware zur Aktivierung der
f&uuml;r Sie richtigen Datenschutzeinstellungen. </p>
<ul>
  <li><a href="noactive_firefox.html">Mozilla Firefox</a></li>
  <li><a href="noactive_seamonkey.html">SeaMonkey</a></li>
  <li><a href="noactive_opera.html">Opera</a></li>
  <li><a href="noactive_konqueror.html">Konqueror</a></li>
  <li><a href="noactive_safari.html">Safari</a></li>
</ul>

<p><b>Hinweis</b>:<br>
Die M&ouml;glichkeiten zum Anpassen der HTTP-Header sind bei den meisten
Browsern nur stark eingeschr&auml;nkt m&ouml;glich. Aus diesem Grund empfehlen
wir die Benutzung von <b>JonDoFox</b>, da hier die kritischen HTTP-Header
bereits f&uuml;r maximale Anonymit&auml;t angepasst sind. Auf die erweiterten
Konfigurationsm&ouml;glichkeiten f&uuml;r andere Browser als den JonDoFox
werden wir aus diesem Grund hier nicht weiter eingehen. Ebensowenig wird in
dieser Dokumentation die Verwendung von Filterproxies wie <a
href="http://www.proxomitron.info/">Proxomitron</a> oder <a
href="http://muffin.doit.org/">Muffin</a> behandelt, da mit JonDoFox eine
weitaus bessere Kontrolle zur Vermeidung von Datenspuren m&ouml;glich ist.
Informationen zu der Konfiguration und Verwendung von Filterproxies finden sich
auf den entsprechenden Projekt-Homepages: <a
href="http://www.proxomitron.info/">www.proxomitron.info</a>, bzw. <a
href="http://muffin.doit.org/">muffin.doit.org</a> </p>
<hr>

<p class="navipar"><span class="prevlink"><a href="jondofox.html"><img
src="prev.gif" alt="&lt;-"> JonDoFox</a></span> <span class="midlink"><a
name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_browser"><img src="next.gif" alt="-&gt;">
Browservorbereitung </a></span> <span class="nextlink"><a
href="interface.html">JonDo-Oberfl&auml;che <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
