<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: InfoService</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="services_general.html"><img
src="prev.gif" alt="&lt;-"> Erweiterte Diensteinstellungen</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Anonymit&auml;t
</a></span> <span class="nextlink"><a
href="forwarding_server.html">Forwarding-Server <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>InfoService</h2>

<p><em class="jconf">Dieses Einstellungsfenster stehen Ihnen nur in der <a
href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.
Um zu diesem Einstellungsfenster zu gelangen, klicken Sie im Hauptfenster von
JonDo auf <code class="jconf">Einstellungen</code> und w&auml;hlen
anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">InfoService</code>.</em><br>
</p>

<p>Die InfoServices liefern JonDo notwendige Informationen &uuml;ber die
verf&uuml;gbaren Dienste und Updates. F&uuml;r JonDonym stehen mehrere
InfoSerivces unterschiedlicher Organisationen zur Verf&uuml;gung, die Ihre
Datens&auml;tze untereinander abgleichen und somit die gleichen Informationen
besitzen. Auf diese Weise wird sichergestellt, dass die Informationen
hochverf&uuml;gbar sind. Die meisten Informationen werden redundant abgefragt,
damit nicht einzelne InfoServices betr&uuml;gen oder Informationen vorenthalten
k&ouml;nnen.</p>

<p><b>Bitte beachten Sie</b><br>
Eine &Auml;nderung dieser Einstellungen f&uuml;hrt m&ouml;glicherweise dazu,
dass der JonDo keine Dienste mehr findet.</p>

<h3>Einstellungen</h3>

<p>Auf dieser Seite sehen Sie die InfoServices, die Ihrem JonDo bekannt sind.
Der derzeit bevorzugte InfoService erscheint fett gedruckt. Sie k&ouml;nnen
folgende Aktionen durchf&uuml;hren: </p>
<ul>
  <li><p><b>Neu laden</b><br>
    Klicken Sie auf diesen Button, um die Liste der verf&uuml;gbaren
    InfoServices zu aktualisieren. </p>
  </li>
  <li><p><b>Als Standard</b><br>
    Durch Klicken dieser Schaltfl&auml;che wird der markierte InfoService als
    Standard-InfoService ausgew&auml;hlt. Der Standard-InfoService wird bei <a
    href="#infoservice_redundat">redundanten Anfragen</a> immer als erster
    kontaktiert und nicht aus der Liste der verf&uuml;gbaren InfoServices
    gel&ouml;scht, selbst wenn er momentan nicht verf&uuml;gbar sein sollte.
    </p>
  </li>
  <li><p><b>Zertifikat</b><br>
    Durch Klicken wird das Zertifikat dieses InfoServices angezeigt, welches
    auch dessen Betreiber offenbart. JonDo &uuml;bernimmt nur Informationen von
    InfoServices, deren Authentizit&auml;t durch ein vertrauensw&uuml;rdiges
    Zertifikat sichergestellt werden kann. </p>
    <p><b>Hinweis</b><br>
    Die Zertifikate der voreingestellten InfoServices sind bereits im JonDo
    enthalten. </p>
  </li>
  <li><p><b>Hinzuf&uuml;gen...</b><br>
    Wenn Sie diese Aktion w&auml;hlen, erscheinen im unteren Teil des Fensters
    Elemente mit denen Sie einen InfoService manuell eintragen k&ouml;nnen.</p>
    <p><em>Diese Einstellungen werden normalerweise nicht ben&ouml;tigt, da
    alle InfoServices automatisch gefunden werden.</em></p>
    <ul>
      <li><p><b>InfoService Host</b><br>
        Tragen Sie hier den Hostnamen oder die IP-Adresse des InfoServices ein,
        den Sie hinzuf&uuml;gen wollen. </p>
      </li>
      <li><p><b>InfoService Port</b><br>
        Hier m&uuml;ssen Sie den Port des neuen InfoServices eintragen. </p>
      </li>
      <li><p><b>InfoService Name</b><br>
        Wenn Sie wollen, k&ouml;nnen Sie hier einen Namen f&uuml;r den neuen
        InfoService vergeben. Der neue InfoService erscheint dann unter diesem
        Namen in der Liste der bekannten InfoServices. Wenn Sie dieses Feld
        frei lassen, erscheint der InfoService als Kombination aus Hostname und
        Port. </p>
      </li>
      <li><p><b>OK</b><br>
        Klicken Sie diesen Knopf, um die Eingaben f&uuml;r den neuen
        InfoService zu best&auml;tigen und diesen zur Liste der aktuellen
        InfoServices hinzuzuf&uuml;gen. </p>
      </li>
      <li><p><b>Abbrechen</b><br>
        Hiermit verwerfen Sie alle Eingaben und kehren zum vorigen Fenster
        zur&uuml;ck. </p>
      </li>
    </ul>
    <p>Dieser Teil des Fensters erscheint auch, wenn Sie einen bereits manuell
    angelegten InfoService aus der Liste w&auml;hlen. Sie haben dann die
    M&ouml;glichkeit, die Daten des InfoServices zu &auml;ndern oder den
    InfoService zu l&ouml;schen. </p>
  </li>
  <li><p><b>L&ouml;schen</b><br>
    Klicken Sie hier, um den ausgew&auml;hlten InfoService aus der Liste zu
    entfernen. </p>
    <p><b>Hinweis</b><br>
    Es ist nicht m&ouml;glich den Standard- sowie die voreingestellten
    InfoServices zu l&ouml;schen. </p>
  </li>
</ul>

<h3>Erweiterte Einstellungen</h3>
<ul>
  <li><b>Anonyme Verbindungen zu InfoServices</b><br>
    <em>Nur wenn direkte Verbindung nicht m&ouml;glich ist</em> bringt JonDo
    dazu, Verbindungen zu InfoServices &uuml;ber den gerade aktiven
    JonDonym-Dienst herzustellen wenn der jeweilige InfoService &uuml;ber eine
    direkte Verbindung nicht erreichbar ist. Dies ist beispielsweise dann der
    Fall wenn Ihr Provider den Zugang zum InfoService blockiert. 
    <p><em>Immer (nicht-anonyme Verbindung verbieten)</em> f&uuml;hrt dazu,
    dass InfoServices ausschlie&szlig;lich &uuml;ber JonDonym-Dienste
    kontaktiert werden. <strong>Durch diese Einstellung k&ouml;nnen Sie unter
    Umst&auml;nden keine aktuellen Infomationen &uuml;ber das JonDonym-Netzwerk
    mehr abrufen und sich in der Folge nicht mehr oder nur noch
    eingeschr&auml;nkt mit Anonymisierungsdiensten verbinden.</strong></p>
    <p><em>Niemals (nur direkte Verbindung gestatten)</em> kann sinnvoll sein,
    um Kosten zu sparen. Denn <strong>&uuml;ber kostenpflichtige
    JonDonym-Dienste &uuml;bertragene InfoService-Daten werden aus zwingenden
    technischen Gr&uuml;nden genauso abgerechnet wie alle sonstigen
    Nutzdaten</strong>. Durch diese Einstellung wird verhindert, dass die
    anonyme Verbindung genutzt wird um InfoService-Daten abzufragen.</p>
  </li>
  <li><a name="infoservice_auto" id="infoservice_auto"><b>Automatische
    InfoService-Anfragen durchf&uuml;hren</b></a><br>
    JonDo versucht in regelm&auml;&szlig;igen Abst&auml;nden automatisch die
    InfoServices zu kontaktieren um die lokal gespeicherten Datens&auml;tze zu
    aktualisieren. Wenn dieses Feld nicht markiert ist, unterbleiben diese
    automatischen Abfragen. <strong>Sie m&uuml;ssen die InfoService-Daten
    danach durch einen Klick auf die verschiedenen Aktualisieren-Kn&ouml;pfe in
    den jeweiligen Fenstern regelm&auml;&szlig;ig selbst abrufen. Ansonsten
    kann die Funktionalit&auml;t des Programms nicht sichergestellt
    werden.</strong></li>
  <li><p><a name="infoservice_redundat"><b>Redundante Anfragen an verschiedene
    InfoServices stellen</b></a><br>
    Legen Sie fest, von wievielen InfoServices Informationen abgerufen werden
    sollen. Geben Sie z.B. als Anzahl <code>3</code> an, so wird JonDo immer
    versuchen, drei InfoServices nach den verf&uuml;gbaren Datens&auml;tzen
    abzufragen. F&auml;llt einer aus, wird versucht einen anderen als Ersatz zu
    erreichen. Je mehr InfoServices Sie festlegen, desto robuster wird JonDo
    gegen St&ouml;rungen in einzelnen InfoServices, desto l&auml;nger dauert
    aber auch die Abfrage der Informationen. Der Standard-InfoService wird bei
    redundanten Anfragen immer als erstes kontaktiert. <em>In der Beta-Version
    k&ouml;nnen Sie diese Option ganz deaktivieren, so dass grunds&auml;tzlich
    nur der Standard-InfoService abgefragt wird, egal ob dieser verf&uuml;gbar
    ist oder nicht. Dadurch k&ouml;nnen Sie unter Umst&auml;nden keine
    Verbindung zu den InfoServices mehr aufbauen.<br>
    </em></p>
  </li>
  <li><p><b>Verbindungs-Timeout</b><br>
    Sollte Ihre Internetverbindung zu langsam sein, so kann ein zu geringes
    Timeout bei der Abfrage der InfoService-Informationen dazu f&uuml;hren,
    dass keine Verbindung aufgebaut wird und sie keine Informationen von den
    InfoServices erhalten. Ein zu hohes Timeout f&uuml;hrt unter Umst&auml;nden
    zu hohen Wartezeiten beim Abruf der Informationen, wenn ein oder mehrere
    abgefragte InfoServices zu langsam oder nicht verf&uuml;gbar sind. Stellen
    Sie das Timeout deshalb je nach Bedarf h&ouml;her oder niedriger ein. </p>
  </li>
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="services_general.html"><img
src="prev.gif" alt="&lt;-"> Erweiterte Diensteinstellungen</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Anonymit&auml;t
</a></span> <span class="nextlink"><a
href="forwarding_server.html">Forwarding-Server <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
