<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>JonDo-Hilfe: JonDo-Oberfl&auml;che</title>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="browser.html"><img src="prev.gif" alt="<-"> Browsereinstellungen</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_bedienung"> <img src="next.gif" alt="->"> Bedienung </a></span>
<span class="nextlink"><a href="jap.JAPNewView_anonymometer.html">Anonym-O-meter <img src="next.gif" alt="->"></a></span> 
</p>
<hr>

<h2>Die JonDo Oberfl&auml;che</h2>

<div style="float:left; margin-right: 25px; margin-bottom: 30px;">
<img src="japmain.gif">
</div>

<p>
Das JonDo-Hauptfenster enth&auml;lt folgende <a href="#cntl"><b>Bedienelemente</b></a>:
</p>

<ul>
<li>
<p>
<a href="#service_list">Dienste</a><br>
Hier k&ouml;nnen Sie ausw&auml;hlen, welchen der verf&uuml;gbaren JonDonym-Dienste Sie verwenden m&ouml;chten.
</p>
</li>
<li>
<p>
<a href="#anonymity">Anonymit&auml;t</a><br>
Dieses Bedienfeld gibt Ihnen die M&ouml;glichkeit sich mit dem ausgew&auml;hlten JonDonym-Dienst zu verbinden. 
</p>
</li>
</ul>

<p>
&Uuml;berblick &uuml;ber das Programm geben ihnen folgende <a href="#info"><b>Informationsfelder</b></a>:
</p>

<ul>

<li>
<p>
<a href="#anonymometer">Anonym-O-Meter</a><br>
Gibt Ihnen Auskunft, wieviele weitere Nutzer sich mit dem Dienst verbunden haben, den auch Sie verwenden.
</p>
</li>


<li>
<p>
<a href="#restvolume">Restvolumen</a><br>
Zeigt an, wieviel Datenvolumen sich auf Ihrem aktuelles Konto befindet.
</p>
</li>

<li>
<p>
<a href="#cryptdata">&Uuml;bertragene verschl&uuml;sselte Daten</a><br>
z&auml;hlt die Daten, die seit dem Programmstart bereits &uuml;ber den JonDo &uuml;bertragen wurden.
</p>
</li>

<li>
<p>
<a href="#forwarder">Forwarder</a><br>
enth&auml;lt Informationen &uuml;ber den Status des Forwarding-Server, wenn dieser aktiviert ist.
</p>
</li>
</ul>
<p style="clear:left">
Die <a href="#otherbuttons">Buttons</a> <i>Hilfe</i>, <i>Informationen</i>, <i>Einstellungen</i> und <i>Beenden</i>, im unteren Teil des Hauptfensters f&uuml;hren zu einer Reihe weiterer Fenster. Erkl&auml;rungen dazu finden sie im <a href="#otherbuttons">letzten Abschnitt</a>.
</p>
<h3 style="clear: left;"><a name="cntl">Bedienelemente</a></h3>

<ul>
<li>
<p style="clear: left">
<a name="service_list"><b>Dienste</b></a><br>
Direkt unter dem Logo befindet sich die Auswahlliste der verf&uuml;gbaren Mixkaskaden. W&auml;hlen Sie eine Kaskade innerhalb der Liste aus.
</p>
<div>
<img src="service_list.gif" alt="Dienstliste">
</div>
<p>
Der JonDo verbindet sich automatisch mit dieser Kaskade, wenn Sie vorher den Button <i>Ein</i> aktiviert hatten. Der Button <img src="refresh.gif" alt="Aktualisieren"> aktualisiert die Liste.
Die Schaltfl&auml;che <i>Details</i> bringt Sie in das <a href="services_anon.html">Einstellungsfenster</a> von JonDo, wo sie Genaueres zu den verf&uuml;gbaren Diensten erfahren k&ouml;nnen. 
</p>
</li>

<li>
<p style="clear: left;">
<a name="anonymity"><b>Anonymit&auml;t</b></a>
<div style="float:left; padding-right: 20px; padding-bottom:20px;">
<img src="anonymity.gif" alt="Anonymit&auml;tsfeld">
</div>
</p>
<p>
Aktivieren Sie das K&auml;stchen <i>Ein</i> unter <i>Anonymit&auml;t</i>, um sich mit dem JonDonym-Dienst Ihrer Wahl zu verbinden. Wenn der Verbindungsaufbau erfolgreich war, erscheint kurz danach ein Zeiger im <a href="jap.JAPNewView_anonymometer.html">Anonym-O-Meter</a>. Au&szlig;erdem wird die Nutzerzahl des aktuell gew&auml;hlten Anonymisierungsdienstes angezeigt. Wenn der Button <i>Aus</i> aktiviert ist, besteht keinerlei Verbindung zu einem JonDonym-Dienst.
</p>
</li>

</ul>
 <!-- <p><b>Hinweis auf notwendige Aktualisierung</b><br>
  Oben rechts im Fenster neben dem JonDo-Logo finden Sie einen Hinweis, der Sie zum Aktualisieren der JonDo-Software bzw. der Java-Version auffordert. Ein Klick darauf zeigt ihnen, was Sie aktualisieren sollten. Sollte JonDo eine Aktualisierung ben&ouml;tigen, &ouml;ffnet sich dabei das Updatefenster. Im Falle von Java &ouml;ffnet sich dabei ein Hinweis, da&szlig; eine neue Java-Version vorhanden ist. Ein Klick auf "Hilfe" in diesem Popup erkl&auml;rt Ihnen, <A href="updateJava.html">wie sie Java aktualisieren k&ouml;nnen</A>. Sehen Sie keinen solchen Hinweis, sind sowohl Ihr JonDo als auch Java auf dem neuesten Stand. <br>
  Rechts daneben sehen Sie die aktuelle Versionsnummer. Ein Klick darauf zeigt Ihnen Informationen zu der Version und den Entwicklern.
</p>-->

<h3 style="clear: left;"><a name="info">Informationsfelder</a></h3>
<ul>

<li>
<p style="clear:left;">
<a name="anonymometer"><b>Anonym-O-Meter</b></a><br>
 Das Anonym-O-Meter informiert den Nutzer &uuml;ber die aktuelle Auslastung des Anonymisierungsdienstes, die sich folgenderma&szlig;en zusammensetzt: 
</p>
<div style="float:left; padding-right: 35px;">
	<img src="jap.JAPNewView_meter10.gif" alt="Anonym-O-Meter">
</div>

<ul >
	<li><p>Die Anzahl der momentan aktiven Nutzer, die mit dem Internet verbunden sind und im JonDo den anonymen Zugriff aktiviert haben.</p></li>
	<li><p>Die Verkehrssituation, d.h. die Menge der Daten, die von dem Anonymisierungsdienst pro Zeiteinheit verarbeitet und weitergeleitet werden.</p></li>
</ul>

<p style="clear: left">
Aus diesen Informationen kann ein teilweise subjektives Beobachtungsrisiko und eine erreichbare Anonymit&auml;t abgeleitet werden. Je mehr Nutzer aktiv sind und auch Nachrichten senden bzw. empfangen, um so gr&ouml;&szlig;er ist die Anonymit&auml;tsgruppe jeder einzelnen ins Internet gesendeten Nachricht, da potentiell jeder Nutzer die Nachricht gesendet haben k&ouml;nnte. Nimmt man an, dass der Angreifer eine Anzahl Nutzer kontrolliert bzw. selbst angebliche Nutzer simuliert, so f&auml;llt es ihm mit gr&ouml;&szlig;er werdender Anonyit&auml;tsgruppe um so schwerer, alle bis auf einen Nutzer zu kontrollieren. In sp&auml;teren Versionen soll diese Art Angriff dadurch verhindert werden, dass die Nutzer sich bei den Mixen mit Hilfe sogenannter Tickets, d.h. auf ein Pseudonym ausgestellte digitale Berechtigungsmarken, die mit Hilfe sog. Blinder Digitaler Signaturen gebildet werden, anmelden.
</p>
<p>Klicken Sie <A href="jap.JAPNewView_anonymometer.html">hier</A>, um eine Beschreibung f&uuml;r die Zust&auml;nde des Anonym-O-Meters zu bekommen.</p>
</li>

<li>
<p><a name="restvolume"><b>Restvolumen</b></a><br>
 Diese Anzeige gibt an, wieviel Guthaben an Datenvolumen sich noch auf Ihrem Konto befindet. Ein g&uuml;ltiges Konto ist notwendig f&uuml;r die Nutzung der <a href="jondonym.html#premiumservices">Premiumdienste</a>. Mehr &uuml;ber die Verwendung von Konten im JonDo erfahren Sie <A href="payment.html">hier</A>. Um die <a href="appearance.html#expertView">erweiterte Ansicht</a> zu &ouml;ffnen, klicken sie auf den Pfeil links neben der Restvolumensanzeige. Hierdurch erhalten sie weitere Informationen zu ihrem Kontostand:</p>
<ul>
<li>wieviel von Ihrem Konto Sie in dieser Sitzung verbraucht haben,</li>
<li>wieviel von Ihrem Konto Sie insgesamt verbraucht haben und</li>
<li>wann Ihre Kontoinformationen das letzte Mal aktualisiert wurden.</li>
</ul>
<p>Klicken sie wieder auf den Pfeil, um die erweiterte Ansicht zu schlie&szlig;en.</p>
</li>

<li>
<p>
<a name="cryptdata"><b>
&Uuml;bertragene verschl&uuml;sselte Daten</b></a><br>
Zur Information des Nutzers und zur &Uuml;berpr&uuml;fung der Funktionalit&auml;t wird von JonDo angezeigt, wie viele Daten der Nutzer in der aktuellen Sitzung bereits &uuml;ber den Anonymit&auml;tsdienst &uuml;bertragen hat.
Mit dem Pfeil links neben der Datenanzeige k&ouml;nnen Sie die <a href="appearance.html#expertView">erweiterte Ansicht</a> &ouml;ffnen. Hier sind die anonymisierten Daten weiter unterteilt in:
<ul>
<li><i>World Wide Web</i> und</li>
<li><i>anderen Internetdienste</i></li>
</ul>
<p>
Die erweiterte Ansicht l&auml;&szlig;t sich durch erneutes Klicken auf den Pfeil schlie&szlig;en.
</p>
</li>

<li>
<p>
<a name="forwarder"><b>Forwarder:</b></a><br>
Durch die <a href="forwarding_server.html">Forwarding-Funktion</A> k&ouml;nnen andere JonDo-Benutzer &uuml;ber Ihr System eine Verbindung zu einem Anonymisierungsdienst aufbauen. Dies ist hilfreich, wenn der Internetprovider oder eine staatliche Hoheit eines JonDo-Benutzers den Zugang zum Anonymisierungsdienst unterbindet.
</p>
Wenn Sie auf den Pfeil links neben der Anzeige klicken, erhalten Sie folgende Informationen zum Forwarder:

<ul>
<li>
	Wieviele <b>weitergeleitete Verbindungen</b>
	<ul>
	<li>momentan gehalten werden</li>
	<li>angenommen wurden</li>
	<li>abgelehnt wurden</li>
	</ul>
</li>
<li>Wieviel <b>weitergeleitetes Datenvolumen</b> bereits angefallen ist</li>
<li>Welche <b>Bandbreite</b> daf&uuml;r verwendet wird.</li>
</ul>
<p>
<b>Achtung:</b><br> Durch Aktivieren des Forwarders gew&auml;hren Sie Unbekannten Nutzern Zugriff zu Ihrem JonDo. Dabei besteht auch die Gefahr von Mi&szlig;brauch. Au&szlig;erdem m&uuml;ssen Sie dabei Einbu&szlig;en bei Ihrer Internetgeschwindigkeit in Kauf nehmen. Aktivieren Sie den Forwarder also nur, wenn Sie sich wirklich sicher sind.
</p>
</li>
</ul>


<h3><a name="otherbuttons">Weitere Buttons</a></h3>

<ul>
<li>Die Schaltfl&auml;che "Minimieren" (Symbol:  <img src="miniwindow_button1.gif" alt="Miniwindow-Button"> ) l&auml;sst JonDo auf ein Fenster schrumpfen, das nur noch die wichtigsten Informationen anzeigt. Dieses Fenster dockt automatisch am Bildschirmrand an. Dort k&ouml;nnen Sie durch einen Klick auf das JonDo-Icon die Anonymit&auml;t ein- oder ausschalten.
Alternativ k&ouml;nnen Sie das <A href="miniwindow.html">Minifenster</A> auch aufrufen, wenn Sie im JonDo Hauptfenster doppelklicken.</li>
<li><a href="index.html"><b>Hilfe</b></a> &ouml;ffnet diese <a href="index.html">Hilfe zu JonDo</a></li>
<li><b>Assistent</b> hilft Ihnen beim  Einrichten von JonDo</li>
<li><b>Einstellungen</b> &ouml;ffnet das Fenster, in dem Sie alle Einstellungen f&uuml;r JonDo vornehmen k&ouml;nnen</li> 
<li><b>Beenden</b> trennt die Verbindung zu den Diensten und beendet JonDo</li>
</ul>
<hr>
<p class="navipar">
<span class="prevlink"><a href="browser.html"><img src="prev.gif" alt="&lt;-"> Browsereinstellungen</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_bedienung"> <img src="next.gif" alt="->"> Bedienung </a></span>
<span class="nextlink"><a href="jap.JAPNewView_anonymometer.html">Anonym-O-meter <img src="next.gif" alt="->"></a></span> 
</p>

<!--#include virtual="/footer.html"-->
</body>
</html>
