<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>JonDo-Hilfe: JonDo-Oberfl&auml;che</title>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="browser.html"><img src="prev.gif" alt="<-"> Browsereinstellungen</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_bedienung"> <img src="next.gif" alt="->"> Bedienung </a></span>
<span class="nextlink"><a href="jap.JAPNewView_anonymometer.html">Anonym-O-meter <img src="next.gif" alt="->"></a></span> 
</p>
<hr>

<h2>Die JonDo Oberfl&auml;che</h2>
<p><b>Anonymit&auml;t aktivieren</b><br>
  Um anonymes Surfen m&ouml;glich zu machen muss als erstes der JonDo gestartet werden. Danach m&uuml;ssen Sie das K&auml;stchen "Ein" unter "Anonymit&auml;t" aktivieren. Wenn der Verbindungsaufbau erfolgreich war erscheint kurz danach ein Zeiger im <a href="jap.JAPNewView_anonymometer.html">Anonym-O-Meter</a>. Au&szlig;erdem wird die Nutzerzahl des aktuell gew&auml;hlten Anonymisierungsdienstes angezeigt.</p>
  <p><b>Hinweis auf notwendige Aktualisierung</b><br>
  Oben rechts im Fenster neben dem JonDo-Logo finden Sie einen Hinweis, der Sie zum Aktualisieren der JonDo-Software bzw. der Java-Version auffordert. Ein Klick darauf zeigt ihnen, was Sie aktualisieren sollten. Sollte JonDo eine Aktualisierung ben&ouml;tigen, &ouml;ffnet sich dabei das Updatefenster. Im Falle von Java &ouml;ffnet sich dabei ein Hinweis, da&szlig; eine neue Java-Version vorhanden ist. Ein Klick auf "Hilfe" in diesem Popup erkl&auml;rt Ihnen, <A href="updateJava.html">wie sie Java aktualisieren k&ouml;nnen</A>. Sehen Sie keinen solchen Hinweis, sind sowohl Ihr JonDo als auch Java auf dem neuesten Stand. <br>
  Rechts daneben sehen Sie die aktuelle Versionsnummer. Ein Klick darauf zeigt Ihnen Informationen zu der Version und den Entwicklern.
</p>
<p>
<b>Dienstauswahl</b><br>
Direkt unter dem Logo befindet sich die Auswahlliste der verf&uuml;gbaren <a href="jap.JAPConfAnon.html">Dienstfilter</a>. W&auml;hlen Sie eine Mixkaskade innerhalb eines Filters aus, verbindet sich JonDo mit dieser Mixkaskade, und sperrt automatisch die Verbindung zu allen Mixkaskaden au&szlig;erhalb dieses Filters (der Filter wird aktiviert). </p>
<p>Das Symbol daneben mit den runden Pfeilen aktualisiert die Liste.
  Die Schaltfl&auml;che "Details" bringt Sie in das <a href="services_anon.html">Einstellungsfenster</a> von JonDo, wo sie Genaueres zu den verf&uuml;gbaren Diensten erfahren k&ouml;nnen. </p>

<p>
<b>Anonym-O-Meter</b><br>
 Das Anonym-O-Meter informiert den Nutzer &uuml;ber die aktuelle Auslastung des Anonymisierungsdienstes. Im einzelnen sind dies: </p>
<ul>
	<li>Die Anzahl der momentan aktiven Nutzer, die mit dem Internet verbunden sind und im JonDo den anonymen Zugriff aktiviert haben.</li>
	<li>Die Verkehrssituation, d.h. die Menge der Daten, die von dem Anonymisierungsdienst pro Zeiteinheit verarbeitet und weitergeleitet werden.</li>
</ul>

<p>
Aus diesen Informationen kann ein teilweise subjektives Beobachtungsrisiko und eine erreichbare Anonymit&auml;t abgeleitet werden. Je mehr Nutzer aktiv sind und auch Nachrichten senden bzw. empfangen, um so gr&ouml;&szlig;er ist die Anonymit&auml;tsgruppe jeder einzelnen ins Internet gesendeten Nachricht, da potentiell jeder Nutzer die Nachricht gesendet haben k&ouml;nnte. Nimmt man an, dass der Angreifer eine Anzahl Nutzer kontrolliert bzw. selbst angebliche Nutzer simuliert, so f&auml;llt es ihm mit gr&ouml;&szlig;er werdender Anonyit&auml;tsgruppe um so schwerer, alle bis auf einen Nutzer zu kontrollieren. In sp&auml;teren Versionen soll diese Art Angriff dadurch verhindert werden, dass die Nutzer sich bei den Mixen mit Hilfe sogenannter Tickets, d.h. auf ein Pseudonym ausgestellte digitale Berechtigungsmarken, die mit Hilfe sog. Blinder Digitaler Signaturen gebildet werden, anmelden.
</p>
<p>Klicken Sie <A href="jap.JAPNewView_anonymometer.html">hier</A>, um eine Beschreibung f&uuml;r die Zust&auml;nde des Anonym-O-Meters zu bekommen.</p>
<p><b>Kontostand</b><br>
  <b>Premiumdienste</b> buchen den Traffic von ihrem <A href="payment.html">Konto</A> ab. Hier k&ouml;nnen Sie sehen, welchen Kontostand Sie momentan haben. <br>
  Um die <a href="appearance.html#expertView">erweiterte Kontenansicht</a> zu &ouml;ffnen, klicken sie auf den Pfeil links neben der Restvolumensanzeige. Hierdurch erhalten sie weitere Informationen zu ihrem Konto:</p>
<ul>
<li>wieviel von Ihrem Konto Sie in dieser Sitzung verbraucht haben,</li>
<li>wieviel von Ihrem Konto Sie insgesamt verbraucht haben und</li>
<li>wann Ihre Kontoinformationen das letzte Mal aktualisiert wurden.</li>
</ul>
<p>Klicken sie wieder auf den Pfeil, um die erweiterte Ansicht zu schlie&szlig;en.</p>
<p>
<b>
Eigene anonymisierte Daten</b><br>
Zur Information des Nutzers und zur &Uuml;berpr&uuml;fung der Funktionalit&auml;t wird von JonDo angezeigt, wie viele Daten der Nutzer in der aktuellen Sitzung bereits &uuml;ber den Anonymit&auml;tsdienst &uuml;bertragen hat.
Mit dem Pfeil links neben der Datenanzeige k&ouml;nnen Sie die <a href="appearance.html#expertView">erweiterte Ansicht</a> &ouml;ffnen. Hier sind die anonymisierten Daten weiter unterteilt in:
<ul>
<li>World Wide Web</li>
<li>anderen Internetdienste</li>
</ul>
<p>
Die erweiterte Ansicht l&auml;&szlig;t sich durch erneutes Klicken auf den Pfeil schlie&szlig;en.
</p>

<p>
<b>Forwarder:</b><br>
Durch die <a href="forwarding_server.html">Forwarding-Funktion</A> k&ouml;nnen andere JonDo-Benutzer &uuml;ber ihr System eine Verbindung zu einem Anonymisierungsdienst aufbauen. Dies ist hilfreich, wenn der Internetprovider oder eine staatliche Hoheit eines JonDo-Benutzers den Zugang zum Anonymisierungsdienst unterbindet.
</p>
<p>
<b>Achtung :</b><br> Dadurch besteht f&uuml;r Sie die Gefahr in den Verdacht einer Straftat zu geraten, die von einem JonDo-Benutzer begangen wurde, der ihr System als Forwarder nutzt.<br>
Wenn Sie auf den Pfeil links neben der Anzeige klicken, erhalten Sie folgende Informationen zum Forwarder:
</p>
<ul>
<li>
	Wieviele <b>weitergeleitete Verbindungen</b>
	<ul>
	<li>momentan gehalten werden</li>
	<li>angenommen wurden</li>
	<li>abgelehnt wurden</li>
	</ul>
</li>
<li>Wieviel <b>weitergeleitetes Datenvolumen</b> bereits angefallen ist</li>
<li>Welche <b>Bandbreite</b> daf&uuml;r verwendet wird.</li>
</ul>
<p>
<b>Weitere Schaltfl&auml;chen</b>
</p>
<ul>
<li>Die Schaltfl&auml;che "Minimieren" (Symbol:  <img src="miniwindow_button1.gif" alt="Miniwindow-Button"> ) l&auml;sst JonDo auf ein Fenster schrumpfen, das nur noch die wichtigsten Informationen anzeigt. Dieses Fenster dockt automatisch am Bildschirmrand an. Dort k&ouml;nnen Sie durch einen Klick auf das JonDo-Icon die Anonymit&auml;t ein- oder ausschalten.
Alternativ k&ouml;nnen Sie das <A href="miniwindow.html">Minifenster</A> auch aufrufen, wenn Sie im JonDo Hauptfenster doppelklicken.</li>
<li><b>Hilfe</b> &ouml;ffnet die Hilfe zu JonDo</li>
<li><b>Assistent</b> hilft Ihnen beim  Einrichten von JonDo</li>
<li><b>Einstellungen</b> &ouml;ffnet das Fenster, in dem Sie alle Einstellungen f&uuml;r JonDo vornehmen k&ouml;nnen</li> 
<li><b>Beenden</b> trennt die Verbindung zu den Diensten und beendet JonDo</li>
</ul>
<hr>
<p class="navipar">
<span class="prevlink"><a href="browser.html"><img src="prev.gif" alt="<-"> Browsereinstellungen</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_bedienung"> <img src="next.gif" alt="->"> Bedienung </a></span>
<span class="nextlink"><a href="jap.JAPNewView_anonymometer.html">Anonym-O-meter <img src="next.gif" alt="->"></a></span> 
</p>

<!--#include virtual="/footer.html"-->
</body>
</html>
