<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="wwwprivacy.html"><img src="prev.gif"> WWW-Privatsph&auml;re</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_intro"> <img src="next.gif"> Einf&uuml;hrung</a></span>
<span class="nextlink"><a href="about.html">JonDo <img src="next.gif"></a></span> 
</p> 
<hr>

<h2>JonDonym</h2>
<p>
Der Anonymit&auml;tsdienst JonDonym besteht aus mehreren einzelnen w&auml;hlbaren Mixkaskaden. Diese wiederum setzen sich aus mehreren Mixen zusammen, die im Regelfall von jeweils voneinander unabh&auml;ngigen Organisationen betrieben werden. Als Mixe werden die Zwischenstationen bezeichnet, die die Nutzerdaten anoynm zustellen. Die Betreiber dieser Mixe haben in einer <a href="http://anon.inf.tu-dresden.de/operators/help/operatorCommitment.html">Selbstverpflichtung</a> erkl&auml;rt, dass sie weder Verbindungsdaten speichern, noch mit den anderen Mix-Betreibern Daten austauschen, die dazu f&uuml;hren k&ouml;nnten, dass ein Benutzer von JonDo enttarnt wird. Die Mixbetreiber sind au&szlig;erdem <a href="certificates.html">zertifiziert</a>, so dass deren Identit&auml;t immer &uuml;berpr&uuml;fbar ist. 
</p>
<p>
Um jedoch den maximalen Schutz der Privatssph&auml;r zu erreichen, wird davon ausgegangen, dass nicht allen Mixanbieter  uneingeschr&auml;nkt vertrauensw&uuml;rdig sind, auch wenn dies unwahrscheinlich ist. Wenn bereits einer der meist drei Anbieter den Mix ordnungsgem&auml;&szlig; und sicher betreibt, ist der vollst&auml;ndige Schutz dennoch gew&auml;hrleistet, auch wenn die anderen Anbieter dies nicht tun w&uuml;rden oder sogar selbst b&ouml;sartig w&auml;ren.
</p>

<p>
Die Anonymisierung des Datenverkehrs erfolgt dadurch, dass jede Anfrage des Nutzers mehrfach verschl&uuml;sselt &uuml;ber Mixkaskade gesendet werden. Jeder Mix in dieser Sequenz kann davon jeweils eine Entschl&uuml;sselungsoperation durchf&uuml;hren. So k&ouml;nnen die Datenpakete sukzessivehergestellt werden, wenn sie die Kaskade durchlaufen. Durch die Mehrfache Verschl&uuml;sselung jedoch wird sichergestellt, dass jeder Mix nur einen Teil des Wiederherstellungsprozess &uuml;bernehmen und den Nutzer nicht allein enttarnen kann. 
</p>
<p>
Bei JonDonym haben Sie die Wahl zwischen <b>kostenlosen Diensten</b> und den <b>Premiumdiensten</b>. Bei den kostenlosen Dienste ist Ihre Sicherheit allerdings etwas geringer, da Sie nur von maximal zwei unabh&auml;ngigen Anbietern betrieben werden. Dar&uuml;berhinaus bieten Sie keine Garantien im Hinblick auf Verf&uuml;gbarkeit, &Uuml;bertragungsgeschwindigkeit und Antwortverz&ouml;gerung.
</p>

<!-- Die momentan vorliegende Version erreicht diese Sicherheit
noch nicht vollst&auml;ndig, da sich die Software noch in der Entwicklung
befindet! Diese Version garantiert jedoch bereits eine wesentlich
h&ouml;here Sicherheit  als beispielsweise Systeme, die einfache
<a href="proxy_overview.html">Proxies</a> verwenden.
Uns ist au&szlig;erdem <em>kein</em>  kommerzielles System bekannt, das auch nur ann&auml;hernd die Sicherheit von JonDonym erreichen w&uuml;rde. Einzig das nicht-kommerzielle System <a href="http://tor.eff.org">Tor</a> bietet eine vergleichbare Sicherheit, und ist &auml;hnlich gut dokumentiert und untersucht. 
<P>
Die vorliegende Version sch&uuml;tzt die Anonymit&auml;t des Nutzers
zumindest gegen einen lokalen Angreifer (z.B. den Provider, den Webserver,
den Chef). Zus&auml;tzlich sch&uuml;tzt sie auch gegen die Betreiber
eines Mixes. Je nachdem, welchen Mix ein Betreiber zur Verf&uuml;gung stellt, kann er nur erfahren, welcher Teilnehmer (IP-Nummer) den Dienst nutzt <B>oder</B>
welche Anfragen in das Netz gesendet werden, nicht jedoch von
welcher IP-Nummer eine Anfrage stammt.

<P>
Gegen einen Angreifer, der alle Leitungen des Internets &uuml;berwacht bzw.
den ersten <B>und</B> den letzten Mix kontrolliert, sch&uuml;tzt die
gegenw&auml;rtige Version noch nicht.

<P>
Folgende weitere Gr&uuml;nde haben wir, das System bereits jetzt anzubieten:

<UL>
    <LI>Wir m&uuml;ssen Erfahrungen mit einen laufenden System sammeln, um noch
    enthaltene Fehler und die Probleme in der Praxis kennenzulernen und
    &uuml;berwinden zu k&ouml;nnen.
    <LI>Um einen sicheren Dienst anbieten zu k&ouml;nnen, ben&ouml;tigt man von
    Anfang an eine gro&szlig;e und stabile Anonymit&auml;tsgruppe. Diese Gruppe
    hoffen wir bereits jetzt zu gewinnen und w&auml;hrend der Weiterentwicklung
    zu halten.
</UL>

<P>
Um diese Ziele zu erreichen, ben&ouml;tigen wir Ihre Hilfe. Wir w&auml;ren
Ihnen dankbar, wenn Sie den Anonymisierungsdienst dauerhaft nutzen
w&uuml;rden und uns Ihre Probleme, Meinungen und
Verbesserungsvorschl&auml;ge mitteilen w&uuml;rden.

<P>-->

<h3>Premiumdienste</h3>

<p>
Von besonders hoher Qualit&auml;t sind dabei die <b>Premiumdienste</b>. Wenn Sie Wert legen auf hohe Zuverl&auml;ssigkeit und Verf&uuml;gbarkeit sowie starke Sicherheitseigenschaften und eine hohe Bandbreite, sind Premiumdienste Ihre erste Wahl. Gegen&uuml;ber den kostenlosen Dienste bieten diese folgende Vorteile: 
</p>

<ul>
<li>
<p>
<b>Mehr Sicherheit durch l&auml;ngere Kaskaden</b>:<br> 
Die Mixkaskaden der Premiumdienste bestehen aus mindestens drei Mixen, die jeweils von unterschiedlichen Anbietern betrieben werden. Auf diese Weise ist Ihre Privatssph&auml;re nicht nur gegen&uuml;ber externen Angreifern gesch&uuml;tzt, sondern auch vor den Betreibern der Mixe selbst. Somit k&ouml;nnen Sie sich Ihrer Anonymit&auml;t sicher sein, ohne den Betreibern uneingeschr&auml;nktes Vertrauen entgegenbringen zu m&uuml;ssen.
</p>
</li>

<li>
<p>
<b>Bessere Performance durch garantierte Bandbreite</b>:<br> 
Die Mixbetreiber m&uuml;ssen ein Mindestma&szlig; an Ressourcen zur Verf&uuml;gung stellen, um f&uuml;r die Nutzer der Premiumdienste eine hohe Bandbreite und eine minimale Verz&ouml;gerung zu gew&auml;hrleisten. Auf diese Weise k&ouml;nnen wir Ihnen eine Bandbreite von minimal ISDN-Geschwindigkeit (64-128 kBit) garantieren, wobei in den meisten F&auml;llen h&ouml;here Bandbreiten erzielt werden.   
</p>
</li>

<li>
<p>
<b>Hohe Verf&uuml;gbarkeit durch mehrere Mixkaskaden</b>:<br>
F&uuml;r die Nutzer von Premiumdiensten stehen eine ganze Reihe von Mixkaskaden zur Verf&uuml;gung. Sie k&ouml;nnen zwischen jeder dieser Kaskaden w&auml;hlen, wenn Sie einen Zugang zu den Premiumdiensten besitzen. Somit stehen Ihnen zu jeder Zeit immer ausreichend Kaskaden zur Verf&uuml;gung, mit denen Sie sich verbinden k&ouml;nnen. 
</p>
</li>
</ul>

<p>
Mithilfe der Bezahlfunktion Ihres JonDos sind Sie in der Lage, die Premiumdienste zu nutzen. Um auf diese zugreifen zu k&ouml;nnen, haben Sie die M&ouml;glichkeit <a href="payment_account.html"> Konten </a> zu erstellen. Ein Konto umfasst ein bestimmtes Daten-Volumen, welches Sie &uuml;ber die Premiumdienste abrufen k&ouml;nnen.
Wenn Sie dieses Datenvolumen verbraucht haben, kann diese leere Konto gel&ouml;scht werden. Wenn Sie die Premiumdienste weiter nutzen m&ouml;chten, haben Sie die M&ouml;glichkeit ein neues Konto zu erzeugen.   
</p>
<p>
Wenn Sie ein Konto erzeugen, steht Ihnen eine Reihe von Tarifen zur Auswahl, die sich in Ihrem Preis, dem verf&uuml;gbaren Datenvolumen und der G&uuml;ltigsdauer unterscheiden.
Das Konto wird automatisch aktiviert, sobald Sie JonDos den Betrag &uuml;berwiesen haben, den der von Ihnen gew&auml;hlte Tarif kostet.
F&uuml;r die &Uuml;berweisung k&ouml;nnen Sie zwischen verschiedenen Bezahloptionen ausw&auml;hlen. Derzeit stehen Ihnen zur Verf&uuml;gung:
</p>
<ul>
    <li><b>paysafecard</b></li>
	<li><b>Barzahlung per Brief</b></li>      
	<li><b>Anonyme Bar&uuml;berweisung</b></li>
	<li><b>&Uuml;berweisung</b></li>
    <li><b>PayPal (z.B. Kreditkarte oder ecash)</b></li>
	<li><b>e-gold</b></li>
</ul>
<p>
<p>
Bei den Tarifen haben Sie die Wahl zwischen:
 </p>
<table width="100%" cellspacing="1" cellpadding="1" border="0">
    <tbody>
        <tr>
            <td><strong>Tarif</strong></td>
            <td><strong>Preis</strong></td>
            <td><strong>Max. Volumen</strong></td>
            <td><strong>Max. Laufzeit</strong></td>
            <td><strong>Gesch&auml;tzte Webseitenaufrufe</strong></td>
        </tr>
        <tr>
            <td>Tiny</td>
            <td>1,00 Euro</td>
            <td>120 MB</td>
            <td>2 Monate</td>
            <td>2400</td>
        </tr>
        <tr>
            <td>Medium</td>
            <td>5,00 Euro</td>
            <td>700 MB</td>
            <td>3 Monate</td>
            <td>14000</td>
        </tr>
        <tr>
            <td>Large</td>
            <td>10,00 Euro</td>
            <td>1,5 GB</td>
            <td>3 Monate</td>
            <td>30000</td>
        </tr>
        <tr>
            <td>XXL</td>
            <td>30,00 Euro</td>
            <td>5 GB</td>
            <td>7 Monate</td>
            <td>100000</td>
        </tr>
        <tr>
            <td>Huge</td>
            <td>50,00 Euro</td>
            <td>10 GB</td>
            <td>1 Jahr</td>
            <td>200000</td>
        </tr>
    </tbody>
</table>

<p>(Preisliste vom 06.01.2008)</p>
<p>
<b>Bitte beachten Sie</b>:<br>
Die Tarife und Bezahlmethode k&ouml;nnen sich &auml;ndern. Den neusten Stand finden Sie auf unserer Homepage unter <a href="https://www.jondos.de/de/payment">www.jondos.de/de/payment</a>.
</p>

<b>Hinweis:</b><br>
Mit der Erzeugung eines Kontos entstehen Ihnen keinerlei Zahlungsverpflichtungen. 
JonDos ist <b>kein Abonnement</b>, bei dem Sie nach der Erzeugung eines Kontos zu weiteren Zahlungen verpflichtet sind. 
Das Guthaben auf einem Konto ist <b>Prepaid</b>, d.h. mit Eingang der Zahlung wird Ihr Datenvolumen freigeschaltet und Sie k&ouml;nnen 
alle Premiumdienste solange nutzen, bis Ihr Guthaben aufgebraucht oder die G&uuml;ltigkeit des Kontos abgelaufen ist. Dabei steht es Ihnen frei, ob Sie danach neue Konten erzeugen m&ouml;chten, um die Premiumdienste zu nutzen.
</p>
<p>
Die f&uuml;r die Bezahlung erforderlichen Einstellungen im JonDo finden Sie in dieser <a href="payment.html">Anleitung</a>. 
</p>

<hr>
<p class="navipar">
<span class="prevlink"><a href="wwwprivacy.html"><img src="prev.gif"> WWW-Privatsph&auml;re</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_intro"> <img src="next.gif"> Einf&uuml;hrung</a></span>
<span class="nextlink"><a href="about.html">JonDo <img src="next.gif"></a></span> 
</p>

<!--#include virtual="/footer.html"-->
</body>
</html>