<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<title>JonDo-Hilfe: JonDoFox</title>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="certificates.html"><img src="prev.gif" alt="<-"> Zertifikate</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_browser"> <img src="next.gif" alt="->"> Browservorbereitung </a></span>
<span class="nextlink"><a href="browser.html">andere Browser <img src="next.gif" alt="->"></a></span> 
</p>
<hr>
<h2>JonDoFox</h2>
<p>
<a href="http://www.jondos.de/de/jondofox">JonDoFox</a> ist ein <a href="http://www.mozilla.com">Firefox-Browser</a>, der speziell f&uuml;r das anonyme Surfen mit <a href="jondonym.html">JonDonym</a> optimiert ist. Er besteht aus einem portablen Firefox-Browser und einem von <a href="https://www.jondos.de">JonDos</a> angepassten Profil.
Dieses enth&auml;lt sowohl alle notwendigen Voreinstellungen zum anonymen Surfen &uuml;ber den JonDo, als auch sicherheitskritische <a href="https://addons.mozilla.org/de/firefox/">Add-ons</a>, die potentielle Schwachpunkte, wie z.B. aktive Inhalte und Cookies absichern. Dabei ist der Browser portabel einsetzbar, d.h. man kann Ihn zusammen mit dem JonDo auf einen Wechseldatentr&auml;ger kopieren, um ihn auf jedem beliebigen System ohne lokale Installation auszuf&uuml;hren. Hierbei werden keinerlei Spuren auf dem System hinterlassen, auf dem Sie JonDoFox einsetzen. Aus diesem Grund empfiehlt JonDos empfiehlt den Einsatz von JonDoFox, denn dabei entf&auml;llt f&uuml;r Sie der Konfigurationsaufwand und die Gefahr, dass Sie beim Surfen Datenspuren hinterlassen, ist minimal.
</p>

<p>
<a href="http://www.jondos.de/de/jondofox">JonDoFox</a> ist f&uuml;r <a href="#ffpwindows">Windows</a>, <a href="#ffpmacosx">Mac OS X</a> und <a href="#ffplinux">Linux</a> erh&auml;ltlich. Sie haben auch die M&ouml;glichkeit, das JonDoFox-Profil zu Ihrer bereits bestehende Firefox-Installation hinzuzuf&uuml;gen.
</p>

<p><b>Bitte beachten Sie</b>:<br> Zum anonymen Surfen mit JonDonym gen&uuml;gt es nicht, nur den JonDoFox auszuf&uuml;hren. Hierf&uuml;r ben&ouml;tigen Sie auch den <a href="about.html">JonDo-Client</a>, den Sie auf unserer <a href="https://www.jondos.de/de/download">Downloadseite</a> herunterladen k&ouml;nnen.
</p>

<h3><a name="ffpwindows">Installation unter Windows</a></h3>
<p>
Unter diesem <a href="https://www.jondos.de/de/downloads/JonDoFox.paf.exe">Link</a> finden sie ein portables JonDoFox-Paket, das bereits f&uuml;r die Verwendung mit <a href="http://portableapps.com/">PortableApps</a> vorbereitet ist. Sie k&ouml;nnen diese unter Windows sowohl auf einem Wechseldatentr&auml;ger, z.B einem USB-Stick, verwenden oder das Programm lokal auf Ihrer Festplatte ausf&uuml;hren. Kopieren Sie dazu die Datei <i>JonDoFox.paf</i> auf den Datentr&auml;ger, auf dem Sie JonDoFox ausf&uuml;hren m&ouml;chten und starten Sie das Programm von dort mit einen Doppelklick auf die soeben kopierte Datei.
</p>
<h3><a name="ffpmacosx">Installation unter Mac OS X</a></h3>
<p>
Eine portable Version des JonDoFox f&uuml;r Mac OS X k&ouml;nnen Sie <!-- TODO --><a href="about:blank">hier</a> erhalten. Diese Version kann sowohl von einem portablen Datentr&auml;ger als auch lokal von der Festplatte gestartet werden. Zur Installtion doppelklicken Sie bitte auf die dmg-Datei. Kopieren Sie dann einfach die Firefox-Datei auf einen Datentr&auml;ger Ihrer Wahl. Von dort aus k&ouml;nnen Sie das Programm einfach durch Doppelklick starten.
</p>
<p>
Bitte beachten Sie, dass der portable Firefox Mac OS X 10.4 oder neuer erfordert. F&uuml;r &auml;ltere Versionen installieren Sie bitte einen entsprechenden Firefox, und erg&auml;nzen Sie Ihn um das JonDoFox-Profil. Eine Anleitung dazu finden Sie <a href="#macosxffprofile">hier</a>.
</p>

<h3><a name="ffplinux">Installation unter Linux</a></h3>
<p>
F&uuml;r Linux gibt es leider derzeit noch keine portable Firefox-Version. Wenn Sie JonDoFox unter Linux verwenden wollen, haben Sie die M&ouml;glichkeit eine Firefox-Version zu installieren und diese um das JonDoFox-Profil zu erg&auml;nzen. Das Profil ist unter diesem <a href="https://www.jondos.de/de/downloads/profile.zip">Link</a> erh&auml;ltlich. (Eine <a href="https://www.jondos.de/de/downloads/profile_lite.zip">Lite-Version</a> mit weniger Erweiterungen ist ebenfalls erh&auml;ltlich. Sie bestitzt jedoch alle sicherheitsrelevanten Addons). Zur Installation gehen Sie bitte folgenderma&szlig;en vor:
</p>
<ol>
<li>Installieren Sie Firefox, falls dieser noch nicht auf Ihrem System installiert ist. Firefox erhalten Sie unter <a href="www.mozilla.com">www.mozilla.com</a> </li>
<li>Entpacken Sie die Datei mit <code>unzip profil.zip</code>.</li>
<li>Starten Sie nun den Firefox mit <code> firefox -P</code>. Dadurch wird der Firefox-Profilmanager ge&ouml;ffnet.</li>
<li>Fahren Sie nun fort, wie unter <a href="#ffprofilemanager">Hinzuf&uuml;gen des JonDoFox-Profils, mit dem Firefox-Profilmanager</a> beschrieben.</li>


</ol>

<h3><a name="ffprofile">Vorhandende Firefox-Installation um JonDoFox-Profil erg&auml;nzen</a></h3>
<p>Besitzen Sie bereits eine Firefox-Installation auf Ihrem System, so k&ouml;nnen Sie diese um das JonDoFox-Profil erg&auml;nzen, um ein H&ouml;chstma&szlig; an Anonymit&auml;tat zu erreichen, wenn Sie <b>JonDonym</b> nutzen. Jenachdem welches Betriebssystem Sie verwenden, gibt es dazu folgende Vorgehensm&ouml;glichkeiten:
</p>
<ul>
	<li>
		<b>Windows:</b>
		<ol>
		<li>Laden Sie die <a href="https://www.jondos.de/de/downloads/profile.zip">JonDoFox-Profil-Datei</a> herunter</li> 
		<li>Bei der Profil-Datei handelt es sich um ein zip-Archiv. Entpacken Sie diese. Dabei erhalten Sie einen Ordner, der <i>profile</i> hei&szlig;t.</li>
		<li>W&auml;hlen sie nun: Startmen&uuml; -&gt; Ausf&uuml;hren, 
		<li>Geben sie in das Textfeld ein: <code>firefox -P</code> und dr&uuml;cken Sie auf OK.<br>
(Hinweis: Achten Sie bitte bei der Angabe von &quot;-P&quot; auf die Gro&szlig;- und Kleinschreibung).</li>
		<li>Fahren Sie fort bei der Beschreibung: <a href="#ffprofilemanager">Hinzuf&uuml;gen des JonDoFox-Profils, mit dem Firefox	-Profilmanager</a>.</li>
	</ol>
</li>
<li><a name="macosxffprofile"><b>Mac OS X:</b></a>
	<ol>
		<li>Laden Sie die Image-Datei <a href="https://www.jondos.de/de/downloads/JonDoFox_OS_X.dmg">JonDoFox_OS_X.dmg</a> herunter.</li>
		<li>Doppelklicken Sie auf diese Image-Datei. Das Disk-Image &ouml;ffnet sich daraufhin.</li>
		<li>Das Disk-Image enth&auml;lt die Datei <i>JonDoFox_Install</i>. Doppelklicken Sie auf diese. Dadurch wird eine Installtionsroutine gestartet, die das Profil automatisch zu Ihrer bestehenden Firefox-Installation hinzuf&uuml;gt.</li>
		<li>Sollten Sie bereits ein Profil installiert haben, fragt die Installationsroutine, ob Sie das vorhandene Profil &uuml;berschreiben soll.</li>
		<li>Das Installationsprogramm gibt Ihnen eine R&uuml;ckmeldung &uuml;ber den Erfolg, bevor es sich beendet.</li>
	</ol>
</li>
<li>
<p>
<b>Linux:</b><br>
Gehen Sie hierzu vor, wie in dieser <a href="#ffplinux"> Anleitung </a> beschrieben.
</p>
</li>
</ul>

<h4><a name="ffprofilemanager">Hinzuf&uuml;gen des JonDoFox-Profils, mit dem Firefox-Profilmanager</a></h4>

<p>
Wenn Sie den Profilmanager ge&ouml;ffnet haben, gehen Sie nun folgenderma&szlig;en vor, um das JonDoFox-Profil hinzuzuf&uuml;gen:
</p>
<ol>
<li>W&auml;hlen sie nun <i>Profil erstellen</i>.</li>
<li>Es erscheint der Dialog zum Erstellen eines Profils. Klicken Sie auf <i>Fortsetzen</i>.</li>
<li>In dem jetzt erscheinenden Dialog k&ouml;nnen Sie einen Name f&uuml;r das Profil w&auml;hlen und den Profil-Ordner angeben. Den Namen f&uuml;r das JonDoFox-Profil k&ouml;nnen Sie frei w&auml;hlen. Als Ordner geben Sie bitte das Verzeichnis an, in das Sie die Datei <i>profile.zip</i> entpackt haben.</li>
<li>Beenden Sie die Installation des Profils, indem sie auf <i>Fertigstellen</i> klicken.</li>
</ol>

<h3>Sicherheitskritische Add-ons</h3>
<p>
Durch eine Reihe wichtiger Firefox-Erweiterungen wird der JonDoFox zum optimalen Werkzeug zum anonymen Surfen. Im JonDoFox-Paket sind bereits alle sicherheitsrelevanten Erweiterungen mit den entsprechende Voreinstellungen vorhanden. Dabei haben Sie die &Uuml;bersicht &uuml;ber alle wichtigen Erweiterungen in der Firefox-Statusleiste:
 <div style="text-align:left">
 <img src="jondofoxleiste.gif" alt="JonDoFox-Statusleiste"> 
 </div>
 So haben Sie stets die Kontrolle &uuml;ber die Funktionen die Ihre Privatsp&auml;hre gew&auml;hrleisten. In den folgenden Abschnitten erfahren Sie, wie Sie die Erweiterungen bedienen k&ouml;nnen, um Ihre Privatsph&auml;re im Web zu maximieren.
</p>

<h4>Cookies kontrollieren mit CS-Lite</h4>
<p>
Sicherlich ist Ihre Privatsph&auml;re am besten gesch&uuml;tzt, wenn Ihr JonDoFox die Annahme von Cookies vollst&auml;ndig verweigert. Allerdings wird dadurch das Einloggen auf vielen Internetportalen unm&ouml;glich. Dank CS-Lite haben Sie die M&ouml;glichkeit die Annahme von Cookies so restriktiv wie m&ouml;glich zu gestalten. Sie k&ouml;nnen dazu bestimmen, von welchen Betreibern Sie Cookies annehmen m&ouml;chten und bei welchen Sie dies immer unterbinden wollen. Grunds&auml;tzlich erlaubt CS-Lite die Annahme von Cookies nur, wenn Sie eine explizite Freigabe erteilt haben.
</p>
<p>
Neben der Auswahl, ob Cookies abgelehnt werden sollen oder nicht, k&ouml;nnen Sie die Freigabe von Cookies weiter einschr&auml;nken. Wenn Sie mit der linken Maustaste auf das <span class="nowrap">CS-Lite Icon <img src="cslite.gif" alt="CS-Lite Icon"></span>. Darufhin erscheint folgendes Men&uuml;:
</p>
<div style="text-align:left">
<img src="cslite_menu.gif" alt="CS-Lite Men&uuml;">
</div>
<p>
Hier haben Sie die M&ouml;glichkeit, folgende Berechtigungen zu gew&auml;hren: 
</p>
<ul>
	<li style="list-style-image:url(cslite_temp.gif)">
	<p>
	<b>Tempor&auml;re Berechtigung</b>:<br>
	In diesem Fall wird beim n&auml;chsten Start des JonDoFox kein Cookie mehr von dieser Seite akzeptiert, bzw. wenn Sie dies w&uuml;nschen m&uuml;ssen Sie erneut ein entsprechende Berechtigung dazu geben. Au&szlig;erdem werden die Cookies beim  Beenden von JonDoFox gel&ouml;scht.
	</p>
	</li>
	
	<li style="list-style-image:url(cslite_session.gif)">
	<p>
	<b>Berechtigen w&auml;hrend Sitzung</b>:<br>
	Cookies werden beim n&auml;chsten Start von JonDoFox wieder von dieser Seite akzeptiert. Der Cookie wird beim Beenden von JonDoFox gel&ouml;scht.
	</p>
	</li>
	
	<li style="list-style-image:url(cslite_allow.gif)">
	<p>
	<b>Uneingeschr&auml;nkte Berechtigung</b>:<br>
	Cookies werden beim n&auml;chsten Start von JonDoFox wieder von dieser Seite akzeptiert. Nur abgelaufene Sitzungs-Cookies von dieser Seite werden beim Beenden von JonDoFox gel&ouml;scht.	</p>
	</li>
</ul>
</p>

<p>
Wenn Sie die Cookies sofert entfernen m&ouml;chten, klicken Sie auf <span class="nowrap"><img src="cslite_remove.gif" alt="CS-Lite: Cookies entfernen"> <b>Cookies entfernen</b>.</span>
Sie haben hier auch die M&ouml;glichkeit, bereits erteilte Berechtigungen wieder zu entziehen, indem Sie den Eintrag <b>Blockieren</b> w&auml;hlen. Ebenfalls in diesem Men&uuml; finden Sie den Eintrag <span class="nowrap"><img src="cslite_global.gif" alt="CS-Lite: Cookies global akzeptieren"> <b>Cookies global akzeptieren</b>, </span> um Cookies grunds&auml;tzlich von allen Seitenbetreibern anzunehmen.
</p>
<p>
<b>Hinweis</b>:<br>
Wenn Sie Cookies global akzeptieren, werden grunds&auml;tzlich alle Cookies vom Browser angenommen. Sie erhalten keine R&uuml;ckmeldung, ob Cookies angenommen werden sollen und wenn ja, von wem. Dadurch ist Ihre Privatsp&auml;re nicht mehr gew&auml;hrleistet.
</p>

<h4>Schaden durch aktive Inhalte vermeiden mit NoScript</h4>
<p>
NoScript ist eine Erweiterung, mit der kontrolliert werden kann, ob aktive Inhalte beim Besuch einer Seite ausgef&uuml;hrt werden d&uuml;rfen oder nicht. Prim&auml;r k&ouml;nnen Sie durch NoScript bestimmen, ob und wenn ja welchen Betreiber Sie die Berechtigung erteilen m&ouml;chten JavaScript-Funktionen auszuf&uuml;hren. NoScript ist eine &auml;u&szlig;erst sicherheitskritische Erweiterung, den JavaScript-Funktionen k&ouml;nnen nicht nur schadhafte Funktionen auf Ihrem System ausf&uuml;hren sondern auch identifizierende Eigenschaften von Ihrem Browser auslesen, wie z.B. welche Browser Sie verwenden, auf welchem Betriebssystem er l&auml;uft, welche Gr&ouml;&szlig;e Ihr Browserfenster hat, uvm. Besuchen Sie den <a href="https://www.jondos.de/de/anontest">JonDos-Anonymit&auml;tstest</a>, um zu erfahren, welche Informationen &uuml;ber Ihren Computer sich mit JavaScript ermitteln lassen.
</p>
<p>
Mithilfe von NoScript k&ouml;nnen Sie nicht nur JavaScript-Funktionen an der Ausf&uuml;hrung hindern, sondern auch vermeiden, dass andere aktive Inhalte wie Java oder Flash Schaden anrichten k&ouml;nnen. Dies ist m&ouml;glich, da Sie mit NoScript, die entsprechenden Plugins deaktivieren, die die entsprechenden Inhalte ausf&uuml;hren. 
</p>

<p>
<b>Kontrolle von JavaScript-Funktionen</b>:<br>
In den JonDoFox-Voreinstellungen werden zun&auml;chst alle JavaScript-Inhalte blockiert, wenn Sie eine Seite besuchen. Klicken Sie mit der linken Maustaste auf das <span class="nowrap">NoScript-Icon <img src="noscript.gif" alt="NoScript-Icon"></span> in der Statusleiste. Sie erhalten nun eine Auflistung, welche Seitenbetreiber JavaScript-Funktionen ausf&uuml;hren wollen. Die entsprechenden Eintr&auml;ge sind durch das <span class="nowrap">Icon <img src="noscript_temp.gif" alt="NoScript tempor&auml;r erlauben"></span> gekennzeichnet:
</p>
<table>
<tr>
<td>
<span style="text-align:left;margin-right:50px;">
<img src="noscript_allow.gif" alt="NoScript: Erlaubnis erteilen">
</span>
</td>
<td>
<span style="text-align:left;margin-left:50px;">
<img src="noscript_disallow.gif" alt="NoScript: Erlaubnis entziehen">
</span>
</td>
</tr>
</table>
<p>
Erteilen Sie die Erlaubnis durch ein Klick auf <span><img src="noscript_temp.gif" alt="NoScript tempor&auml;r erlauben"> <b> tempor&auml;r erlauben</b></span> bei dem entsprechenden Listeneintrag. Auf die gleiche Weise k&ouml;nnen Sie eine bereits erteilte Berechtigung wieder entziehen, wie in der rechten Grafik veranschaulicht ist. Wenn Sie allen Betreiber die bereits erteilten tempor&auml;ren Berechtigungen sofort entziehen wollen, k&ouml;nnen Sie dies, indem Sie auf den Eintrag <span><img src="noscript_disallowall.gif" alt="NoScript: Tempor&auml;re Berechtigungen aufheben"><b>Tempor&auml;re Berechtigungen aufheben</b></span> klicken.
</p>
<p>
<b>Hinweis</b>:<br>
Wenn Sie eine Berechtigung erteilen oer gew&auml;hren, wird die Seite mit den jeweiligen Berechtigungen neu geladen.
</p>
<p>
Sollten Sie einem Betreiber grunds&auml;tzlich nicht vertrauen, k&ouml;nnen Sie ihn als <i>nicht vertrauensw&uuml;rdig</i> einstufen. Dies bewirkt, dass Javascript-Funktionen von diesem Anbieter auch keine tempor&auml;re Berechtigung gew&auml;hrt werden kann. Um diese Einstufung durchzuf&uuml;hren, fahren Sie mit der Maus &uuml;ber <span class="nowrap"><img src="noscript_untrwicon.gif" alt="NoScript: nicht vertrauensw&uuml;rdig"> <b>Nicht vertrauensw&uuml;rdig</b>.</span> Sie erhalten dann die &Uuml;bersicht der entsprechenden Anbietern, denen Sie das Vertrauen entziehen k&ouml;nnen: 
</p>
<div style="text-align:left">
<img src="noscript_untrustw.gif" alt="NoScript: nicht vertrauensw&uuml;rdig Men&uuml;">
</div>
<p>
Die Aktion kann auf die gleiche Weise wieder r&uuml;ckg&auml;ngig gemacht werden. 
</p>

<p>
<b>Kontrolle der installierten Plugins</b>:<br>
Wenn Sie eine Webseite besuchen, die aktive Inhalte, wie z.B. Flash-Movies oder Java-Applets &uuml;ber ein Plugin laden will, wird dies von NoScript durch die entsprechenden JonDoFox-Voreinstellungen verhindert. Anstelle des aktiven Inhalts erscheint ein NoScript-Platzhalter (linkes Bild):
<table>
<tr>
<td>
<span style="text-align:left;margin-right:50px;">
<img src="noscript_placeholder.gif" alt="NoScript-Platzhalter">
</span>
</td>
<td>
<span style="text-align:left;margin-left:50px;">
<img src="noscript_blocked.gif" alt="NoScript: Geblockte Objekte Men&uuml;">
</span>
</td>
</tr>
</table>
<p>
Mit einem Klick auf diesen erscheint ein Dialog, durch den Sie den Inhalt freigeben k&ouml;nnen. Wenn Sie die Seite erneut laden, wird der aktive Inhalt von NoScript wieder blockiert. Eine tempor&auml;re Freigabe von aktiven Inhalten durch Plugins k&ouml;nnen Sie auch gew&auml;hren. Indem Sie mit der Maus &uuml;ber den Punkt <span><img src="noscript_blockedcontent.gif" alt="NoScript: Geblockte Objekte"> <b> Geblockte Objekte</b></span> fahren. Es erscheint eine Liste, wie sie das rechte Bild zeigt. In dieser erhalten Sie die &Uuml;bersicht &uuml;ber alle blockierten aktiven Inhalte einschlie&szlig;lich der zugeh&ouml;rigen Plugins. Auch blockierte JavaScript-Inhalte sind in dieser Auflistung enthalten. Klicken sie auf einen der Eintr&auml;ge k&ouml;nnen sie damit die Ausf&uuml;hrung des entsprechenden aktiven Inahlts tempor&auml;r erlauben, bzw. wieder verbieten.
</p>

<h4>Einfaches Umschalten mit SwitchProxy</h4>
<p>
Wenn Sie ohne JonDo im Web surfen wollen, m&uuml;ssen Sie dazu nicht einen neuen Browser straten oder die Proxyeintsellungen von JonDoFox m&uuml;hsam umkonfigurieren. Verwenden Sie einfach die SwitchProxy-Erweiterung, um bequem zwischen JonDo und direkter Internetverbindung hin- und herzuschalten. Wenn Sie mit der rechten Maustaste auf die <span class="nowrap">SwitchProxy-Schaltfl&auml;che <img src="switchProxy_icon.gif" alt="SwitchProxy-Icon"></span> in der Statusleiste klicken, haben Sie bei JonDoFox bereits zwei Auswahlm&ouml;glichkeiten:
</p>

<ul style="list-style-image:url(switchProxy_item.gif)">
<li><b>None</b>: In diesem Fall nimmt JonDoFox direkte Verbindung zum Internet auf und Sie k&ouml;nnen surfen auch wenn JonDo nicht gestartet ist.</li>
<li><b>JonDo</b>: Dies entspricht der Standardeinstellung. JonDoFox schickt hier alle Daten &uuml;ber den JonDo.</li>
</ul>
<p>
<b>Bitte beachten Sie</b>:<br>
Wenn Sie den Eintrag <i>None</i> ausgew&auml;hlt haben, wird Ihre tats&auml;chliche IP-Adresse sichtbar f&uuml;r die Betreiber, deren Seiten Sie aufrufen. Ihre Privatsp&auml;hre kann dadurch nicht mehr sichergestellt werden.
</p>

<hr>
<p class="navipar">
<span class="prevlink"><a href="certificates.html"><img src="prev.gif" alt="hallo"> Zertifikate</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_browser"> <img src="next.gif" alt="->"> Browservorbereitung </a></span>
<span class="nextlink"><a href="browser.html">andere Browser <img src="next.gif" alt="->"></a></span>
</p>

</body>
</html>