<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: JonDonym</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="wwwprivacy.html"><img
src="prev.gif" alt="&lt;-"> WWW-Privatsph&auml;re</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="about.html">Funktionalit&auml;t <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>JonDonym, AN.ON und andere Dienste</h2>

<p>Der Anonymit&auml;tsdienst JonDonym, dessen Technik aus dem <a
href="http://anon.inf.tu-dresden.de">AN.ON-Projekt</a> hervorgegangen ist,
besteht aus mehreren einzeln w&auml;hlbaren Mixkaskaden. Diese wiederum setzen
sich aus bis zu drei Mix-Servern zusammen, die von jeweils voneinander
unabh&auml;ngigen Organisationen oder Privatpersonen betrieben werden, <a
href="certificates.html">deren Identit&auml;t ver&ouml;ffentlicht wird</a>. Die
Betreiber m&uuml;ssen sich an strikte Betriebsrichtlinien halten, die ihnen
verbieten, Verbindungsdaten speichern oder mit den anderen Mix-Betreibern in
der Kaskade Surfdaten von Nutzern austauschen. Jede Internetverbindung eines
Nutzers wird f&uuml;r jeden Mix einer Kaskade einzeln verschl&uuml;sselt und
&uuml;ber die Mixkaskade bis zum Ziel, z.B. zu einer Webseite, gesendet. Ziel
dieser mehrfachen Verschl&uuml;sselung und Weiterleitung ist, dass kein
Mixbetreiber alleine den Nutzer enttarnen kann, und dass Lauscher auf den
Verbindungen (Provider, W-LAN) keine Inhaltsdaten abgreifen k&ouml;nnen. Da
au&szlig;erdem viele Benutzer gleichzeitig den Anonymisierungsdienst nutzen und
sich dabei alle dieselbe <a href="wwwprivacy.html#ip">IP-Adresse</a> teilen,
werden die Internetverbindungen jedes Benutzers unter denen aller anderen
Benutzer auf derselben Kaskade versteckt: Jeder Benutzer k&ouml;nnte der
Urheber einer bestimmten Verbindung gewesen sein. Dieses Verfahren verhindert,
dass Mixbetreiber oder Au&szlig;enstehende (Provider, W-LAN-Lauscher,
Webseiten) erfahren, welche Verbindungen ein bestimmter Benutzer aufgebaut hat
oder von welchem Benutzer eine bestimmte Verbindung stammt.</p>

<p>JonDonym bietet im Vergleich zu anderen Anonymisierungsdiensten einige
konkrete Vorteile:</p>
<ul>
  <li><b>Starke Verschl&uuml;sselung und Authentisierung:</b> Niemand kann den
    Datenverkehr zwischen Ihrem Rechner und dem JonDonym-Dienst mitlesen.</li>
  <li><b>Schutz vor dem Dienstbetreiber:</b> Solange nicht alle Dienstbetreiber
    von JonDonym unabh&auml;ngig voneinander gezwungen werden, Sie zu
    &uuml;berwachen, sind Ihre Internet-Verbindungen sicher. Die Mixbetreiber
    werden regelm&auml;&szlig;ig auf ihre Seriosit&auml;t und
    Professionalit&auml;t gepr&uuml;ft, Ihre Identit&auml;t wird
    ver&ouml;ffentlicht. </li>
  <li><b>Keine Logdaten:</b> Den Mixbetreibern ist es vertraglich untersagt,
    Logdaten &uuml;ber die IP-Adressen der Nutzer zu speichern, auch nicht
    f&uuml;r wenige Sekunden.</li>
  <li><b>Transparente Funktionalit&auml;t:</b> informative
    Programmoberfl&auml;che, publizierte Verfahren, und offene, OSI-konforme
    Quelltexte aller Programmkomponenten</li>
  <li><b>Keine Software-Hintert&uuml;r:</b> Es gibt keine M&ouml;glichkeit,
    einzelne Verbindungen "an JonDonym vorbei" zu &uuml;berwachen. Die Software
    l&auml;uft vollst&auml;ndig auf Ihrem Rechner, und kann nicht ohne Ihre
    Zustimmung manipuliert werden. Beim Update werden keinerlei
    Identit&auml;tsinformationen, Serien- oder Kontonummern
  &uuml;bertragen.</li>
  <li><b>Sicheres Browserprofil:</b> Mit <a href="jondofox.html">JonDoFox</a>
    steht Ihnen ein speziell f&uuml;r anonymes und sicheres Surfen mit JonDonym
    entwickeltes Firefox-Profil kostenlos zur Verf&uuml;gung.</li>
  <li><b>Anonymit&auml;t zum Mitnehmen:</b> <a href="about.html">JonDo</a>
    l&auml;uft auch ohne Installation auf dem Rechner direkt von einem
    tragbaren USB-Stick (Windows / MacOS X).</li>
  <li><b>Weiterentwicklung durch Forschung:</b> Wissenschaftliche Arbeiten an
    der Technischen Universit&auml;t Dresden (AN.ON), der Universit&auml;t
    Regensburg (AN.ON) und bei der JonDos GmbH (JonDonym) erweitern und
    verbessern das System.</li>
  <li><b>Kompetenter, schneller und kostenloser Support:</b> ausf&uuml;hrliche
    Hilfefunktion, betreute Nutzerforen, E-Mail-Support</li>
</ul>

<p>Eine &auml;hnlich starke Anonymisierung kann nur das nicht-kommerzielle
System <a href="http://tor.eff.org/">Tor</a> bieten, welches f&uuml;r
Internet-Profis als Erg&auml;nzung zu JonDonym sehr empfehlenswert ist.
Internet-Anf&auml;nger und Computer-Unerfahrene sollten mit Tor jedoch
vorsichtig sein: bei diesem Dienst wird nicht kontrolliert, welche Menschen die
Server betreiben, &uuml;ber die ihre Daten laufen. In der Vergangenheit gab es
immer wieder den Verdacht, dass Kriminelle und Geheimdienste das Tor-Netzwerk
missbrauchen, um unbemerkt an unverschl&uuml;sselt &uuml;bertragene
Informationen wie Passw&ouml;rter, Kontoverbindungen und Kreditkartendaten
abzufangen und zu missbrauchen. Mit bestimten Tricks k&ouml;nnen einzelne
Tor-Server besonders viel Datenverkehr auf sich leiten, um diese Angriffe
effektiver zu machen.</p>

<p>Auch die jeweils letzten Mix-Server einer JonDonym-Kaskade k&ouml;nnten
Datenverkehr, der nicht zus&auml;tzlich &uuml;ber HTTPS/SSL gesichert ist,
mitschneiden. Im Gegensatz zu Tor und anderen Diensten k&ouml;nnen allerdings
nur von JonDos und eventuell weiteren Zertifizierungsstellen auf Ihre
Seriosit&auml;t gepr&uuml;fte und namentlich ver&ouml;ffentlichte Personen und
Organisationen einen Mix-Server betreiben. Die Nutzer k&ouml;nnen dann selbst
entscheiden, ob sie den jeweiligen Betreibern vertrauen m&ouml;chten oder
nicht. Dadurch wird es sehr unwahrscheinlich, dass sich kriminelle Betreiber in
JonDonym einschleichen und ungestraft ihr Unwesen treiben k&ouml;nnen.</p>

<h3><a name="premium" id="premium">Premiumdienste</a></h3>

<p>Bei JonDonym haben Sie die Wahl zwischen kostenlosen Diensten und den
Premiumdiensten, welche kostenpflichtig sind. <b>Durch die freiwillige
Prepaid-Buchung der Premiumdienste unterst&uuml;tzen Sie den Erhalt des
JonDonym-Systems und die Weiterentwicklung der JonDo-Software</b>. Die
Premiumdienste bieten Ihnen zus&auml;tzlich zu den sonstigen
JonDonym-Eigenschaften folgende Vorteile:</p>
<ul>
  <li><b>Leistungsgarantie:</b> Geschwindigkeit von mindestens 100 kbit/s und
    Verz&ouml;gerung von maximal 4 Sekunden zu 90% der Tageszeit. Kostenlose
    Dienste, auch Tor, sind in der Regel deutlich langsamer.</li>
  <li><b>Verf&uuml;gbarkeitsgarantie</b>: Eine Verbindung zum JonDonym-System
    ist zu jeder Zeit m&ouml;glich.</li>
  <li><b>Rechtssicherheit:</b> Entwicklungs-, Support- und Rechnungsadresse in
    sind Deutschland statt bei einer anonyme Offshore-Firma ohne
    ladungsf&auml;hige Anschrift. Deutschland setzt weltweit Standards im
    Verbraucherschutz.</li>
  <li><b>Drei-Betreiber-Garantie:</b> Jede Mixkaskade wird von jeweils drei
    voneinander unabh&auml;ngigen Organisationen oder Personen betrieben.</li>
  <li><b>Internationalit&auml;tsgarantie:</b> Mixe und Betreiber jeder
    Mixkaskade stehen verteilt in jeweils mindestens zwei unterschiedlichen
    L&auml;ndern. Dies verhindert, dass gro&szlig;e Netzknoten (CIX) den
    gesamten Datenverkehr beobachten k&ouml;nnen. Nebenbei wird dadurch
    zuverl&auml;ssig jede nationale Vorratsdatenspeicherung ausgehebelt, da
    nicht alle Mixe einer Kaskade mitloggen.</li>
  <li><b>Verbindungsgarantie:</b> Die Mixbetreiber blockieren keine
    Internetports.</li>
  <li><b>Demn&auml;chst: SOCKS-Unterst&uuml;tzung</b>: Sie k&ouml;nnen das
    SOCKS-Protokoll zus&auml;tzlich zu HTTP einsetzen und damit die meisten
    Internetprogramme anonymisieren.</li>
</ul>

<p>Wenn Sie die Premiumdienste nutzen m&ouml;chten, erstellen Sie in Ihrem
JonDo-Programm ein <a href="payment_account.html">Einmalkonto</a> und
aktivieren es mittels Bezahlung &uuml;ber eine anonyme oder nicht-anonyme <a
href="https://www.jondos.de/de/payment">Bezahlmethode Ihrer Wahl</a>. Danach
steht ihnen <a href="https://www.jondos.de/de/payment">je nach gew&auml;hltem
Tarif</a> ein bestimmtes Datenvolumen f&uuml;r die Nutzung der Premiumdienste
zur Verf&uuml;gung. Wenn dieses Datenvolumen verbraucht ist und Sie mit
JonDonym zufrieden sind, k&ouml;nnen Sie jederzeit ein neues Einmalkonto
erzeugen und aktivieren.</p>

<p>Hinweise zum Datenschutz: Zur Abrechnung des Datenvolumens mit den
Mixbetreibern wird jeweils kumulativ gespeichert, wie viel Volumen ein Konto
auf welcher Mixkaskade verbraucht. Eine mehr als tagesgenaue Abrechnung erfolgt
dabei nicht. Eine Zuordnung von Konten zu Nutzeridentit&auml;ten wird nicht
gespeichert. &Uuml;ber das abgerechnete Datenvolumen ist es technisch nicht
m&ouml;glich, aufgerufene Internetseiten zu erkennen, selbst bei
sekundengenauer (maximal genauer) Speicherung.</p>

<h3>Zus&auml;tzliche Absicherung mit VPN-Diensten wie Relakks, Steganos Anonym
VPN, Perfect Privacy, Cyber Ghost VPN, XeroBank VPN</h3>

<p>JonDonym und Tor sind zwar die technisch besten Anonymisierungssysteme,
haben aber prinzipbedingt kleine Nachteile, die man bei der Benutzung beachten
sollte:</p>
<ul>
  <li>Browser-Plugins (Java/Flash/Silverlight/ActiveX) m&uuml;ssen deaktiviert
    werden. Ansonsten kann die wahre IP-Adresse des Rechners/Routers von einer
    Webseite aufgedeckt werden.</li>
  <li>Die &Uuml;bertragungsgeschwindigkeit liegt grunds&auml;tzlich deutlich
    unter DSL-Niveau (maximal 1-2 MBit/s sind m&ouml;glich).</li>
  <li>Anwendungen werden nicht transparent anonymisiert, sondern m&uuml;ssen
    jeweils einzeln konfiguriert werden (der <a
    href="jondofox.html">JonDoFox-Browser</a> ist jedoch schon
  vorkonfiguriert).</li>
  <li>Nicht alle Anwendungen k&ouml;nnen anonymisiert werden
    (HTTP/SOCKS-Proxies m&uuml;ssen von der jeweiligen Anwendung
    unterst&uuml;tzt werden).</li>
</ul>

<p>Falls JonDo mit einer bestimmten Anwendung nicht kompatibel ist, oder
f&uuml;r eine bestimmte Anwendung eine weniger starke Anonymisierung zugunsten
von mehr Geschwindigkeit gew&uuml;nscht wird, kann es empfehlenswert sein,
neben JonDonym noch ein VPN-System (Virtuelles Privates Netzwerk) als
zus&auml;tzliche Sicherheitsschicht einzusetzen. Ein VPN kann zumindest einen
begrenzten Schutz f&uuml;r Ihre IP-Adresse bieten, wenn Sie gelegentlich
(unsignierte) Java- oder Flash-Applets einsetzen. Achten Sie in diesem Fall
aber unbedingt darauf, dass Ihr Rechner hinter einem Router steht oder in einer
virtuellen Maschine l&auml;uft. Auch JonDos bereitet bis Ende 2009 ein eigenes
VPN-Erg&auml;nzungsangebot vor, das als kostenpflichtiges Kombi-Paket
integriert in JonDo erh&auml;ltlich sein wird.</p>

<p>Zum Websurfen, au&szlig;er vielleicht f&uuml;r gr&ouml;&szlig;ere Downloads,
sollten VPN-Dienste allerdings nicht eingesetzt werden. Denn zum Einen
k&uuml;mmern sich deren Anbieter nicht darum, dass die Nutzer auch &uuml;ber
andere Merkmale als die IP-Adresse im Web wiedererkennbar sind (<a
href="wwwprivacy.html">siehe vorangegangenes Kapitel</a>). Zum Anderen kann ein
lokaler Beobachter in Ihrem Netz (Provider, W-LAN) durch eine
Gr&ouml;&szlig;en- und Zeitanalyse des verschl&uuml;sselten VPN-Datenstroms
recht gut auf &uuml;ber das VPN abgerufene Webseiten schlie&szlig;en. JonDonym
und Tor sind gegen diesen Angriff dagegen sehr resistent (ein
Forschungsartikel, der den Angriff demonstriert und experimentelle Ergebnisse
auflistet, ist in Vorbereitung; die Erkennungsraten von Webseiten liegen bei
VPNs &gt;90%). Au&szlig;erdem sollte Ihnen immer klar sein, dass Anbieter von
VPN-Systemen, im Gegensatz zu JonDonym und Tor, jeden Ihrer Schritte verfolgen
und speichern k&ouml;nnen, da sie s&auml;mtliche Server des VPN kontrollieren -
auch wenn manche Anbieter, wie z.B. XeroBank, etwas anderes behaupten. Jedoch
ist der Schutz durch das VPN eines professionellen und seri&ouml;sen Anbieters
oft besser als gar kein Schutz. </p>
<hr>

<p class="navipar"><span class="prevlink"><a href="wwwprivacy.html"><img
src="prev.gif" alt="&lt;-"> WWW-Privatsph&auml;re</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="about.html">Funktionalit&auml;t <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
