<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: JonDoFox</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="firststeps.html"><img
src="prev.gif" alt="&lt;-"> JonDo &ndash; Erste Schritte</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_browser"><img src="next.gif" alt="-&gt;">
Browservorbereitung </a></span> <span class="nextlink"><a
href="browser.html">Alternative Browser <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>JonDoFox - Sicherheit und Privatsph&auml;re f&uuml;r Firefox</h2>

<p><a href="http://www.jondos.de/de/jondofox">JonDoFox</a> ist ein <a
href="http://www.mozilla-europe.org/de/firefox/">Firefox</a>-Browserprofil, das
speziell f&uuml;r das anonyme Surfen mit <a href="jondonym.html">JonDonym</a>
optimiert ist. Dieses enth&auml;lt sowohl alle notwendigen Voreinstellungen und
Erweiterungen zum sicheren und anonymen Surfen &uuml;ber den JonDo. </p>

<p><b>Bitte beachten Sie</b><br>
Zum anonymen Surfen mit JonDonym gen&uuml;gt es au&szlig;erdem nicht, nur den
JonDoFox zu installieren. Hierf&uuml;r ben&ouml;tigen Sie auch das <a
href="about.html">JonDo-Programm</a>, das Sie von unserer <a
href="https://www.jondos.de/de/download">Downloadseite</a> herunterladen
k&ouml;nnen.</p>

<h3><a name="ffprofile" id="ffprofile">Profil-Installation</a></h3>

<p>Installieren Sie zun&auml;chst <a
href="http://www.mozilla-europe.org/de/firefox/">Firefox</a> auf Ihrem System,
falls noch nicht geschehen<a
href="http://www.mozilla-europe.org/de/firefox/">.</a> Anschlie&szlig;end
k&ouml;nnen Sie die Installation von JonDoFox durchf&uuml;hren. Eine eventuell
von Ihnen vorher angelegte "normale" Firefox-Konfiguration wird dadurch nicht
angetastet. Sie k&ouml;nnen nach der Installation beim Start von Firefox dann
zwischen beiden Konfiguratioen w&auml;hlen. Gehen Sie zur Installation von
JonDoFox bitte wie folgt vor:</p>
<ul>
  <li><a name="ffpwindows"><b>Windows</b></a> 
    <p>Starten Sie das <a
    href="https://www.jondos.de/de/downloads/JonDoFox.paf.exe">JonDoFox-Installationsprogramm</a>,
    w&auml;hlen Sie "Minimal" oder "Komplett" und folgen Sie dann den
    Anweisungen.</p>
  </li>
  <li><a name="ffpmacosx"><b>Mac OS X</b></a> 
    <ol>
      <li>Laden Sie die Datei <a
        href="https://www.jondos.de/de/downloads/JonDoFox_OS_X.dmg">JonDoFox_OS_X.dmg</a>
        herunter. (Eine <a
        href="https://www.jondos.de/de/downloads/JonDoFox_OS_X_lite.dmg">Lite-Version</a>
        mit nur den sicherheitsrelevanten Erweiterungen ist ebenfalls
        erh&auml;ltlich.)</li>
      <li>&Ouml;ffnen Sie die Datei durch einen Doppelklick, und starten Sie
        anschlie&szlig;end <em>JonDoFox_Install</em> ebenfalls durch einen
        Doppelklick.</li>
    </ol>
  </li>
  <li><a name="ffplinux"><b>Linux</b></a> 
    <ol>
      <li>Laden Sie die Datei <a
        href="https://www.jondos.de/de/downloads/profile.zip">profile.zip</a>
        herunter. (Eine <a
        href="https://www.jondos.de/de/downloads/profile_lite.zip">Lite-Version</a>
        mit nur den sicherheitsrelevanten Erweiterungen ist ebenfalls
        erh&auml;ltlich.)</li>
      <li>Entpacken Sie die Datei, z.B. von der Kommandozeile mit dem Befehl
        <code>unzip profile.zip</code>.</li>
      <li>Starten Sie nun den Firefox-Profilmanager von der Kommandozeile mit
        dem Befehl <code>firefox -P</code>.</li>
      <li>W&auml;hlen Sie im Profilmanager nun <i>Profil erstellen</i>.</li>
      <li>Es erscheint der Dialog zum Erstellen eines Profils. Klicken Sie auf
        <i>Fortsetzen</i>.</li>
      <li>In dem jetzt erscheinenden Dialog k&ouml;nnen Sie einen Namen
        f&uuml;r das Profil w&auml;hlen und den Profil-Ordner angeben. Den
        Namen f&uuml;r das JonDoFox-Profil k&ouml;nnen Sie frei w&auml;hlen.
        Als Ordner geben Sie bitte das Verzeichnis an, in das Sie den Inhalt
        der Datei <i>profile.zip</i> entpackt haben.</li>
      <li>Indem sie auf <i>Fertigstellen</i> klicken beenden Sie die
        Installation.</li>
    </ol>
  </li>
</ul>

<p>Wenn eine neue Version von JonDoFox erscheint, k&ouml;nnen Sie die neue
Version jeweils "&uuml;ber" die alte Installieren, also ins gleiche
Verzeichnis. Ihre Bookmarks bleiben dabei erhalten. </p>

<h3>Installation "zum Mitnehmen" unter Windows (2000, XP, Vista)</h3>

<p>Das <a
href="https://www.jondos.de/de/downloads/JonDoFox.paf.exe">JonDoFox-Installationsprogramm</a>
ist auch f&uuml;r die Installation "zum Mitnehmen" geeignet. Wenn Sie die
entsprechende Option w&auml;hlen, k&ouml;nnen Sie JonDoFox damit also sowohl
auf einem Wechseldatentr&auml;ger als auch auf Ihrer Festplatte einrichten.
Eine bereits auf Ihrem Rechner vorhandene Firefox- oder JonDoFox-Installation
wird davon nicht beeinflusst, sofern Sie JonDoFox nicht ins gleiche Verzeichnis
installieren und eine vorhandene Installation dadurch aktualisieren. Beim
Aktualisieren von fr&uuml;heren JonDoFox-Versionen bleiben Ihre Bookmarks
erhalten. JonDoFox "zum Mitnehmen" ist kompatibel zum <a
href="http://portableapps.com/">PortableApps</a>-Men&uuml; f&uuml;r das auch
viele <a href="http://portableapps.com/apps">andere Anwendungen erh&auml;ltlich
sind</a>.</p>

<h3>Installation "zum Mitnehmen" unter Mac OS X (10.4 oder h&ouml;her)</h3>

<p>Eine Version des JonDoFox "zum Mitnehmen" f&uuml;r Mac OS X erhalten Sie <!-- TODO -->
<a href="about:blank">hier</a>. Diese Version kann sowohl von einem
Wechseldatentr&auml;ger als auch von Ihrer Festplatte gestartet werden. Zur
Installation klicken Sie bitte doppelt auf die dmg-Datei. Kopieren Sie dann
einfach die Firefox-Datei auf einen Datentr&auml;ger Ihrer Wahl. Von dort aus
k&ouml;nnen Sie das Programm einfach durch einen weiteren Doppelklick starten.
</p>

<h3><a name="critical_addons">Sicherheitskritische
Firefox-Erweiterungen</a></h3>

<p>Im JonDoFox-Paket sind bereits alle f&uuml;r Ihre Sicherheit relevanten
Erweiterungen mit optimalen Voreinstellungen vorhanden. Im "Komplett"-Paket
finden Sie au&szlig;erdem weitere n&uuml;tzliche Erweiterungen, die wir auf
Ihre Sicherheit und Kompatibilit&auml;t mit JonDoFox einzeln getestet haben.
&Uuml;ber die Firefox-Statusleiste haben Sie stets die Kontrolle &uuml;ber die
wichtigsten der in JonDoFox integrierten Funktionen: </p>

<div style="text-align:left">
<img alt="Statuszeile JonDoFox (CSLite, NoScript, AdblockPlus, JonDoFox)"
src="jondofox_statusbar.png" width="139"></div>

<h3>Cookies kontrollieren mit CS-Lite </h3>

<p>&Uuml;ber CS-Lite k&ouml;nnen Sie sehr komfortabel bestimmen, von welchen
Webseiten Sie Cookies annehmen und bei welchen Sie Cookies unterbinden wollen.
Wenn Sie mit der linken Maustaste auf das <span class="nowrap">Icon <img
src="cslite.gif" alt="CS-Lite Icon"></span> von CS-Lite klicken, k&ouml;nnen
Sie folgende Freigaben f&uuml;r die jeweils besuchte Webseite vornehmen: </p>

<div style="text-align:left">
<img src="cslite_menu.gif" alt="CS-Lite Men&uuml;"> </div>
<ul>
  <li style="list-style-image:url(cslite_temp.gif)"><b>Tempor&auml;r
    akzeptieren</b><br>
    Das Cookie wird nur f&uuml;r die momentane Browsersitzung akzeptiert und
    danach gel&ouml;scht. Nach einem Neustart des Browsers hat die Webseite
    keine Berechtigung mehr, ein Cookie zu setzen. <strong>Dies ist die
    empfohlene Einstellung, falls Sie Cookies aktivieren
  m&ouml;chten.</strong></li>
  <li style="list-style-image:url(cslite_session.gif)"><b>Berechtigen
    w&auml;hrend Sitzung</b><br>
    Das Cookie wird nur f&uuml;r die momentane Browsersitzung akzeptiert und
    danach gel&ouml;scht. Die Webseite darf nach dem Neustart des Browsers
    wieder ein neues Cookie setzen.</li>
  <li style="list-style-image:url(cslite_allow.gif)"><b>Berechtigen</b><br>
    Das Cookie wird solange im Browser gespeichert wie von der Webseite
    vorgegeben wird. Es kann auch nach dem Neustart des Browsers erhalten und
    von der Webseite angefordert werden. </li>
  <li style="list-style-image:url(cslite_remove.gif)"><b>Entfernen</b><br>
    Das Cookie kann nun nicht mehr von der Webseite ausgelesen oder gesetzt
    werden.</li>
</ul>

<p><strong>Warnung:</strong> Die Funktion <span class="nowrap"><img
src="cslite_global.gif" alt="CS-Lite: Cookies global akzeptieren"> <b>Cookies
global akzeptieren</b></span> sollten Sie wenn m&ouml;glich niemals verwenden.
Dadurch werden alle Cookies nicht explizit <span class="nowrap"><img
src="cslite.gif" alt="CS-Lite: Cookies global akzeptieren">
<b>blockierter</b></span> Webseiten zugelassen und man kann Ihre Schritte im
Web verfolgen.</p>

<h3>Werbung filtern mit AdblockPlus</h3>

<p>AdblockPlus <img alt="AdblockPlus" src="abp-enabled-16.png" width="16">
arbeitet als Werbefilter im Hintergrund. Normalerweise m&uuml;ssen Sie dessen
Einstellungen nicht ver&auml;ndern, k&ouml;nnen aber jederzeit eigene
Filterlisten erg&auml;nzen.</p>

<h3>Aktive Inhalte kontrollieren mit NoScript</h3>

<p>NoScript <img src="noscript.gif" alt="NoScript-Icon"> gibt Ihnen eine
komfortable Kontrolle dar&uuml;ber, welche der potentiell gef&auml;hrlichen
Scripte oder Plugin-Inhalte auf einer Webseite ausgef&uuml;hrt werden
d&uuml;rfen und welche nicht.</p>

<p><b>Kontrolle der installierten Plugins</b><br>
Wenn Sie eine Webseite besuchen, die Plugin-Inhalte wie Flash-Movies oder
Java-Applets enth&auml;lt, werden diese von NoScript grunds&auml;tzlich
blockiert. Anstelle des aktiven Inhalts erscheint ein NoScript-Platzhalter
(linkes Bild): </p>

<table>
  <tbody>
    <tr>
      <td><span style="text-align:left;margin-right:50px;"><img
        src="noscript_placeholder.gif" alt="NoScript-Platzhalter"> </span> </td>
      <td><span style="text-align:left;margin-left:50px;"><img
        src="noscript_blocked.gif" alt="NoScript: Geblockte Objekte Men&uuml;">
        </span> </td>
    </tr>
  </tbody>
</table>

<p>Sie k&ouml;nnen den jeweiligen Inhalt durch einen Klick auf den Platzhalter
oder &uuml;ber die Auswahl <span><img src="noscript_blockedcontent.gif"
alt="NoScript: Geblockte Objekte"> <b>Geblockte Objekte</b></span> im
NoScript-Men&uuml; <img src="noscript.gif" alt="NoScript-Icon"> freigeben. </p>

<p><strong>Warnung:</strong> Ohne <a
href="https://www.jondos.de/de/jondofox/faq#11n1326">spezielle
Schutzma&szlig;nahmen</a> kann &uuml;ber freigegebene Plugin-Inhalte Ihre
Anonymit&auml;t ganz oder teilweise aufgehoben und sogar Ihr System
besch&auml;digt werden.</p>

<h4>Kontrolle von JavaScript</h4>

<p>Wenn Sie auf das <span class="nowrap">NoScript-Icon <img src="noscript.gif"
alt="NoScript-Icon"></span> in der Statusleiste klicken, erhalten nun eine
Auflistung der auf der besuchten Webseite eingebundenen
Adressen/Dienstanbieter, f&uuml;r welche Sie JavaScript zulassen k&ouml;nnen.
Die entsprechenden Eintr&auml;ge sind durch das <span class="nowrap">Icon <img
src="noscript_temp.gif" alt="NoScript tempor&auml;r erlauben"></span>
gekennzeichnet: </p>

<table>
  <tbody>
    <tr>
      <td><span style="text-align:left;margin-right:50px;"><img
        src="noscript_allow.gif" alt="NoScript: Erlaubnis erteilen"> </span>
      </td>
      <td><span style="text-align:left;margin-left:50px;"><img
        src="noscript_disallow.gif" alt="NoScript: Erlaubnis entziehen">
        </span> </td>
    </tr>
  </tbody>
</table>

<p>Durch ein Klick auf <span><img src="noscript_temp.gif"
alt="NoScript tempor&auml;r erlauben"> <b>tempor&auml;r erlauben</b></span> bei
dem entsprechenden Listeneintrag aktivieren Sie die Skripte f&uuml;r diesen
Eintrag. Auf &auml;hnliche Weise k&ouml;nnen Sie eine bereits erteilte
Berechtigung wieder entziehen, wie in der rechten Grafik veranschaulicht ist.
Wenn Sie allen Adressen die bereits erteilten tempor&auml;ren Berechtigungen
sofort entziehen wollen, k&ouml;nnen Sie dies, indem Sie auf den Eintrag
<span><img src="noscript_disallowall.gif"
alt="NoScript: Tempor&auml;re Berechtigungen aufheben"><b>Tempor&auml;re
Berechtigungen aufheben</b></span> klicken.</p>

<p><strong>Hinweis:</strong> Sie sollten eine solche Erlaubnis nur f&uuml;r den
Namen der aktuell besuchten Webseite erteilen. Skripte von Drittanbietern
werden &uuml;blicherweise nur dazu verwendet, um Sie auszuspionieren, und sind
f&uuml;r die Funktionalit&auml;t der Webseite nur selten notwendig. </p>

<p>Sollten Sie einer Adresse grunds&auml;tzlich nicht vertrauen, k&ouml;nnen
Sie diese als <i>nicht vertrauensw&uuml;rdig</i> einstufen. Dies bewirkt, dass
JavaScript-Funktionen von dieser Adresse danach keine tempor&auml;re
Berechtigung mehr gew&auml;hrt werden kann. Um diese Einstufung
durchzuf&uuml;hren, fahren Sie mit der Maus &uuml;ber <span class="nowrap"><img
src="noscript_untrwicon.gif" alt="NoScript: nicht vertrauensw&uuml;rdig">
<b>Nicht vertrauensw&uuml;rdig</b>.</span> Sie erhalten dann die &Uuml;bersicht
der Adressen auf der gerade besuchten Webseite denen Sie das Vertrauen
entziehen k&ouml;nnen: </p>

<div style="text-align:left">
<img src="noscript_untrustw.gif"
alt="NoScript: nicht vertrauensw&uuml;rdig Men&uuml;"> </div>

<p>Die Aktion kann auf die gleiche Weise wieder r&uuml;ckg&auml;ngig gemacht
werden. </p>

<h3>Einfaches Umschalten von Proxies</h3>

<p>Wenn Sie mit einem mit einem anderem (lokalen) Proxy als JonDo oder ganz
ohne JonDo im Web surfen wollen, benutzen Sie einfach die in JonDoFox (rechts
unten) integrierte Schaltfl&auml;che <img alt="JonDo-Proxy"
src="jondofox_jondo.png" width="47"> um zwischen verschiedenen
Proxy-Konfigurationen bequem hin- und herzuschalten: </p>

<p><img alt="JonDoFox-Popup" src="jondofox_popup-de.png" width="123"></p>
<ul>
  <li><b>Kein Proxy</b>: Wenn kein Proxy eingestellt ist, verbindet sich
    JonDoFox direkte zum Internet. <strong>Achtung: Ihre IP-Adresse wird dann
    nicht verschleiert.</strong></li>
  <li><b>Benutzerdefiniert</b>: Mithilfe dieser Einstellung k&ouml;nnen Sie
    Ihre eigene Proxy-Definition aktivieren. &Uuml;ber den Men&uuml;punkt
    <em>Konfigurieren</em> k&ouml;nnen Sie eine solche individuelle
    Proxykonfiguration erstellen. Dies ist nur f&uuml;r Experten empfohlen.</li>
  <li><b>Tor</b>: Wenn Sie das Programm <a href="http://tor.eff.org">Tor</a>
    installiert und gestartet haben, k&ouml;nnen Sie es mithilfe dieser
    Einstellung als Alternative zu JonDo verwenden.</li>
  <li><b>JonDo</b>: Bei dieser Einstellung schickt JonDoFox alle Internet-Daten
    &uuml;ber JonDo. JonDo muss dazu separat <a
    href="https://www.jondos.de/de/download">installiert und gestartet</a>
  sein.</li>
</ul>

<p>Wenn Sie eine Datei am Proxy vorbei herunterladen m&ouml;chten ohne den
Proxy dabei zu deaktivieren (z.B. um bei gro&szlig;en Downloads Kosten oder
Zeit zu sparen), w&auml;hlen Sie dazu einfach mit einem rechten Mausklick auf
die Datei im Kontextmen&uuml; <em>JonDo/Tor/Proxy umgehen und Ziel speichern
unter...</em>.</p>

<h3>Video-Download</h3>

<p>Um nicht das sehr gef&auml;hrliche Flash im Browser aktivieren zu
m&uuml;ssen, sollten Sie Web-Videos immer auf Ihre Festplatte herunterladen und
von dort abspielen. Dies erspart Ihnen au&szlig;erdem den zus&auml;tzlichen
Download-Datenverkehr, wenn Sie ein Video mehrmals betrachten m&ouml;chten.
JonDoFox enth&auml;lt dazu einige Download-Tools. F&uuml;r Windows und Linux
(unter WINE) gibt es au&szlig;erdem ein hervorragendes Freeware-Programm namens
<a href="http://atube-catcher.dsnetwb.com">aTube Catcher</a>. Sie k&ouml;nnen
dieses Programm f&uuml;r JonDo konfigurieren, indem Sie in aTube Catcher unter
<strong><em>Tools-&gt;Connection settings</em></strong> den HTTP-Proxy
aktivieren und ihn auf <strong><em>Host:127.0.0.1</em></strong> und
<strong><em>Port: 4001</em></strong> setzen:</p>

<p><img alt="aTube Catcher Connection settings: HTTP proxy 127.0.0.1:4001"
src="aTubeCatcherConnection.png" width="338"></p>

<p>Als Abspielprogramm f&uuml;r alle Betriebssysteme und alle Formate eignet
sich der kostenlose <a href="http://www.videolan.org">VideoLAN Media Player</a>
besonders gut.</p>
<hr>

<p class="navipar"><span class="prevlink"><a href="firststeps.html"><img
src="prev.gif" alt="&lt;-"> JonDo &ndash; Erste Schritte</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_browser"><img src="next.gif" alt="-&gt;">
Browservorbereitung </a></span> <span class="nextlink"><a
href="browser.html">Alternative Browser <img src="next.gif"
alt="-&gt;"></a></span> </p>
</body>
</html>
