<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Netzwerk</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body lang="de">
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="update.html"><img
src="prev.gif" alt="&lt;-"> Einspielen von Updates</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a></span> <span class="nextlink"><a href="anon.html">Anonymit&auml;t <img
src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>Netzwerk</h2>

<p><em class="jconf">Um zu diesem Einstellungsfenster zu gelangen, klicken
Sie im Hauptfenster von JonDo auf <code class="jconf">Einstellungen</code>
und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Netzwerk</code>.<br>
</em> </p>

<p>In diesem Abschnitt k&ouml;nnen Sie alle Einstellungen vornehmen, die
Netzwerkverbindungen des JonDo betreffen. </p>

<h3>Umgehung von Internetzensur und -filterung</h3>

<p>Diese Funktion ist erforderlich, wenn Sie keine Verbindung zum Dienst
herstellen k&ouml;nnen, etwa weil diese in der Firmen-Firewall oder bei Ihrem
Internet Service Provider blockiert werden. <em>Bitte nehmen Sie diese
Einstellungen nur dann vor, wenn Sie sich nicht direkt mit den Diensten
verbinden k&ouml;nnen. Sie reduzieren damit Ihre Bandbreite drastisch und der
Verbindungsvorgang wird unn&ouml;tig erschwert.</em> </p>

<p><b>Mit anderen JAP/JonDo-Nutzern verbinden, um einen Dienst zu
erreichen</b> </p>

<p>Durch Aktivieren dieser Option k&ouml;nnen Sie die Verbindung zu einem
Dienst &uuml;ber einen anderen JonDo vornehmen, der als <a
href="forwarding_server.html">Forwarding-Server</a> agiert.</p>

<h3>Listener-Portnummer</h3>

<p>Damit JonDo Ihre Kommunikation mit dem Internet sch&uuml;tzen kann, muss
das Programm zwischen Browser und Internet geschaltet werden. Eine solche
Zwischenstation wird als <a href="otherServices.html#local">lokaler Proxy</a>
bezeichnet. Die folgenden Einstellungen betreffen die Proxy-Funktionen des
Programms. </p>
<ul>
  <li><p><b>Portnummer</b><br>
    Tragen Sie hier die Portnummer ein, auf der JonDo die Verbindungen von
    Ihrem Browser entgegen nehmen soll. Bitte beachten Sie, dass Sie die
    Einstellungen in Ihrem Browser entsprechend <a
    href="browser.html">anpassen</a> m&uuml;ssen falls Sie hier
    &Auml;nderungen vornehmen. <a href="jondofox.html"></a></p>
    <p><b>Hinweis</b><br>
    Die Portnummer ist beim JonDo auf 4001 voreingestellt. Wir empfehlen
    diese Einstellung beizubehalten, da Sie mit vielen weiteren
    Einstellungen, unter anderem in <a href="jondofox.html">JonDoFox</a>,
    abgestimmt ist. &Auml;ndern Sie die Portnummer nur wenn Sie genau wissen
    aus welchem Grund dies f&uuml;r Sie erforderlich ist. </p>
  </li>
  <li><p><b>Zugriff auf JAP/JonDo nur dem eigenen Rechner erlauben</b><br>
    Wenn Sie diese Option aktivieren, kann nur Ihr eigener Rechner eine
    Verbindung zu Ihrem JonDo aufbauen. </p>
    <p>Ist sie deaktiviert, k&ouml;nnen alle Rechner in Ihrem Netz oder sogar
    im Internet eine Verbindung zu Ihrem JonDo aufbauen. Dadurch k&ouml;nnten
    Unbefugte Ihren JonDo zu illegalen Zwecken mi&szlig;brauchen und ggf.
    auch Ihr bezahltes Guthaben verbrauchen. Solange Sie keinen triftigen
    Grund haben, anderen Rechnern den Zugriff zu erlauben, wird aus
    Sicherheitsgr&uuml;nden empfohlen diese Option aktiviert zu lassen.</p>
  </li>
</ul>

<h3><a name="fproxy">Zwangs-Proxy/Firewall</a></h3>

<p>In manchen Netzwerken ist eine Verbindugn zum Internet nur &uuml;ber einen
Firmen- oder Provider-Proxy m&ouml;glich. Falls dies bei Ihnen der Fall ist,
k&ouml;nnen Sie hier die Einstellungen vornehmen die n&ouml;tig sind um JonDo
auf den Proxy zugreifen zu lassen.</p>

<p><em>Tipp: Wenn Sie m&ouml;chten, k&ouml;nnen Sie auch ein lokal bei Ihnen
laufendes Tor-Programm hier als zus&auml;tzlichen Sicherheitsanker eintragen.
Die Verbindung wird dadurch allerdings langsamer.</em> </p>
<ul>
  <li><p><b>Ich muss einen "Zwangs-Proxy" verwenden</b><br>
    Aktivieren Sie diese Option, um JonDo mitzuteilen dass ein Proxy zum
    Zugriff auf das Internet eingestellt werden muss.</p>
  </li>
  <li><p><b>Typ</b><br>
    Stellen Sie den Typ Ihres Proxys ein. M&ouml;gliche Typen sind
    "Socks-Proxy" oder "HTTP/HTTPS-Proxy". <em>F&uuml;r Tor tragen Sie hier
    "SOCKS" ein.</em></p>
  </li>
  <li><p><b>Host</b><br>
    Tragen Sie hier den Hostnamen oder die IP-Adresse Ihres Proxys ein.
    <em>F&uuml;r Tor tragen Sie hier "localhost" ein.</em></p>
  </li>
  <li><p><b>Port</b><br>
    Tragen Sie hier den Port ein, auf dem Ihr Proxy Verbindungen entgegen
    nimmt. <em>F&uuml;r Tor tragen Sie hier 9050 ein.</em></p>
  </li>
  <li><p><b>F&uuml;r die Verwendung des Proxy wird eine Zugriffsberechtigung
    ben&ouml;tigt</b><br>
    Markieren Sie dieses Feld, wenn Sie sich an Ihrem Proxy anmelden
    m&uuml;ssen. </p>
  </li>
  <li><p><b>Nutzerkennung</b><br>
    Tragen Sie hier Ihren Benutzernamen f&uuml;r den Zugriff auf den Proxy
    ein. Das Passwort wird bei der ersten Verbindung zum Proxy automatisch
    abgefragt. </p>
  </li>
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="update.html"><img
src="prev.gif" alt="&lt;-"> Einspielen von Updates</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a></span> <span class="nextlink"><a href="anon.html">Anonymit&auml;t <img
src="next.gif" alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
