<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Erweiterte Diensteinstellungen</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="services_anon.html"><img
src="prev.gif" alt="&lt;-"> AN.ON/JonDonym</a></span> <span class="midlink"><a
name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Anonymit&auml;t </a><a
href="services.html"><img src="next.gif" alt="-&gt;"> Dienste</a></span> <span
class="nextlink"><a href="infoservice.html">InfoService <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>Dienste: Erweiterte Einstellungen</h2>

<p><em class="jconf">Dieses Einstellungsfenster steht Ihnen nur in der <a
href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.
Um zu diesem Einstellungsfenster zu gelangen, klicken Sie im Hauptfenster von
JonDo auf <code class="jconf">Einstellungen</code>, w&auml;hlen
anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Dienste</code> und &ouml;ffnen anschlie&szlig;end den Reiter
<code class="jconf">Erweiterte Einstellungen</code>. </em> </p>

<p>Folgende allgemeine Einstellungen, die alle Dienste betreffen, k&ouml;nnen
Sie hier vornehmen: </p>
<ul>
  <li><p><b><a name="headerfilter">Anonymisiere HTTP-Header</a></b><br>
    Wenn diese Option aktiviert ist, werden die vom Browser &uuml;bertragenen
    HTTP-Header auf Standardwerte gesetzt, die auch von <a
    href="jondofox.html">JonDoFox</a> gesetzt werden. Dadurch sind Nutzer von
    anderen Browsern weniger unterscheidbar von JonDoFox-Nutzern oder solchen,
    welche die HTTP-Filterung ebenfalls aktiviert haben. Dies kann den Schutz
    der Privatsph&auml;re verbessern, ist bei Verwendung von <a
    href="jondofox.html">JonDoFox</a> aber nicht notwendig.</p>
    <p><b>Hinweis</b><br>
    Diese Funktion steht nur f&uuml;r unverschl&uuml;sselte Verbindungen zu
    Webseiten (HTTP) zur Verf&uuml;gung. Eine entsprechende Filterung bei
    verschl&uuml;sselten Verbindungen (HTTPS) wird nur von <a
    href="jondofox.html">JonDoFox</a> vorgenommen. </p>
  </li>
  <li><p><b>Jede Webseite einzeln best&auml;tigen wenn Anonymit&auml;tsmodus
    aus</b><br>
    Ist dieses Feld markiert, fragt JonDo bei deaktiviertem
    Anonymit&auml;tsmodus f&uuml;r jede angeforderte Webseiten-Domain nach
    einer Best&auml;tigung, um zu vermeiden, dass unbemerkt Seiten ohne Schutz
    aufgerufen werden k&ouml;nnen. Wenn diese Option deaktiviert ist, kann
    JonDo sich auch im nicht-anonymen Modus direkt mit einem Webserver
    verbinden, ohne st&auml;ndig eine Best&auml;tigung vom Nutzer zu fordern.
    Eine einmalige Best&auml;tigung ist aber weiterhin erforderlich. <br>
    </p>
  </li>
  <li><p><b>Anonymit&auml;tsservice sofort nach Programmstart aktivieren</b><br>
    Ist dieses Feld markiert, so baut JonDo gleich nach dem Start eine
    Verbindung zu einem Dienst auf. </p>
  </li>
  <li><p><b>Automatisch wieder verbinden nach Verbindungsabbruch</b><br>
    Setzen Sie hier einen Haken, wenn Sie wollen, dass JonDo automatisch die
    Verbindung zum Anonymiserungsdienst wieder herstellt wenn diese
    unterbrochen wurde. </p>
  </li>
  <li><p><b>Dienste automatisch wechseln</b><br>
    Bei dieser Option wird ein zuf&auml;lliger Dienst aus den durch Ihren <a
    href="services_anon.html#filter">Dienstfilter </a>festgelegten Kaskaden
    ausgew&auml;hlt wenn der gerade aktive Dienst ausf&auml;llt oder beim
    Verbindungsaufbau nicht erreichbar ist. </p>
  </li>
  <li><p><b>auch beim Start von JAP/JonDo</b><br>
    Wird diese Option deaktiviert, verbindet sich JonDo beim Start mit
    demselben Dienst mit dem er vor dem letzten Beenden verbunden war.
    Ansonsten wird ein zuf&auml;lliger Dienst nach den von Ihnen eingestellten
    <a href="services_anon.html#filter">Filterkriterien</a> ausgew&auml;hlt.</p>
  </li>
  <li><p><b>Nur mit explizit freigeschalteten Diensten verbinden
    (Whitelist)</b><br>
    Bei Aktivierung wird JonDo nur Verbindungen zu Diensten erlauben, die Sie
    explizit &uuml;berpr&uuml;ft und freigeschaltet haben. Dadurch sind Sie
    optimal davor gesch&uuml;tzt, sich versehentlich mit
    nicht-vertrauensw&uuml;rdigen JonDonym-Diensten zu verbinden. Allerdings
    profitieren Sie nicht automatisch davon, wenn neue Dienste verf&uuml;gbar
    sind, sondern m&uuml;ssen diese jeweils einzeln in der <a
    href="services_anon.html">JonDonym-Dienst-Ansicht</a> freischalten (Haken
    vor dem Dienst setzen). </p>
  </li>
  <li><p><b>Sende KeepAlive-Daten</b><br>
    Hier k&ouml;nnen Sie festlegen, wie h&auml;ufig Pakete ohne Nutzinhalt
    verschickt werden, um die Verbindung aufrecht zu erhalten, wenn ansonsten
    keine Datenpakete von Ihnen verschickt werden. </p>
  </li>
  <li><p><b>Anmelde-Timeout</b><br>
    Sollte Ihre Internetverbindung zu langsam sein, so kann ein zu geringes
    Timeout beim Anmelden an den Dienst dazu f&uuml;hren dass JonDo keine
    anonyme Verbindung aufbauen kann. Ein zu hohes Timeout f&uuml;hrt unter
    Umst&auml;nden zu hohen Wartezeiten beim Verbinden, wenn der aktuell
    gew&auml;hlte Dienst nicht verf&uuml;gbar ist oder die Verbindung aus
    anderen Gr&uuml;nden blockiert. Stellen Sie das Timeout deshalb je nach
    Bedarf h&ouml;her oder niedriger ein. </p>
  </li>
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="services_anon.html"><img
src="prev.gif" alt="&lt;-"> AN.ON/JonDonym</a></span> <span class="midlink"><a
name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Anonymit&auml;t </a><a
href="services.html"><img src="next.gif" alt="-&gt;"> Dienste</a></span> <span
class="nextlink"><a href="infoservice.html">InfoService <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
