<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="services_anon.html">&larr; AN.ON/JonDonym</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> &rarr; Konfiguration </a><a href="anon.html"> &rarr; Anonymit&auml;t </a><a href="services.html">&rarr; Dienste</a></span>
<span class="nextlink"><a href="services_mixminion.html">Mixminion &rarr;</a></span> 
</p>
<hr>

<h2>TOR</h2>
<p>
Dieses Panel steht Ihnen in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung allerdings nur in der Entwicklerversion von JonDo. Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i>, w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Dienste</i> und &ouml;ffnen anschlie&szlig;end den Tab <i>Tor</i>.
</p>

<h3>TOR versus JonDonym</h3>

<p>
Auf dieser Seite sehen Sie Informationen und Einstellungen die sich auf den Zugang zum <a href="http://tor.eff.org"> TOR-Anonymisierungsnetzwerk</a> beziehen</a>. Da die Frage nach Vor- und Nachteilen von TOR gegen&uuml;ber JonDonym viele Nutzer von Anonymisierungsdiensten besch&auml;ftigt, geben wir Ihnen hier eine kurze vergleichende Darstellung beider Dienste.
</p>
<p>
TOR ist ein Anonymisierungsdienst, der die Technik des <b>Onion-Routings</b> umsetzt. Sie ist der <b>Mixtechnik</b>, die JonDonym zugrundeliegt, &auml;hnlich was die kryptographische Verarbeitung der Daten betrifft. Beide Techniken unterscheiden sich jedoch in der Art, wie die Daten zum Empf&auml;nger weitergeleitet werden. W&auml;hrend beim Onion-Routing die Route und damit die Sequenz der Zwischenstationen h&auml;ufig wechselt, ist diese bei der Mixtechnik stets fest. Dadurch wird beim Onion-Routing eine hohe Verteilung der Verkehrslasten auf eine Vielzahl von ONION-Routern beabsichtigt, wohingegen Mixdienste die gesamte Last wenigen Zwischenstatzionen, den sog. Mixen auferlegt, die zudem in einer festen Sequenz, der sog. Mixkaskade verschaltet sind. So besteht das TOR-Netzwerk aus einer Vielzahl von Onion-Routern, den sog. TOR-Nodes, wobei ein einzelner TOR-Node keine hohen Anforderungen bez&uuml;glich der bereitgestellten Ressourcen erf&uuml;llen muss, da die Verkehrslasten auf das gesamte Netz verteilt werden. Dadurch ergibt sich bei TOR eine Vielzahl m&ouml;glicher Routen, die die Daten der Nutzer zu Ihrem Ziel durchlaufen k&ouml;nnen. JonDonym, hingegen besitzt im Verh&auml;ltnis dazu nur wenige Mixkaskaden. &Uuml;ber diese verschickt eine Vielzahl von Nutzern Ihre Daten. Mixe ben&ouml;tigen von daher wesentlich mehr Ressourcen als TOR-Nodes und der Betrieb eines Mixes ist mit mehr Aufwand und Kosten verbunden. 
</p>
<p>
Dieser Unterschied bringt es mit sich, dass viele Nutzer folgendes feststellen: W&auml;hrend bei TOR Ihre IP-Adresse mit jeder neuen Route wechselt, da sich auch der Exit-Node &auml;ndert, bleibt diese bei JonDonym &uuml;ber einen l&auml;ngeren Zeitraum gleich, da man mit einer Kaskade meistens auch l&auml;ngere Zeit verbunden bleibt. Der Trugschlu&szlig;, den viele Nutzer daraus ziehen ist: &quot;Je h&auml;ufiger 'meine' IP-Adresse wechselt, desto h&ouml;her ist meine Sicherheit&quot - eine falsche Folgerung, denn tats&auml;chlich bewirkt das Wechseln der IP-Adresse keinen Mehrwert an Sicherheit vor Verkehrsanalysen. Entscheidend hierf&uuml;r ist lediglich, dass die sichtbare IP-Adresse nicht mehr mit der tats&auml;chlichen IP-Adresse verkettet werden kann. Die Mixtechnik gew&auml;hrleistet eine starke Unverkettbarkeit, unabh&auml;ngig davon, ob die sichtbare IP-Adresse wechselt oder nicht.   
</p>
<p>
Die Frage, welche der beiden Techniken &quot;besser&quot; ist, wird hei&szlig; diskutiert und hat bisher auch kein eindeutiges Ergebnis gebracht. Fest steht jedoch, dass Mixdienste die Nase vorn haben, wenn es um die Gesamtsicherheit bei der Organisation des Dienstes geht. TOR ist anf&auml;llig f&uuml;r <i>interne Angreifer</i>, d.h. wenn die Betreiber der TOR-Nodes selbst b&ouml;sartig oder kompromittiert sind und Angriffe durchf&uuml;hren. Dabei tragen beide Dienste diesem Angriffsszenario Rechnung, denn in beiden F&auml;llen gen&uuml;gt bereits ein vertrauensw&uuml;rdiger Mix, bzw. TOR-Node, um die Sicherheit der Nutzer zu gew&auml;hrleisten. Allerdings ist es bei einer &uuml;berschaubaren Anzahl von Mixbetreibern leichter, diese zu kontrollieren, an Vertr&auml;ge zu binden und zu sanktionieren, falls Vertragspflichten verletzt werden. Bei JonDonym ist dies auch organistorisch auf eine solche Weise geregelt. TOR hingegen bietet jedem Nutzer die Gelegenheit selbst eigene TOR-Nodes zu betreiben und das TOR-Netzwerk zu erweitern, ohne dass entsprechende Richtlinien oder gar Vertr&auml;ge erf&uuml;llt werden m&uuml;ssen. So kann ein TOR-Nutzer wesentlich schlechter als ein JonDonym-Nutzer &uuml;berschauen, ob er seine Daten, &uuml;ber vertrauensw&uuml;rdige Zwischenstationen versendet. Aus diesem Grund eignet sich TOR kaum zur kommerziellen Nutzung und kann auch wenniger Garantien als JonDonym geben, was Sicherheit und Performanz, also Geschwindigkeit und Verz&ouml;gerung bei der Daten&uuml;bertragung, betrifft.
</p>

<h3>Zugang zum Tor-Netzwerk mit JonDo</h3>
<p>
JonDo besitzt eine TOR-Unterst&uuml;tzung, die allerdings experimentell ist. Aus diesem Grund garantieren wir nicht, dass diese vollst&auml;ndig und fehlerfrei funktioniert. Wenn Sie den JonDo als Zugang zum Tor-Netzwerk nutzen wollen, m&uuml;ssen Sie ihn als Socks-Proxy (nicht als HTTP/HTTPS-Proxy) bei Ihrem Browser eintragen.
</p>

<ul>
    <li>
	<p>
	<b>Aktivieren</b><br>
    Der Zugriff auf das Tor-Netzwerk &uuml;ber JonDo ist noch experimentell. Wenn Sie diese Option deaktivieren, verringern Sie den Speicherverbrauch von JonDo und verhindern eine ungewollte Nutzung von Tor.
    </p>
    </li>
	
	<li>
	<p>
	<b>Verf&uuml;gbare Tor Knoten:</b><br>
    In diesem Feld werden Ihnen Rechner angezeigt, die eine Verbindung ins Tor-Netzwerk zur Verf&uuml;gung stellen.
    </p>
    </li>
	
	<li>
	<p>
	<b>Neu laden:</b><br>
    Mit diesem Knopf wird die Liste der verf&uuml;gbaren Knoten aktualisiert.
    </p>
	</li>
    <li>
	<p>
	<b>Einstellungen f&uuml;r die anonymen Routen:</b>
    </p>
    <ul> 
		<li>
		<p>
		<B>Minimale Knoten pro Verbindung:</B><BR>
        Hier stellen Sie ein, &uuml;ber wie viele Tor-Knoten eine Verbindung mindestens geleitet werden soll, bevor Sie an ihr eigentliches Ziel geschickt wird. Je mehr Knoten genutzt werden, desto zuverl&auml;ssiger ist die Anonymisierung der Verbindung.
        </p>
        </li>
		
		<li>
		<p>
		<b>Maximale Knoten pro Verbindung:</b><br>
        Mit diesem Schieberegler stellen Sie die maximale Anzahl von Tor-Knoten f&uuml;r eine Verbindung ein. Je gr&ouml;&szlig;er diese Zahl ist, desto langsamer ist die Verbindung.
        </p>
        </li>
		
		<li>
		<p>
		<b>Wechsel der Route alle x Verbindungen:</b><br>
        Hier legen Sie fest, wie oft eine neue Route aufgebaut werden soll. Immer, wenn so viele Verbindungen erstellt wurden, wie die hier eingestellte Zahl, dann wird die alte Route abgebaut und eine neue Route durch das Tor-Netzwerk erzeugt.
        </p>
        </li>
		
		<li>
		<p>
		<b>Anonyme Route im Voraus erstellen:</b><br>
        Wenn dieses Feld markiert ist, erstellt der JonDo gleich nach dem Start eine Route durch das Tor-Netzwerk. Ist das Feld nicht markiert, wird erst eine Route erstellt, wenn ein Verbindungswunsch vorliegt.
		</p>
		</li>
    </ul>
	</li>
</ul>

<hr>
<p class="navipar">
<span class="prevlink"><a href="services_anon.html">&larr; AN.ON/JonDonym</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> &rarr; Konfiguration </a><a href="anon.html"> &rarr; Anonymit&auml;t </a><a href="services.html">&rarr; Dienste</a></span>
<span class="nextlink"><a href="services_mixminion.html">Mixminion &rarr;</a></span> 
</p>
<!--#include virtual="/footer.html"-->
</body>
</html>