<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Fehlerbehebung</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="debugging.html"><img
src="prev.gif" alt="&lt;-"> Debugging-Einstellungen</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_problem"><img src="next.gif" alt="-&gt;"> Problembehandlung
</a></span> <span class="nextlink"><a href="updateJava.html">Java-Update
<img src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>Fehlerbehebung</h2>

<p><b>Weder <a href="index.html">diese Hilfe</a> noch der in JonDo eingebaute
Assistent (Schaltfl&auml;che im Hauptfenster) konnte mein Problem l&ouml;sen
</b> </p>

<p>In diesem Fall lesen Sie zun&auml;chst die <a
href="http://www.jondos.de/de/faq">Antworten auf die h&auml;ufigsten
Fragestellungen auf unserer Homepage (FAQ)</a> </p>

<p><b>Ich konnte die Antwort auf meine Frage nicht in den FAQ finden </b> </p>

<p>Wenn Sie die Antwort auf Ihre Frage nicht in den FAQ finden konnten, haben
Sie noch mehrere M&ouml;glichkeiten, andere danach zu fragen. Bitte stellen Sie
dabei unbedingt <strong>jede der folgenden Informationen</strong> bereit, da
Ihnen ansonsten entweder gar nicht oder nur unzureichend geholfen werden kann:
</p>
<ul>
  <li>Eine genaue Beschreibung des Fehlers und in welchen Situationen er
    auftritt. Es dauert deutlich l&auml;nger, das Problem zu l&ouml;sen, wenn
    Sie uns nur mitteilen <i>es funktioniert nicht</i>. </li>
  <li>Die JonDo-Version, die Sie verwenden (erscheint im Startbildschirm beim
    Laden und wenn Sie auf "i" im JonDo-Hauptfenster klicken). </li>
  <li>Ihre installierten Java-Version(en). </li>
</ul>

<p>In vielen F&auml;llen k&ouml;nnen auch diese Informationen hier wichtig
sein: </p>
<ul>
  <li>Name und Version Ihres Browser und Ihres Betriebssystems, am Besten auch
    mit Angabe von installierten Service Packs.</li>
  <li>L&auml;uft eine Desktop Firewall? Wenn ja, welche?</li>
  <li>L&auml;uft ein Anti-Viren-Programm? Wenn ja, welches?</li>
  <li>Eine Angabe, wie Sie mit dem Internet verbunden sind (welcher Provider,
    ob &uuml;ber ein lokales Netz, externe Firewall, Router oder
  Zwangsproxy).</li>
</ul>

<p>Folgenden Informationen sind ebenfalls hilfreich, um Ihr Problem zu
l&ouml;sen: </p>
<ul>
  <li>Ihre Transaktionsnummer, falls Sie ein Konto erzeugt haben, oder die
    Nummer Ihres pseudonymen Kontos. Ansonsten k&ouml;nnte es nicht
    m&ouml;glich sein, Probleme mit der Bezahlung zu l&ouml;sen. </li>
  <li>Die Version der japdll.dll, die Sie verwenden (erscheint, wenn Sie auf
    "i" im JonDo-Hauptfenster klicken). </li>
  <li>Das im JonDo eingestellte <a href="appearance.html">Look&amp;Feel</a>.
  </li>
  <li>Auf Anfrage: Eine Kopie der auf der Konsole ausgegebenen <a
    href="debugging.html">Fehlermeldungen</a>. Aktivieren Sie bitte alle
    aufgef&uuml;hrten Kontrollk&auml;stchen unter <em>Debugging </em>in den
    <em>Einstellungen</em> und setzen Sie alle Schieberegler ganz nach oben.
    Speichern Sie die Ausgabe dann in eine Datei. </li>
</ul>

<p>Es ist also von Vorteil, m&ouml;glichst ausf&uuml;hrliche Angaben &uuml;ber
Ihr Problem zu machen, damit wir in der Lage sind, Ihnen die bestm&ouml;gliche
Unterst&uuml;tzung zu bieten. </p>

<p>Sie k&ouml;nnen Fragen, Anregungen und Kritik an das </p>

<p style="text-align:center"><a
href="http://www.jondos.de/en/uieforum?fid=2">JonDos Nutzer-Support-Forum</a>
(<a href="http://www.jondos.de/de/search/node/">Suchfunktion</a>) </p>

<p>oder alternativ an das </p>

<p style="text-align:center"><a
href="http://sourceforge.net/forum/?group_id=13367">alte AN.ON
Nutzer-Support-Forum</a> (<a
href="http://sourceforge.net/search/?group_id=13367&amp;type_of_search=forums&amp;forum_id=42121">Suchfunktion</a>)
</p>

<p>posten, wo Ihnen meist schnell geholfen wird. Nutzen Sie aber vorher
unbedingt die <strong>Suchfunktion des Forums</strong>, bevor Sie einen neuen
Beitrag aufmachen. Die meisten Fragen wurden schon mindestens einmal
beantwortet. Sollte dies f&uuml;r Ihre Frage nicht der Fall sein, so verwenden
Sie bitte einen <strong>aussagekr&auml;ftigen Betreff</strong> f&uuml;r Ihr
Posting. Helfen Sie bitte auch anderen Nutzern (und uns), indem Sie dort nach
M&ouml;glichkeit selbst Fragen beantworten. </p>

<p>Wenn Ihr Probem sich nicht von anderen Nutzern l&ouml;sen lie&szlig;,
sollten Sie sich direkt per E-Mail an uns wenden: </p>

<p style="text-align:center"><a
href="mailto:support@jondos.de">support@jondos.de</a> </p>

<p>Bitte haben Sie Verst&auml;ndnis daf&uuml;r dass wir Sie, sollte Ihre Frage
bereits an anderer Stelle beantwortet sein, lediglich dorthin verweisen ohne
weitere Erkl&auml;rungen hinzuzuf&uuml;gen. Meist wird die Beantwortung auch
einige Zeit in Anspruch nehmen. </p>

<hr>

<p class="navipar"><span class="prevlink"><a href="debugging.html"><img
src="prev.gif" alt="&lt;-"> Debugging-Einstellungen</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_problem"><img src="next.gif" alt="-&gt;"> Problembehandlung
</a></span> <span class="nextlink"><a href="credits.html">Danksagung und Lizenz
<img src="next.gif" alt="-&gt;"></a></span> </p>

<!--#include virtual="/footer.html"-->

</body>
</html>
