<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="payment.html">&larr; Einstellungen zur Bezahlung</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> &rarr; Konfiguration </a></span>
<span class="nextlink"><a href="net.html">Netzwerk &rarr;</a></span> 
</p>
<hr>

<h2>Einspielen von Updates</h2>
<p>
<i>Dieses Panel steht Ihnen in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i>
</p>
<p>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Update</i>.
In diesem Dialog k&ouml;nnen Sie pr&uuml;fen, ob neue Versionen von JonDo zum Einspielen verf&uuml;gbar sind.
</p>

<h3>Installierte Version</h3>
<ul>
    <li>
	<p>
	<b>Version:</b><br>
    Hier sehen Sie die Versionsnummer der derzeit auf Ihrem System installierten
    Version von JonDo.
    </p>
	</li>
	
    <li>
	<p>
	<b>Datum:</b><br>
    Dieses Feld zeigt Ihnen den Zeitpunkt, wann die momentan installierte Version ver&ouml;ffentlicht wurde.
    </p>
	</li>
	
    <li>
	<p>
	<b>Art:</b><br>
    Hier wird angezeigt, um welche Art es sich bei der installierten Version handelt. Es gibt zwei verschiedene Versionsarten: Die "stabile Version" wurde ausgiebig getestet und enth&auml;lt nur Funktionen, von denen angenommen wird, dass sie keine Fehler enthalten. Die "Entwicklerversion" enth&auml;lt alle derzeit verf&uuml;gbaren Funktionen, auch wenn diese nur teilweise implementiert oder fehlerhaft sind.<br>
    F&uuml;r Normalbenutzer wird empfohlen, die "stabile Version" zu verwenden.
	</p>
	</li>
</ul>


<h3>Aktuelle Version</h3>
<p>
In dieser Gruppe sind die gleichen Felder wie in der Gruppe "Installierte Version" vorhanden. Die Informationen in den Feldern entsprechen den Informationen in der Gruppe "Installierte Version". Die hier angezeigten Informationen beziehen sich aber nicht auf die auf Ihrem System installierte Version, sondern auf die Version von JonDo, die momentan herunter geladen werden kann.<br>
Mit Hilfe der Auswahlbox "Art" k&ouml;nnen Sie festlegen, ob Sie Informationen &uuml;ber die "Stabile Version" oder &uuml;ber die "Entwicklerversion" w&uuml;nschen.
</p>

<h3>Optionen</h3>
<ul>
    <li>
	<p>
	<b>Nicht-anonymisiertes Update erlauben</b><br>
    Es wird empfohlen, diese Option zu aktivieren. Dadurch kann JonDo ein Update vornehmen, auch wenn Sie gerade nicht anonym surfen.<br>
    Wird diese Option nicht aktiviert, k&ouml;nnen Updates nur &uuml;ber eine anonymisierte Verbindung erfolgen.
    </p>
	</li>
    
	<li>
	<p>
	<b>Hinweisfenster anzeigen, wenn neue JonDo-Version verf&uuml;gbar ist</b><br>
    Liegt eine neue Version von JonDo vor und haben Sie diese Option aktiviert, erscheint ein Hinweisfenster mit der M&ouml;glichkeit, das Update vorzunehmen.
    <br>Wenn diese Option deaktiviert ist, wird im Hauptfenster von JonDo dennoch ein kleiner Hinweis angezeigt.
    Die Pr&uuml;fung auf Updates erfolgt beim Starten von JonDo und danach alle 12 Stunden.
    </p>
	</li>
    
	<li>
	<p>
	<b>Hinweisfenster anzeigen, wenn neue Version von Java (JRE) verf&uuml;gbar ist</b><br>
    JonDo pr&uuml;ft beim Start und danach alle 12 Stunden, ob eine neuere JAVA-Version verf&uuml;gbar ist. Haben Sie diese Option aktiviert, erscheint in diesem
    Fall ein Hinweisfenster. In jedem Fall erscheint zus&auml;tzlich eine Markierung im Hauptfenster. Eine Aktualisierung der JRE muss manuell erfolgen.
    <a href="updateJava.html">Mehr...</a>
	</p>
	</li>
</ul>


<h3>Info</h3>
<p>
In diesem Feld werden Ihnen Informationen &uuml;ber den Fortschritt beim Installieren eines Updates angezeigt.
Ausserdem zeigt es das Ergebnis der Pr&uuml;fung auf neuere Versionen.
</p>

<h3>Weitere Bedienelemente</h3>
<ul>
    <li>
	<p>
	<b>Pr&uuml;fe, ob neue Updates vorhanden sind:</b><br>
    Wenn Sie diesen Knopf anklicken wird gepr&uuml;ft, ob sich aus dem Internet eine neuere Version als die derzeit bei Ihnen installierte herunterladen l&auml;sst.
    </p>
	</li>
    <li>
	<p>
	<b>Upgrade:</b><br>
    Hiermit k&ouml;nnen Sie die neueste Version von JonDo aus dem Internet laden und auf Ihrem System installieren.
	</p>
	</li>
</ul>

<!--#include virtual="/footer.html"-->
<hr>
<p class="navipar">
<span class="prevlink"><a href="payment.html">&larr; Einstellungen zur Bezahlung</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> &rarr; Konfiguration </a></span>
<span class="nextlink"><a href="net.html">Netzwerk &rarr;</a></span> 
</p>

</body>
</html>