<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Ver&auml;ndern des Erscheinungsbildes</H2>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Erscheinungsbild</i>.<br>
In diesem Dialog k&ouml;nnen Sie Einstellungen vornehmen, die die grafische
Erscheinung, die Sprache und das Anzeigeverhalten nach dem Starten von JonDo
festlegen.

<P>
<H3>Erscheinungsbild</H3>
<UL>
    <LI><B>Erscheinungsbild:</B><BR>
    JonDo unterst&uuml;tzt verschiedene Formen der Darstellung von Fenstern und
Bedienelementen.
	<UL>
		<LI><B>Sprache</B><BR>
		Hier k&ouml;nnen Sie die Sprache einstellen, in welcher die Bedienelemente
		erscheinen sollen.<BR>
		Auch hier ist ein sofortiger Neustart von JonDo erforderlich um die &Auml;nderung zu &uuml;bernehmen.
		<P>	
		<LI><B>LookAndFeel</B><BR>
		W&auml;hlen Sie hier ihr bevorzugtes LookAndFeel aus der Liste aus. Die &Auml;nderungen erfordern einen sofortigen Neustart von JonDo.
		<BR>Sie k&ouml;nnen neue LookAndFeel-Optionen hinzuf&uuml;gen, indem Sie sich aus dem Internet
		neue Pakete herunterladen und in JonDo importieren. Diese sind nicht JonDo-spezifisch, Sie k&ouml;nnen alle Pakete f&uuml;r Java (Swing) verwenden.
		<BR>Solche Pakete finden Sie z.B. auf <A HREF="http://www.javootoo.com">www.javootoo.com</A>.
		Laden Sie ein solches Paket auf ihren Computer und klicken Sie auf <i>importieren</i> um die neue Option hinzuzuf&uuml;gen.
		<UL>
			<LI><B>Entfernen</B><BR>
			Damit k&ouml;nnen Sie ein LookAndFeel l&ouml;schen, wobei dies nur bei solchen funktioniert, die sie selbst herunter geladen haben. Das aktuell ausgew&auml;hlte LookAndFeel k&ouml;nnen Sie ebenfalls nicht l&ouml;schen. Das LookAndFeel bleibt dabei bis zu einem Neustart von JonDo im Speicher.
			<P>
			<LI><B>Importieren</B><BR>
			Ein Klick darauf &ouml;ffnet ein Auswahlfenster. Navigieren Sie zum Speicherort des neuen LookAndFeel Pakets und w&auml;hlen Sie die Datei mit der Endung ".jar".
			<P>
		</UL>
		<LI><B>Schriftgr&ouml;sse</B><BR>
		Hier k&ouml;nnen Sie die Schriftgr&ouml;sse der Bedienelemente einstellen.<BR>
		Diese &Auml;nderungen werden sofort aktiv.
		<P>
	</UL>
</UL>
<H3><a name="expertView"></a>Ansicht von JonDo</H3>
<UL>
    <LI><B>Erweiterte Ansicht:</B><BR>
    In der erweiterten Ansicht werden alle Optionen im Hauptfenster sowie in 
    den Konfigurationsdialogen angezeigt.
    <P>
    <LI><B>Vereinfachte Ansicht:</B><BR>
    In der vereinfachten Ansicht werden einige fortgeschrittene Optionen nicht
    angezeigt. Die Grundfunktionalit&auml;t des JonDo &auml;ndert sich dadurch nicht.
	<P>
  <LI><B>Mini-Ansicht immer im Vordergrund</B><BR>
    Schiebt die <a href="miniwindow.html">Mini-Ansicht</a> von JonDo immer vor alle anderen Fenster des Betriebssystems. Wenn die Option abgew&auml;hlt ist, wird die <a href="miniwindow.html">Mini-Ansicht </a>hinter anderen Fenstern versteckt. 
</UL>
Diese &Auml;nderungen erfordern einen sofortigen Neustart von JonDo.

<P>
<H3><a name="afterStart"></a>Programmstart</H3>
<UL>
    <LI><B>Gehe nach dem Start...:</B><BR>
    Wenn Sie diese Option aktivieren, haben Sie zwei weitere
    Auswahlm&ouml;glichkeiten:
    <P>
    <UL>
        <LI><B>...in die Minimalansicht:</B><BR>
        Diese Option minimiert das Hauptfenster des JonDo sofort nach dem Start.
        <P>
        <LI><B>...in den Systray:</B><BR>
        Wenn diese Einstellung gew&auml;hlt wurde, verschwindet das Hauptfenster
        des JonDo gleich nach dem Start im Systray von Windows.
    </UL>
</UL>
<P>
<H3>Fensterposition merken</H3>
<i>Diese Option steht nur in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i><P>
	Wenn Sie bei einem der folgenden K&auml;stchen einen Haken setzen, dann erscheint das
	entsprechende Fenster von JonDo bei jedem Start an der gleichen Stelle, an der
	es sich beim vorherigen Beenden befand.
	<UL>
		<LI>Hauptfenster
		<LI>Einstellungsfenster
		<LI>Mini-Fenster
		<LI>Hilfefenster
	</UL>
<P>
<H3>Fenstergr&ouml;&szlig;e merken</H3>
<i>Diese Option steht nur in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i><P>
<UL>
	<LI><B>Hilfefenster</B><br> Wenn Sie diesen Haken aktivieren, wird sich JonDo die Gr&ouml;&szlig;e des Hilfefensters merken.
</UL>
<P>
<H3>Programmende</H3>
<i>Diese Option steht nur in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i><P>
<UL>
    <LI><B>Warnung beim Beenden von JonDo</B><BR>
    Diese Option zeigt eine Warnung beim Beenden von JonDo um darauf aufmerksam zu machen, dass die Proxykonfiguration im Browser ge&auml;ndert werden muss, wenn man weitersurfen m&ouml;chte.
    <P>
</UL>
<P>
<!--#include virtual="/footer.html"-->
</body>
</html>