<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Fehlerbehebung</H2>

<B>Weder <a href="index.html">diese Hilfe</a> noch der in JonDo eingebaute Assistent (Schaltfl&auml;che im Hauptfenster) konnte mein Problem l&ouml;sen </B>
<P>Lesen Sie zun&auml;chst die <a href="http://www.jondos.de/de/faq">Antworten auf die h&auml;ufigsten Fragestellungen auf unserer Homepage (FAQ)</a>
<P>
<B>Ich konnte die Antwort auf meine Frage nicht in den FAQ finden </B>
<P>
Wenn Sie die Antwort auf Ihre Frage nicht in den FAQ finden konnten, haben Sie noch mehrere M&ouml;glichkeiten, andere danach zu fragen. Bitte stellen Sie dabei unbedingt <strong>jede der folgenden Informationen</strong> bereit, da Ihnen ansonsten entweder gar nicht oder nur unzureichend geholfen werden kann:
<UL>
<li>Eine genaue Beschreibung des Fehlers und in welchen Situationen er auftritt. Es dauert deutlich l&auml;nger, das Problem zu l&ouml;sen, wenn Sie uns nur mitteilen <i>es funktioniert nicht</i>.
  <li>Die JonDo-Version, die Sie verwenden (erscheint im Startbildschirm beim Laden und wenn Sie auf &quot;i&quot; im JonDo-Hauptfenster klicken).  
  <li>Ihre installierten Java-Version(en).  
 </ul>
 
 In vielen F&auml;llen k&ouml;nnen auch diese Informationen hier wichtig sein:
 
 <ul>
  <li>Name und Version Ihres Browser und Ihres Betriebssystems, am Besten auch mit Angabe von installierten Service Packs.<li>L&auml;uft eine Desktop Firewall? Wenn ja, welche? 
  <li>L&auml;uft ein Anti-Viren-Programm? Wenn ja, welches? 
  <li>Eine Angabe, wie Sie mit dem Internet verbunden sind (welcher Provider, ob &uuml;ber ein lokales Netz, externe Firewall, Router oder Zwangsproxy) .       
</UL>

If you are able to provide them, also the following information may be useful in solving your problem:
Wenn Sie die folgenden Informationen bereitstellen k&ouml;nnen. k&ouml;nnten diese ebenfalls n&uuml;tzlich sein, um Ihr Problem
zu l&ouml;sen:

<ul>
	<li>Ihre Transaktionsnummer, falls Sie ein Konto erzeugt haben, oder die Nummer
		  Ihres pseudonymen Kontos. Ansonsten k&ouml;nnte es nicht m&ouml;glich sein,
		  Probleme mit der Bezahlung zu l&ouml;sen.		  
	<li>Die Version der japdll.dll, die Sie verwenden (erscheint, wenn Sie auf &quot;i&quot; im JonDo-Hauptfenster klicken).  
	<li>Das im JonDo eingestellte <a href="appearance.html">Look&amp;Feel</a>.
  <li>Auf Anfrage: Eine Kopie der auf der Konsole ausgegebenen <A
    HREF="debugging.html">Fehlermeldungen</A>. Aktivieren Sie bitte alle aufgef&uuml;hrten Kontrollk&auml;stchen unter <em>Debugging </em>in den <em>Einstellungen</em> und setzen Sie alle Schieberegler ganz nach oben. Speichern Sie die Ausgabe dann in eine Datei.    
</ul>

Sie k&ouml;nnen Nachrichten an das 

<P align="center"> <a href="http://www.jondos.de/en/uieforum?fid=2">JonDos Nutzer-Support-Forum</a> (<a href="http://www.jondos.de/de/search/node/">Suchfunktion</a>)</P>

oder alternativ an das

<P align="center"><a href="http://sourceforge.net/forum/?group_id=13367" target="_blank">alte AN.ON Nutzer-Support-Forum</a> (<a href="http://sourceforge.net/search/?group_id=13367&type_of_search=forums&forum_id=42121" target="_blank">Suchfunktion</a>)
<P>posten, wo Ihnen meist schnell geholfen wird. Nutzen Sie aber vorher unbedingt die <strong>Suchfunktion des Forums</strong>, bevor Sie einen neuen Beitrag aufmachen. Die meisten Fragen wurden schon mindestens einmal beantwortet. Sollte dies f&uuml;r Ihre Frage nicht der Fall sein, so verwenden Sie bitte einen <strong>aussagekr&auml;ftigen Betreff</strong> f&uuml;r Ihr Posting. Helfen Sie bitte auch anderen Nutzern (und uns), indem Sie dort nach M&ouml;glichkeit selbst Fragen beantworten. 
<P> Wenn Ihr Probem sich nicht von anderen Nutzern l&ouml;sen lie&szlig;, sollten Sie sich direkt per E-Mail an uns wenden:
<P align="center"><a href="mailto:&#115;&#117;&#112;&#112;&#111;&#114;&#116;&#064;&#106;&#111;&#110;&#100;&#111;&#115;&#046;&#100;&#101;">&#115;&#117;&#112;&#112;&#111;&#114;&#116;&#064;&#106;&#111;&#110;&#100;&#111;&#115;&#046;&#100;&#101;</a>
<P>
Bitte haben Sie Verst&auml;ndnis daf&uuml;r dass wir Sie, sollte Ihre Frage bereits anderswo beantwortet sein, lediglich auf die entsprechende Stelle verweisen ohne weitere Erkl&auml;rungen hinzuzuf&uuml;gen.  Meist wird die Beantwortung auch einige Zeit
in Anspruch nehmen.
  <!--#include virtual="/footer.html"-->
</body>
</html>