<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Funktionalit&auml;t</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body lang="de">
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="otherServices.html"><img
src="prev.gif" alt="&lt;-"> VPN-Dienste und Proxies</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="firststeps.html">Erste Schritte <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>Grundlegende Funktionalit&auml;t von JonDo</h2>

<h3>JonDo - The Privacy Generator</h3>

<p>Das Programm JonDo (eine Weiterentwicklung von <a
href="http://anon.inf.tu-dresden.de">JAP</a>) erm&ouml;glicht es Ihrem
Webbrowser, Webseiten &uuml;ber eine <a
href="wwwprivacy.html#ip">IP-Adresse</a> im <a
href="jondonym.html">JonDonym</a>-System zu besuchen und Ihren Datenverkehr zu
verschl&uuml;sseln. Das bedeutet, dass weder der angefragte Server, noch ein
Lauscher auf den Verbindungen, noch die Betreiber des JonDonym-Dienstes selbst
mitbekommen, welche Webseiten Sie aufrufen. Die Verwendung von <a
href="jondonym.html#premiumservices">Premiumdiensten</a> gestattet es Ihnen
au&szlig;erdem neben dem Browser noch folgende weitere Anwendungen zu
anonymisieren:</p>
<ul>
  <li>IRC-Chat-Programme (etwa Chatzilla, ist in <a
    href="jondofox.html">JonDoFox</a> enthalten),</li>
  <li>Messenger-Programme (etwa <a
    href="http://pidgin.im/download/">Pidgin</a>, empfohlen zusammen mit dem <a
    href="http://www.jabber.org/">Jabber</a>-Protokoll und dem <a
    href="http://www.cypherpunks.ca/otr/#downloads">OTR-Plugin</a>) und</li>
  <li>prinzipiell alle Programme, die f&uuml;r einen HTTP-Proxy konfiguriert
    werden k&ouml;nnen.</li>
</ul>

<p>E-Mail-Programme und VoIP werden noch nicht unterst&uuml;tzt. Zum Versenden
anonymer E-Mails empfehlen wir, auf ein E-Mail-Programm zu verzichten und
stattdessen Web-basierte E-Mail-Dienste direkt &uuml;ber den Browser zu
benutzen.</p>

<h3>Was ist JonDo?</h3>
<ul>
  <li>JonDo ist eine Anwendung zur Verschleierung der eigenen <a
    href="wwwprivacy.html#ip">IP-Adresse</a> bei Internet-Zugriffen &uuml;ber
    bestimmte Anwendungen (z.B. &uuml;ber den Webbrowser).</li>
  <li>JonDo verschl&uuml;sselt die &uuml;ber JonDonym &uuml;bertragenen Daten
    mehrfach. Weder Ihr Zugangs-Provider noch die JonDonym-Betreiber (bis auf
    den jeweils letzten in einer <a href="jondonym.html">Kaskade</a>)
    k&ouml;nnen die Klartext-Daten sehen.</li>
  <li>JonDo ist eine <a
    href="forwarding_client.html">Anti-Zensur-Anwendung</a>, die den Zugriff
    auf ansonsten gesperrte Internetseiten erm&ouml;glicht. Nutzer k&ouml;nnen
    au&szlig;erdem ihren JonDo als <a
    href="forwarding_server.html">Weiterleitung (Forwarding-Server)</a>
    konfigurieren, um damit anderen Surfen wiederum den Zugriff auf den
    JonDonym-Dienst zu erm&ouml;glichen.</li>
  <li>JonDo ist quelloffen und kostenlos. Das Programm erlaubt den Zugriff
    sowohl auf kostenfreie als auch auf kostenpflichtige (Premium-)Dienste.</li>
  <li>JonDo filtert und anonymisiert <a
    href="wwwprivacy.html#header">HTTP-Header</a> - allerdings nur auf
    unverschl&uuml;sselten Verbindungen (nicht HTTPS). Zur Filterung von
    verschl&uuml;sselten Verbindungen sollte zus&auml;tzlich <a
    href="jondofox.html">JonDoFox</a> eingesetzt werden.</li>
  <li>JonDo ist f&uuml;r alle g&auml;ngigen Betriebssysteme verf&uuml;gbar
    (Windows, Mac OS X, Linux).</li>
  <li>JonDo wurde und wird von der <a href="http://www.jondos.de/de">JonDos
    GmbH</a> in Zusammenarbeit mit deutschen Universit&auml;ten (<a
    href="http://dud.inf.tu-dresden.de">TU Dresden</a>, <a
    href="http://www-sec.uni-regensburg.de">Universit&auml;t Regensburg</a>)
    und Datenschutzorganisationen (<a
    href="http://www.datenschutzzentrum.de">Unabh&auml;ngiges Landeszentrum
    f&uuml;r Datenschutz Schleswig-Holstein</a>) weiterentwickelt.</li>
</ul>

<h3>Was ist JonDo nicht?</h3>
<ul>
  <li>JonDo macht die <a href="wwwprivacy.html#ip">IP-Adresse</a> Ihres
    Rechners/Routers NICHT unsichtbar. Ihre IP-Adresse wird Ihnen durch Ihren
    Provider zugeteilt und ist durch Dritte unver&auml;nderlich. Sie
    ben&ouml;tigen diese IP-Adresse, damit der JonDo-Client sich mit
    JonDonym-Diensten im Internet verbinden kann. Wenn Sie JonDo einsetzen,
    surfen Sie aber &uuml;ber Rechner (Mixe) im Internet, welche jeweils eine
    eigene IP-Adresse haben. Die von Ihnen aufgerufenen Webseiten sehen deshalb
    jeweils diese ausgehende IP-Adresse und nicht Ihre eigene.</li>
  <li>JonDo wechselt NICHT regelm&auml;&szlig;ig die ausgehende IP-Adresse,
    sondern beh&auml;lt die gleiche Ausgangs-IP-Adresse, solange er mit
    derselben Mixkaskade verbunden ist. Dies k&ouml;nnen Minuten, Stunden oder
    auch Tage sein. Die Adressen von JonDonym-Mixen sind ohnehin
    &ouml;ffentlich, weshalb ein Wechsel der IP-Adresse keine zus&auml;tzliche
    Sicherheit bringen w&uuml;rde.</li>
  <li>JonDo versteckt NICHT die <a href="wwwprivacy.html#mac">MAC-Adresse</a>
    Ihres Rechners/Routers. Die MAC-Adresse ist lediglich notwendig, damit Ihr
    Provider Ihnen eine IP-Adresse zuweisen kann und ist im Internet anonsten
    ohnehin nicht sichtbar.</li>
  <li>JonDo ist KEIN Filesharing-Anonymisierungstool. Sie k&ouml;nnen manche
    Filesharing-Anwendungen &uuml;ber JonDo laufen lassen, k&ouml;nnen aber
    selbst keine Dateien anbieten.</li>
  <li>JonDo kann KEINE E-Mail-Programme anonymisieren. Dazu w&auml;re
    zus&auml;tzlich eine spezielle, zus&auml;tzliche Datenfilterung im
    E-Mail-Programm selbst notwendig.</li>
  <li>JonDo bindet sich NICHT in Ihr Betriebssystem ein, sondern muss f&uuml;r
    jede anonymisierte Anwendung separat <a
    href="browser.html">konfiguriert</a> werden.</li>
  <li>JonDo beschleunigt NICHT Ihren Internetzugriff. Bei den kostenpflichtigen
    Diensten werden Sie in der Regel jedoch keinen gro&szlig;en
    Geschwindigkeitsverlust beim Websurfen bemerken.</li>
  <li>JonDo ist NICHT JonDonym. JonDonym fasst die &uuml;ber JonDo erreichbaren
    Dienste in einem Begriff zusammen und beschreibt die Technologie.</li>
  <li>JonDo ist NICHT JonDos. JonDos ist das Unternehmen, das JonDo
    haupts&auml;chlich entwickelt.</li>
  <li>JonDo kann KEINE beliebigen "anonymen" Proxies (z.B. von Listen offener
    Proxies) nutzen, um eine anonyme Verbindung herzustellen. Dies w&auml;re
    eine <a href="otherServices.html#networkproxies">v&ouml;llig unsichere
    Methode</a> und w&uuml;rde zu keiner Anonymisierung f&uuml;hren.</li>
  <li>JonDo filtert KEINE Plugins, Skripte oder HTTPS-Webseiten. Um den Browser
    vollst&auml;ndig abzusichern benutzen Sie am Besten <a
    href="jondofox.html">JonDoFox.</a></li>
  <li>JonDo ist KEINE Ein-Klick-Anonymisierungsanwendung - so etwas kann es
    leider nicht geben. Vorsicht und Verstand bleiben f&uuml;r die
    Internetsicherheit wichtig.</li>
</ul>
<ul>
  <!--<li>FTP, Telnet, SSH,... </li>-->
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="otherServices.html"><img
src="prev.gif" alt="&lt;-"> VPN-Dienste und Proxies</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="firststeps.html">Erste Schritte <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
