<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->
<H2>Funktionalit&auml;t - In aller K&uuml;rze </H2>
<h3>Was JonDo NICHT (!!) ist</h3>
<ul>
  <li>JonDo macht die IP-Adresse Ihres Rechners (!) NICHT unsichtbar</li>
  <li>JonDo ist KEIN Filesharing-Anonymisierungstool</li>
  <li>JonDo kann KEINE E-Mails anonymisieren (au&szlig;er Web-Mailer) </li>
  <li>JonDo bindet sich NICHT transparent in Ihr Betriebssystem ein, sondern muss f&uuml;r jede anonymisierte Anwendung extra <a href="browser.html">konfiguriert</a> werden </li>
  <li>JonDo beschleunigt NICHT Ihren Internetzugriff </li>
  <li>JonDo ist NICHT JonDonym (JonDonym ist der angebotene Dienst, JonDo die Client-Anwendung zum Zugriff auf den Dienst)</li>
  <li>JonDo kann KEINE beliebigen &quot;anonymen&quot; Proxies (z.B. von Listen offener Proxies) nutzen, um eine anonyme Verbindung herzustellen. Dies funktioniert ausschlie&szlig;lich mit JonDonym-Mix-Kaskaden, die <a href="certificates.html">zertifiziert</a> sind, automatisch im JonDo gelistet werden und nicht extra eingetragen werden m&uuml;ssen.</li>
  <li>JonDo wechselt NICHT regelm&auml;&szlig;ig die IP-Adresse, sondern  beh&auml;lt die gleiche IP-Adresse, solange er mit derselben Mixkaskade verbunden ist. Dies k&ouml;nnen Minuten, Stunden oder auch Tage sein. </li>
  <li>JonDo ist keine Ein-Klick-Anonymisierungsanwendung - so etwas kann und wird es auch nicht wirklich geben! Vorsicht bei der Internetsicherheit bleibt wichtig. </li>
  <li>JonDo filtert KEINE Skripte oder Browserinformationen. Plugins wie <a href="noactive.html">Flash/Shockwave/Java</a> m&uuml;ssen im Browser deaktiviert sein, um Anonymit&auml;t &uuml;berhaupt m&ouml;glich zu machen.</li>
</ul>
<h3>Was JonDo ist</h3>
<ul>
  <li>JonDo ist eine Anwendung zur Verschleierung der eigenen IP-Adresse bei Webzugriffen &uuml;ber anonymisierte Anwendungen (<a href="supportedPrograms.html">HTTP, FTP-Downloads</a>)</li>
  <li>JonDo ist eine <a href="forwarding_client.html">Anti-Zensur-Anwendung</a>, die den Zugriff auf ansonsten gesperrte Internetseiten erm&ouml;glicht. JonDonauten k&ouml;nnen au&szlig;erdem ihren JonDo als <a href="forwarding_server.html">Weiterleitung (Forwarding-Server)</a> konfigurieren, um damit anderen Surfen wiederum den Zugriff auf den JonDonym-Dienst zu erm&ouml;glichen. </li>
  <li>JonDo ist quelloffen</li>
  <li>JonDo ist kostenlos</li>
  <li>JonDo ist f&uuml;r praktisch alle Betriebssysteme verf&uuml;gbar</li>
  <li>JonDo darf von jedermann zur privaten oder gesch&auml;ftlichen Nutzung kostenlos verwendet und ver&auml;ndert werden</li>
  <li>JonDo wurde und wird von der <a href="http://www.jondos.de/de">JonDos GmbH</a> in Zusammenarbeit mit deutschen Universit&auml;ten (<a href="http://dud.inf.tu-dresden.de">TU Dresden</a>, <a href="http://www-sec.uni-regensburg.de">Universit&auml;t Regensburg</a>) und Datenschutzorganisationen (<a href="http://www.datenschutzzentrum.de" target="_blank">Unabh&auml;ngiges Landeszentrum f&uuml;r Datenschutz Schleswig-Holstein</a>) weiterentwickelt</li>
</ul>
<h3>Was JonDonym ist </h3>
<ul>
  <li>JonDonym ist die Bezeichnung f&uuml;r den Anonymisierungsdienst, auf den JonDo zugreift </li>
  <li>JonDonym besteht aus vielen Mixkaskaden unterschiedlicher L&auml;nge (2-4 Mixe) mit jeweils unterschiedlichen und unabh&auml;ngigen Organisationen als Betreiber der einzelnen Mixe </li>
  <li>Eine von den Betreibern unabh&auml;ngige Dachorganisation (<a href="http://www.jondos.de/de">JonDos GmbH</a>) wacht &uuml;ber die Seriosit&auml;t der einzelnen Betreiberorganisationen und entwickelt die Software. </li>
  <li>JonDonym wird zum Teil kostenpflichtig betrieben, um die Weiterentwicklung der Software, den Erhalt der Dachorganisation, und die Kosten f&uuml;r den Serverbetrieb zu decken</li>
</ul>
</body>
</html>