<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Dienstfilter</H2>

<i>Das Panel zu diesen Einstellungen befindet sich in der Entwicklung und ist noch nicht direkt erreichbar. Die im Folgenden beschriebene Filterfunktionalit&auml;t wird aber bereits in JonDo genutzt. </i>
<P>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und  w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Dienstfilter</i>.
<P>JonDo bietet verschiedene Dienste (Mixkaskaden) zur Auswahl an. Die Einstellungen in diesem Panel  erm&ouml;glichen es, Dienste nach bestimmten Kriterien zu Filtern und solche, die den Kriterien nicht entsprechen, f&uuml;r die Verbindung zu sperren. JonDo wird sich mit  einem Dienst nur dann verbinden, wenn Sie  einen passenden Filter f&uuml;r diesen einstellen. Sie k&ouml;nnen den aktuellen Filter &uuml;ber das <a href="interface.html">Hauptfenster</a> oder das <a href="jap.SystrayPopupMenu.html">Kontextmen&uuml;</a> &auml;ndern, indem sie eine beliebige Kaskade in einem Filter ausw&auml;hlen. Dieser wird dann zum aktuellen Filter. 
<P>Folgende Filter sind zur Zeit verf&uuml;gbar:
<ul>
  <li><strong>Zertifizierte Mix-Kaskaden</strong>: alle verf&uuml;gbaren Mixkaskaden</li>
  <li> <strong>Kostenpflichtige Mix-Kaskaden:</strong> Kaskaden, f&uuml;r deren Benutzung bezahlt werden muss. &Uuml;blicherweise sind diese deutliche schneller, stabiler und besser erreichbar als kostenlose Kaskaden. Viele von Ihnen bestehen aus drei unabh&auml;ngigen Mixen und sind auch international aufgestellt. Sie bieten deshalb eine maximale Resistenz gegen die Betreiber des Dienstes und gegen nationale &Uuml;berwachungsbestrebungen. </li>
  <li><strong>Kostenfreie Mix-Kaskaden:</strong> Mixkaskaden, f&uuml;r die nicht bezahlt werden muss. Sie bieten eine Basisanonymit&auml;t f&uuml;r Internetsurfer, die sich den kostenpflichtigen Dienst nicht leisten k&ouml;nnen, und sollten diesen auch vorbehalten sein (China, Iran, VAE, Tunesien,...). Typischerweise ist die Surfgeschwindigkeit auf diesen Kaskaden eher niedrig. Dienste dieser Art sind oft auch von l&auml;ngeren Ausf&auml;llen betroffen, da Wartungsarbeiten von den Betreibern nur in ihrer Freizeit ausgef&uuml;hrt werden k&ouml;nnen. </li>
</ul>
<P><em>Nicht alle dieser Dienste sind  gleich sicher, oder gleich vertrauensw&uuml;rdig. Die Sicherheit eines Dienstes h&auml;ngt von vielen Faktoren ab, sehr stark aber von der Zahl und der Identit&auml;t der Betreiber und dem Standort der Mixe. Beispielsweise ist es vergleichweise einfach Nutzer zu &uuml;berwachen, die auf einer Mixkaskade surfen, die von einem einzigen Betreiber kontrolliert wird. In einer der n&auml;chsten JonDo-Versionen werden deshalb auch vordefinierte und anpassbare Filter zur Verf&uuml;gung stehen, die eine Auswahl nach dem Kriterium der Sicherheit von Diensten vereinfachen.</em>
<!--#include virtual="/footer.html"-->
</body>
</html>