<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<h2>Bezahlung</h2>
<p>
Um zu diesem Einstellungsfenster zu gelangen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Bezahlung</i>.<br>
In diesem Dialog k&ouml;nnen Sie neue Konten anlegen, Ihre bestehenden Konten verwalten und alle weietern Einstellungen vornehmen, die Sie ben&ouml;tigen, um die Premiumdienste zu nutzen.
</p>

<h3>Konten</h3>
<p>
In der Liste sehen Sie die Konten, die Sie bereits angelegt haben. Wenn Sie diesen Dialog zum ersten Mal aufrufen, ist die Liste leer, da Sie noch kein Konto angelegt haben.
</p>
<p>
Neben der Liste mit den Konten sehen sie das Erstellungsdatum, das Datum der letzten Kontostandsaktualisierung und das G&uuml;ltigkeitsdatum des markierten Kontos. Nach Ablauf des G&uuml;ltigkeitsdatums k&ouml;nnen Sie das Konto nicht mehr verwenden. Zum erneuten Einzahlen m&uuml;ssen Sie dann ein neues Konto anlegen. 
<br>
Wenn neben der Liste der Hinweis "Keine Sicherheitskopie vorhanden" angezeigt ist, haben Sie von dem gew&auml;hlten Konto noch keine Kopie erstellt. Ein Klick auf den Hiweis hat den gleichen Effekt wie ein Klick auf den Knopf <i>Sichern</i>.
</p>
<p> 
Sie k&ouml;nnen folgende Aktionen durchf&uuml;hren:
</p>
<ul>
    <li>
	<p>
	<b>Konto erzeugen</b><br>
    Hiermit legen Sie ein neues Konto an. Der Kontoerstellungsprozess kann etwas Zeit in Anspruch nehmen, da hierf&uuml;r ein aufw&auml;ndiger kryptographischer Vorgang gestartet werden muss. W&auml;hrend des Erstellungsvorgangs werden Sie m&ouml;glicherweise aufgefordert, eine Sicherheitsfrage zu beantworten. Bitte folgen Sie dazu den Anweisungen am Bildschirm. Wenn Ihr Konto erfolgreich erstellt wurde, erscheint es in der Liste der verf&uuml;gbaren Konten.
    </p>
	</li>
	          
    <li>
	<p>
	<b>Transaktionen</b><br>
	Hier k&ouml;nnen Sie sich die letzten Aufladetransaktionen Ihrer Konto ansehen.
	</p>
	</li>
  
	<li>
	<p>
	<b>Passwort &auml;ndern</b><br>
    Durch Klicken dieser Schaltfl&auml;che k&ouml;nnen Sie ein neues Passwort f&uuml;r die Verschl&uuml;sselung Ihrer Kontodaten angeben. Das Passwort gilt f&uuml;r alle Konten.<br>
	Wenn Sie ihr Passwort l&ouml;schen wollen, gehen Sie auf <i>Passwort &auml;ndern</i> und geben f&uuml;r das neue Passwort einfach nichts ein.
    </p>
	</li>
	
	<li>
	<p>
	<b>Importieren</b><br>
	Wenn Sie diese Aktion w&auml;hlen, k&ouml;nnen Sie ein zuvor exportiertes Konto wieder importieren.
	</p>
	</li>
</ul>

<h3>Informationen zum Kontostand</h3>
<p>
Hier sehen Sie, mit wie vielen Bytes Sie Ihr Konto bereits insgesamt aufgeladen haben. Au&szlig;erdem wird Ihnen der bisherige Gesamtverbrauch und der daraus resultierende aktuelle Kontostand angezeigt.
</p>
<p>
Sie k&ouml;nnen folgende Aktionen ausf&uuml;hren:
</p>
<ul>
    <li>
	<p>
	<b>Aktivieren</b><br>
Mit diesem Knopf aktivieren Sie das gew&auml;hlte Konto. Das Konto wird bei der Verbindung zu einer kostenpflichtigen Kaskade zum Bezahlen genutzt. Beim Wechsel des aktiven Kontos muss erst die Verbindung zur Kaskade getrennt werden. Das aktivierte Konto ist fett hervorgehoben.<br>
Sollten Sie ihre Konten passwortgesch&uuml;tzt haben und dieses Passwort beim Starten nicht eingegeben haben, so k&ouml;nnen sie ihre Konten durch diesen Knopf entsperren, sofern sie das richtige Passwort kennen.
	</p>
    </li>
    
	<li>
	<p>
	<b>Aktualisieren</b><br>
	Wenn Sie diese Aktion w&auml;hlen, wird der aktuelle Kontostand von der Bezahlinstanz abgefragt.
	</p>
	</li>
	        
    <li>
	<p>
	<b>L&ouml;schen</b><br>
	Hiermit l&ouml;schen Sie Ihr Konto.<br>
	</p>
	<p>
	<b>ACHTUNG:</b> Sollte sich auf Ihrem Konto noch Guthaben befinden, ist dieses <b>unwiederbringlich verloren</b>, wenn Sie keine Sicherheitskopie angelegt haben!
	</p>
  
    <li>
	<p>
	<b>Sichern</b><br>
    Dieser Knopf speichert Ihre Kontodaten in einer externen Datei. Dies ist  sinnvoll, um bei Datenverlust Ihrer Festplatte oder Neuinstallation von JonDo oder des Gesamtsystems wieder Zugriff auf Ihr Konto erhalten zu k&ouml;nnen. Sie sollten die Exportdatei also auf ein externes Medium (z.B. USB-Stick) speichern. Es wird empfohlen, ein neu angelegtes Konto zur Sicherung zu exportieren.
	</p>
	</li>
</ul>

<!--#include virtual="/footer.html"-->
</body>
</html>