<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>CookieCuller</H2>
Dieses Plugin f&uuml;r Firefox erlaubt es, aus allen gespeicherten Cookies die paar wichtigen zu markieren (sch&uuml;tzen) und den Rest zu l&ouml;schen. Das L&ouml;schen kann einmalig erfolgen oder automatisch beim Starten von Firefox. Das bedeutet, dass Cookies zwar angenommen werden (wichtig f&uuml;r die Funktionalit&auml;t), aber gel&ouml;scht werden sofern sie nicht von Ihnen als erw&uuml;nscht markiert wurden. Somit k&ouml;nnen Sie von "b&ouml;sartigen" Seiten nicht mehr wiedererkannt werden, es kann kein Profil f&uuml;r Sie erstellt werden.
<UL>
<LI><B>Installation</B><P>
<UL>Es gibt zwei M&ouml;glichkeiten, um auf die Installationsseite des Plugins zu gelangen:<P>
<LI>&Ouml;ffnen Sie <A href="https://addons.mozilla.org/firefox/82/">diesen Link</A> um direkt zur Installationsseite des Plugins zu gelangen.
<P><B>ODER</B><P>
<LI>Klicken Sie im Men&uuml; <i>Extras</i> auf <i>Erweiterungen</i>. Ein Fenster mit allen installierten Plugins &ouml;ffnet sich. Klicken Sie auf <i>Erweiterungen herunterladen</i> um auf die Pluginseite f&uuml;r Firefox zu gelangen. Suchen sie dort nach "CookieCuller".<P>
</UL>
Klicken Sie jetzt auf den Link "Install Now". Best&auml;tigen Sie die Installation und starten Sie ihren Browser neu.
<P>
<LI><B>Einrichtung</B><P>
&Ouml;ffnen Sie, wie oben beschrieben, das Fenster mit den installierten Plugins. W&auml;hlen Sie <i>CookieCuller</i> aus und klicken Sie auf <i>Einstellungen</i>.
<br>Aktivieren Sie die Checkbox <i>Delete unprotected cookies on startup</i>.
<LI><B>Ausw&auml;hlen</B><P>
Nun &ouml;ffnen Sie den CookieCuller &uuml;ber <i>Extras</i> -> <i>CookieCuller</i>. Markieren Sie alle Cookies, von denen Sie sicher wissen, dass Sie sie ben&ouml;tigen, und klicken Sie auf <i>Protect Cookie</i>. Sie k&ouml;nnen alle anderen Cookies durch Klicken auf <i>Remove all Cookies</i> l&ouml;schen. Dabei bleiben Ihre gesch&uuml;tzten Cookies erhalten.
</UL>

<!--#include virtual="/footer.html"-->

</body>
</html>
