<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: JonDonym</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body lang="de">
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="certificates.html"><img
src="prev.gif" alt="&lt;-"> Zertifikate</a></span> <span class="midlink"><a
name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="otherServices.html">VPN-Dienste und Proxies <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2><a name="premium" id="premium">Premiumdienste</a></h2>

<p>Das Programm JonDo l&auml;sst Ihnen die Wahl zwischen kostenlosen Diensten
und den kostenpflichtigen Premiumdiensten. F&uuml;r die Premiumdienste wird ein
kostenpflichtiges Abrechnungskonto ben&ouml;tigt. <b>Die daraus erzielten
Einnahmen werden zum Ausbau und Erhalt des JonDonym-Systems und zur
Weiterentwicklung der JonDo-Software eingesetzt</b>. Bei Nutzung der
Premiumdienste bietet Ihnen die Software JonDo zus&auml;tzlich zu den normalen
Eigenschaften viele Vorteile:</p>
<ul>
  <li><b>Verf&uuml;gbarkeitsgarantie</b>: Eine Verbindung zu mindestens einem
    Premium-Dienst ist zu mindestens 90% im Jahresmittel m&ouml;glich.</li>
  <li><b>Leistungsgarantie:</b> Im Rahmen der genannten Verf&uuml;gbarkeit ist
    mindestens ein Dienst mit einer Geschwindigkeit von mindestens 100 kbit/s
    und Verz&ouml;gerungen von maximal 4 Sekunden zu 90% im Tagesmittel nutzbar
    (Kostenlose Dienste, auch Tor, sind in der Regel deutlich langsamer).</li>
  <li><b>Rechtssicherheit:</b> Die Adresse der Softwarehersteller befindet sich
    in Deutschland, und nicht bei einer anonymen Offshore-Firma ohne
    ladungsf&auml;hige Anschrift. Deutschland setzt weltweit hohe Standards
    beim Verbraucherschutz.</li>
  <li><b>Drei-Betreiber-Garantie:</b> Die Mixe jeder Premium-Kaskade werden
    unabh&auml;ngig von jeweils drei verschiedenen Organisationen oder Personen
    betrieben. </li>
  <li><b>Internationalit&auml;tsgarantie:</b> Mixe und Betreiber jeder
    Premium-Mixkaskade stehen verteilt in jeweils mindestens zwei
    unterschiedlichen L&auml;ndern. Dies verhindert, dass gro&szlig;e
    Netzknoten (CIX) den gesamten Datenverkehr beobachten k&ouml;nnen. Nebenbei
    wird dadurch zuverl&auml;ssig jede nationale Vorratsdatenspeicherung
    umgangen, da niemals alle Mixe einer Kaskade mitloggen.</li>
  <li><b>Verbindungsgarantie:</b> Die Mixbetreiber blockieren in der Regel
    keine Internetports (ausgenommen E-Mail-Ports, falls dies zur Abwehr von
    Spam notwendig sein sollte).</li>
</ul>

<p>Von diesen Garantien ausgenommen sind Softwarefehler, f&uuml;r die
gem&auml;&szlig; <a href="credits.html">Lizenz</a> und <a
href="https://www.jondos.de/de/termsAndConditions">AGB</a> der
Softwareentwickler nicht gehaftet wird. Weitere m&ouml;gliche
Einschr&auml;nkungen bei den Leistungen einzelner Dienste entnehmen Sie bitte
den AGB der jeweiligen Mixbetreiber.</p>

<p>Wenn Sie die Premiumdienste nutzen m&ouml;chten, erstellen Sie in Ihrem
JonDo-Programm ein <a href="payment.html">Einmalkonto</a> und aktivieren es
mittels Bezahlung &uuml;ber eine anonyme oder nicht-anonyme <a
href="https://www.jondos.de/de/payment">Bezahlmethode Ihrer Wahl</a>. Danach
steht ihnen <a href="https://www.jondos.de/de/payment">je nach gew&auml;hltem
Tarif</a> ein bestimmtes Datenvolumen f&uuml;r die Bezahlung von
Premiumdiensten zur Verf&uuml;gung. Wenn dieses Datenvolumen verbraucht ist und
Sie die JonDonym-Dienste weiter nutzen m&ouml;chten, k&ouml;nnen Sie jederzeit
ein neues Einmalkonto erzeugen und aktivieren.</p>

<p>Hinweise zum Datenschutz: Zur Abrechnung des Datenvolumens mit den
Mixbetreibern wird jeweils kumulativ gespeichert, wie viel Volumen ein Konto
auf welcher Mixkaskade verbraucht. Zus&auml;tzlich erfolgt eine tagesgenaue
statistische Erfassung des &uuml;bertragenen Datenvolumens je Konto. Eine
Zuordnung von Konten zu Nutzeridentit&auml;ten wird nicht gespeichert.
&Uuml;ber das abgerechnete Datenvolumen ist es technisch nicht m&ouml;glich,
aufgerufene Internetseiten zu erkennen, selbst wenn eine sekundengenaue bzw.
maximal genaue Speicherung angewandt w&uuml;rde. </p>
<hr>

<p class="navipar"><span class="prevlink"><a href="certificates.html"><img
src="prev.gif" alt="&lt;-"> Zertifikate</a></span> <span class="midlink"><a
name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_intro"><img src="next.gif" alt="-&gt;">
Einf&uuml;hrung</a></span> <span class="nextlink"><a
href="otherServices.html">VPN-Dienste und Proxies <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
