<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->
<H2>Verwendung eines Filterproxys</H2>
<B>Proxomitron</B><P>
Proxomitron ist offiziell nur f&uuml;r Windows geeignet, der Entwickler gibt jedoch an, das Programm lasse sich mit <A href="http://www.winehq.com/">WINE</A> auch auf Linux ausf&uuml;hren.
<UL>
<LI><B>Installation</B><P>
Laden Sie sich Proxomitron in der Profi-Version <A href="http://www.buerschgens.de/Prox/Seiten/Download/index.html">von dieser Seite</A> herunter.
<br>Proxomitron ben&ouml;tigt keine Installation. Entpacken Sie die heruntergeladene .zip Datei in einen beliebigen (neuen) Ordner.
<LI><B>Einrichtung</B><P>
Sie k&ouml;nnen entweder eine fertige Konfigurationsdatei <A href="./proxomitron/default.cfg">aus der mitgelieferten Hilfe</A> oder hier <A href="http://www.jondos.de/de/help/proxomitron/default.cfg">online</A> benutzen und im Proxomitron-Verzeichnis speichern <b>oder</b> die folgende Anleitung durcharbeiten (wenn Sie eine bestehende Proxomitron-Konfiguration &auml;ndern wollen):
<HR><center>--------------Beginn der Anleitung--------------</center><HR>
Starten Sie Proxomitron durch einen Doppelklick auf <i>Proxomitron.exe</i>.
Das Fenster von Proxomitron &ouml;ffnet sich.
<br>
<center><img src="proxomitron1.gif"></center>
<br>
Stellen Sie sicher, dass folgende Punkte aktiviert sind:<P>
<UL>
<LI>Webseiten filtern
<LI>Ausgehende Header filtern
<LI>Eingehende Header filtern
<LI>Externen Proxy benutzen
</UL>
<P>
Um Proxomitron mit JonDo zu kaskadieren, klicken Sie auf <i>Proxy</i>. In dem neuen Fenster klicken Sie auf <i>Neu</i>.
<br>
<center><img src="proxomitron2.gif"></center>
<br>
Tragen Sie in das Feld "127.0.0.1:4001" ein.
<br><B>Hinweis:</B> Falls Sie im JonDo einen anderen <A HREF="portlistener.html">Listenerport</A> eingestellt haben m&uuml;ssen Sie diesen anstatt 4001 eintragen.
<br>Best&auml;tigen Sie mit <i>OK</i>. Klicken Sie auf die Schaltfl&auml;che <i>Test</i>. Eventuell wird eine Firewall Proximotron blockieren; erlauben Sie den Zugriff dauerhaft. Der Test kann auch bei korrekten Firewalleinstellungen fehlschlagen, das macht aber nichts. Best&auml;tigen Sie wieder mit <i>OK</i>.
<br>Durch diese Einstellung holt sich Proximotron die Daten aus dem Internet nicht direkt, sondern vom JonDo. Durch das Abhaken von <i>Externen Proxy benutzen</i> k&ouml;nnte man Proximotron auch ohne JonDo benutzen, dann ist allerdings keine Anonymit&auml;t mehr gew&auml;hrleistet, das wird also <b>nicht</b> empfohlen.
<P>
<LI><B>Filter</B><P>
Nun m&uuml;ssen die Filter noch korrekt eingestellt werden, um die Anonymit&auml;t zu unterst&uuml;tzen.

<br>Klicken Sie dazu auf <i>Headerfilter</i>.
Aktivieren Sie folgende Filter (klicken Sie in die Spalte <i>Out</i> oder <i>In</i>, je nachdem was bei dem Filter in Klammern steht):
	<UL>
		<LI>"Referer: (Out) Prox: URL-Kommandos und Pr&auml;fix entfernen [MB] v.1.1"
		<LI>"Referer: (Out) URL der aktuellen Seite [SL]"
		<LI>"User-Agent: (Out) St&auml;ndig wechseln [MB]"
	</UL>
	<P>
	Eine Beschreibung f&uuml;r alle Headerfilter finden Sie <A href="http://www.buerschgens.de/Prox/Seiten/Standard-Edition/Filter/Headerfilter.html">hier</A>.
	<P>
	<b>Hinweis:</b> Tippen Sie in das Feld <i>Suche</i> den Beginn (oder sonst einen Teil) des Filternamens, so wird Proxomitron von allen Filtern nur jene anzeigen, die auf die Suche passen.
Wer die Cookieverwaltung ebenfalls Proxomitron &uuml;berlassen m&ouml;chte, der sollte noch den Filter "Set-cookie: (In) Cookies nur von bestimmten Websites dauerhaft annehmen [SL]" aktivieren. Die Webseiten, von denen Cookies akzeptiert werden, m&uuml;ssen in ein Textfile eingetragen werden. Die Liste findet sich unter dem Proxomitron-Verzeichnis im Verzeichnis <i>Listen</i> -> <i>Ausnahmen</i> -> <i>AllowCookiesOn.txt</i>. Komfortabler ist das Vorgehen, wie es unter <a href="#Ausnahme">Ausnahmen festlegen</a> f&uuml;r Java Applets beschrieben ist.
<P>Klicken Sie nun auf <i>Seitenfilter</i>. Hier m&uuml;ssen einige Filter <b>zus&auml;tzlich</b> aktiviert werden:
	<UL>
		<LI>"JS.Manip: Durch Skripten ausgelesene Browserdaten entfernen v.1.3.1"
		<LI>"JS.Manip: Auslesen des Browsertyps durch Skripten verhindern v.2.0.3"
		<LI>"JS.Manip: Auslesen der Referrer-Information durch Skripten verhindern v.2.0.2"
		<LI>"JS: Alle Skripten deaktivieren [MB] v.1.3.3"
		<LI>"JS: JavaScript-Cookies löschen [MB]"
		<LI>"JS: Komprimiertes JavaScript deaktivieren [MB] v.1.3.2"
		<LI>"JS: Verschl&uuml;sselte Skripten deaktivieren [MB] v.2.6.7"
		<LI>"HTML: Unsichtbare iFrames entfernen [MB] v.1.3.6"
		<LI>"Java: Nur auf bestimmten Seiten Java-Applets zulassen [MB] v.1.3.3" <b>*1)</b>
		<LI>"Webbug-Filter: Daten sammelnde Skripten (Verbund) [MB] v.1.1.1"
		<LI>"Webbug-Filter: Daten sammelnde Skripten (einzeln) [MB] v.1.4.2"
		<LI>"Webbug-Filter: Daten sammelnde Skripten (Segment Typ A) [MB] v.1.2.1"
		<LI>"Webbug-Filter: Daten sammelnde Skripten (Segment Typ B) [MB] v.1.2.1"
		<LI>"Konf: Sichtbare Ersatzobjekte f&uuml;r entfernte Webbugs einf&uuml;gen [MB]"
		<LI>"Konf: Sichtbare Ersatzobjekte einf&uuml;gen: Alle (auch weniger wichtige) [MB]"
	</UL>
<P>
Eine Beschreibung f&uuml;r alle Seitenfilter finden Sie <A href="http://www.buerschgens.de/Prox/Seiten/Profi-Edition/Filter/Seitenfilter.html">hier</A>.
<b>(*1)</b> F&uuml;r diesen Filter m&uuml;ssen noch Ausnahmen deklariert werden, sonst wird Java auf allen Webseiten unterbunden. Dazu sind folgende Schritte notwendig (Tip: Kopieren Sie Bezeichnungen direkt aus dem Browser, um Schreibfehler zu vermeiden):
<OL start="1" type="1">
<LI><B>Den Filter &auml;ndern</B><BR>
&Ouml;ffnen Sie die <i>Seitenfilter</i> und w&auml;hlen Sie dort den Filter "Java: Nur auf bestimmten Seiten Java-Applets zulassen [MB] v.1.3.3" und klicken Sie auf <i>Bearb.</i>. Ersetzen Sie im Feld <i>URL Entsprechung (URL Match)</i> den bestehenden Ausdruck durch diesen: "(^$LST(AllowAppletsOn))" (ohne Anf&uuml;hrungszeichen). Best&auml;tigen Sie zweimal mit <i>OK</i>.
<br>Klicken Sie auf das Symbol <img src="proxomitron3.gif">, um die Einstellungen zu speichern.
<P>
<LI><B>Die Konfigurationsdatei anpassen</B><BR>
&Ouml;ffnen Sie die Datei <i>default.cfg</i>, welche sich im Hauptverzeichnis von Proxomitron befindet. Suchen Sie die Zeile <i>List.AllowCookiesOn&nbsp;=&nbsp;"..\Listen\Ausnahmen\AllowCookiesOn.txt"</i> und f&uuml;gen Sie darunter eine neue Zeile ein: <i>List.AllowAppletsOn&nbsp;=&nbsp;"..\Listen\Ausnahmen\AllowAppletsOn.txt"</i> . Speichern Sie die Datei.
<HR><center>--------------Ende der Anleitung--------------</center><HR>
<P>
<LI><B>Eine neue Datei erstellen (<i>Diesen Schritt m&uuml;ssen Sie auch durchf&uuml;hren, wenn Sie die fertige Konfiguration benutzen</i>)</B><BR>
Erstellen Sie im Proxomitron Verzeichnis unter <i>Listen</i> -> <i>Ausnahmen</i> eine neue, leere Textdatei namens <i>AllowAppletsOn.txt</i>.
</OL>

Wenn Proxomitron ein Java Applet deaktiviert, wird er anstelle des Applets eine Meldung anzeigen.
<P>
<LI><b>Browser einrichten</b><P>
Starten Sie Proxomitron neu. Leeren Sie anschlie&szlig;end den Cache ihres Browsers, damit die Inhalte auch wirklich neu und gefiltert durch Proxomitron abgerufen werden.
<br>Nun muss Proxomitron als Proxy eingerichtet werden. Das Vorgehen ist das selbe wie <A href="browser.html">hier</A> beschrieben (w&auml;hlen Sie ihren Browser), nur verwenden Sie diesmal den Port von Proxomitron, das ist standardm&auml;ssig 8080. Benutzer von Firefox mit <i>SwitchProxy Toolbar</i> Plugin sollten diese Einstellungen direkt im Plugin vornehmen.
<P>
<a name="Ausnahme"><b>Ausnahmen festlegen</b></a><br>
<b>Hinweis:</b> Dieses Vorgehen beschreibt das Festlegen von Ausnahmen am Beispiel Java (Liste: <i>Allow-Java</i>). Ebenso k&ouml;nnen Sie Ausnahmen f&uuml;r JavaScript(<i>Allow-JS</i>), Cookies(<i>CookieList</i>), Flash(<i>Allow-Flash</i>), JonDo(<i>NoExternalProxyOn</i>) usw. festlegen. Um die Seite KOMPLETT ungefiltert zu erhalten, setzen Sie sie auf die Liste <i>Trusted</i>.
Wollen Sie f&uuml;r eine vertrauensw&uuml;rdige Seite Java zulassen, kopieren Sie die Adresse der Seite (allerdings <b>ohne</b> das Protokoll: alles nach "http://") aus dem Adressfeld Ihres Browsers in die Zwischenablage. Klicken Sie mit der rechten Maustaste auf das Icon von Proxomitron in der System Tray und bewegen Sie den Mauszeiger &uuml;ber den Eintrag <i>Zur Blockliste hinzuf&uuml;gen</i> und klicken Sie auf <i>AllowAppletsOn</i>.
<BR>Beachten Sie, dass die Seite bereits automatisch in das Feld eingetragen wurde, und zwar <b>ohne</b> das Protokoll ("http://").
<P>Ein Beispiel: Wollten Sie f&uuml;r "http://anon.inf.tu-dresden.de/" Java zulassen, sollten Sie folgendes einf&uuml;gen:
<br>
<br>
<center><img src="proxomitron5.gif"></center>
<br>
Best&auml;tigen Sie mit <i>OK</i>.
<br><b>Achtung:</b>Dadurch wird Java f&uuml;r alle Seiten zugelassen, deren Adresse mit "anon.inf.tu-dresden.de/" beginnt, d.h. f&uuml;r s&auml;mtliche Seiten dieser Domain. W&uuml;rden Sie das Protokoll mit eintragen, w&uuml;rde die eben erstellte Ausnahme nicht funktionieren.
<P>
<LI><b>URL-Kommandos abschalten</b><br>
Klicken Sie auf <i>Konfiguration</i> und vergewissern Sie sich, dass im Tab <i>Access</i> der Punkt <i>Sperre URL-basierende Proxomitron-Kommandos</i> aktiviert ist. Lesen Sie die Hilfe &uuml;ber URL Kommandos um zu erfahren, warum diese ein Sicherheitsrisiko darstellen. Die (englische) Hilfe zu Proxomitron bekommt man &uuml;ber das Men&uuml; <i>Hilfe</i> -> <i>Hilfe und Update</i>, in der auftauchenden Webseite auf <i>Englische Dokumentation (lokal)</i> klicken. Kurz: URL-Kommandos k&ouml;nnten verwendet werden, um Proxomitron auszuhebeln.
<P>
<LI><b>Optional: SSL Unterst&uuml;tzung</b><P>
<b>Vorsicht:</b> Von der Verwendung dieser Bibliotheken wird abgeraten. Da Proxomitron selbst nicht entscheiden kann, ob Zertifikate g&uuml;ltig sind oder nicht, wird er jede SSL-Verbindung entschl&uuml;sseln und anschlie&szlig;end mit seinem Zertifikat versehen, bevor er die Daten an den Browser weiterschickt. Somit sieht der Benutzer nur das Zertifikat von Proxomitron (dem er nat&uuml;rlich vertraut) und kann somit v&ouml;llig ung&uuml;ltige Zertifikate nicht erkennen.
<br>Standardm&auml;ssig kann Proxomitron keine SSL-verschl&uuml;sselten &Uuml;bertragungen bearbeiten. Um diese Eigenschaft zu aktivieren, m&uuml;ssen Sie zus&auml;tzliche Bibliotheken herunterladen.
	<UL>
	<LI><b>Download</b><P>
	Laden Sie die <i>OpenSSL_DLLs.zip</i> von <A href="http://www.proxomitron.info/files/index.html">dieser Seite</A> herunter und entpacken Sie die drei Bibliotheken (libeay32.dll, msvcr70.dll, ssleay32.dll) in das Verzeichnis von Proxomitron.
	<LI><b>Aktivieren</b><P>
	Klicken Sie auf <i>Konfiguration</i> im Hauptfenster von Proxomitron. W&auml;hlen Sie den Tab <i>HTTP</i> und aktivieren Sie <i>Filterung SSL-verschl&uuml;sselter Seiten aktivieren</i>. &Uuml;bernehmen Sie die &Auml;nderungen mit <i>OK</i> und speichern Sie die Konfiguration durch einen Klick auf <img src="proxomitron3.gif">.
	</UL>
</UL>

Klicken Sie <A href="security_test.html">hier</A> um zu erfahren, wie Sie die Einstellungen auf ihren Anonymit&auml;tsgrad &uuml;berpr&uuml;fen k&ouml;nnen.
<!--#include virtual="/footer.html"-->

</body>
</html>