<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Fehlerbehebung</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="debugging.html"><img
src="prev.gif" alt="&lt;-"> Debugging-Einstellungen</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_problem"><img src="next.gif" alt="-&gt;">
Problembehandlung </a></span> <span class="nextlink"><a
href="updateJava.html">Java-Update <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>Fehlerbehebung</h2>

<p><b>Weder <a href="index.html">diese Hilfe</a> noch der in JonDo eingebaute
Assistent (Schaltfl&auml;che im Hauptfenster) konnte Ihr Problem
l&ouml;sen?</b> </p>

<p>In diesem Fall lesen Sie zun&auml;chst die <a
href="http://www.jondos.de/de/faq">Antworten auf die h&auml;ufigsten
Fragestellungen auf unserer Homepage (FAQ)</a> </p>

<p><b>Sie konnten die Antwort auf Ihre Frage auch nicht in den FAQ
finden?</b></p>

<p>Sie haben mehrere M&ouml;glichkeiten, andere nach Ihrem Problem zu fragen.
Bitte stellen Sie dabei unbedingt <strong>m&ouml;glichst viele der folgenden
Informationen</strong> bereit, da Ihnen ansonsten entweder gar nicht oder nur
unzureichend geholfen werden kann: </p>
<ul>
  <li>Eine genaue Beschreibung des Fehlers und in welchen Situationen er
    auftritt. Es dauert deutlich l&auml;nger, das Problem zu l&ouml;sen, wenn
    Sie nur etwas mitteilen wie <i>es funktioniert nicht</i>. </li>
  <li>Die JonDo-Version, die Sie verwenden (erscheint im Startbildschirm beim
    Laden und wenn Sie auf "i" im JonDo-Hauptfenster klicken, in der oberen
    Zeile des neu ge&ouml;ffneten Fensters). </li>
  <li>Ihre installierten Java-Version(en). </li>
  <li>Name und Version Ihres Browsers und Ihres Betriebssystems, am Besten
    auch mit Angabe von installierten Service Packs.</li>
</ul>

<p>In vielen F&auml;llen k&ouml;nnen auch diese Informationen hier wichtig
sein: </p>
<ul>
  <li>L&auml;uft eine Desktop Firewall? Wenn ja, welche?</li>
  <li>L&auml;uft ein Anti-Viren-Programm? Wenn ja, welches?</li>
  <li>Eine Angabe, wie Sie mit dem Internet verbunden sind (welcher Provider,
    ob &uuml;ber ein lokales Netz, externe Firewall, Router oder
  Zwangsproxy).</li>
</ul>

<p>Folgenden Informationen sind ebenfalls hilfreich, um Ihr Problem zu
l&ouml;sen: </p>
<ul>
  <li>Ihre Transaktionsnummer, falls Sie ein Konto erzeugt haben, oder die
    Nummer Ihres pseudonymen Kontos. </li>
  <li>Die Version der japdll.dll, die Sie verwenden (erscheint, wenn Sie auf
    "i" im JonDo-Hauptfenster klicken). </li>
  <li>Das im JonDo eingestellte <a href="appearance.html">Look&amp;Feel</a>.
  </li>
  <li>Auf Anfrage: Eine Kopie der auf der Konsole ausgegebenen <a
    href="debugging.html">Fehlermeldungen</a>. Aktivieren Sie bitte alle
    aufgef&uuml;hrten Kontrollk&auml;stchen unter <em>Debugging </em>in den
    <em>Einstellungen</em> und setzen Sie alle Schieberegler ganz nach oben.
    Speichern Sie die Ausgabe dann in eine Datei. Entfernen Sie vor der
    &Uuml;bermittlung gegebenenfalls pers&ouml;nliche Informationen wie Ihren
    Benutzernamen.</li>
</ul>

<p>Es ist also von Vorteil, m&ouml;glichst ausf&uuml;hrliche Angaben
&uuml;ber Ihr Problem zu machen, damit jemand in der Lage ist, Ihnen die
bestm&ouml;gliche Unterst&uuml;tzung zu bieten. </p>

<p>Sie k&ouml;nnen Fragen, Anregungen und Kritik an das </p>

<p style="text-align:center"><a
href="http://www.jondos.de/en/uieforum?fid=2">JonDos Nutzer-Support-Forum</a>
(<a href="http://www.jondos.de/de/search/node/">Suchfunktion</a>) </p>

<p>oder alternativ an das </p>

<p style="text-align:center"><a
href="http://sourceforge.net/forum/?group_id=13367">alte AN.ON
Nutzer-Support-Forum</a> (<a
href="http://sourceforge.net/search/?group_id=13367&amp;type_of_search=forums&amp;forum_id=42121">Suchfunktion</a>)
</p>

<p>posten, wo Ihnen meist schnell geholfen wird. Nutzen Sie aber vorher
unbedingt die <strong>Suchfunktion des Forums</strong>, bevor Sie einen neuen
Beitrag aufmachen. Die meisten Fragen wurden schon mindestens einmal
beantwortet. Sollte dies f&uuml;r Ihre Frage nicht der Fall sein, so
verwenden Sie bitte einen <strong>aussagekr&auml;ftigen Betreff</strong>
f&uuml;r Ihr Posting, und nicht etwas wie <em>"Probleme!"</em>,
<em>"Funktioniert nicht!"</em> oder &auml;hnliches. Helfen Sie bitte auch
anderen Nutzern (und uns), indem Sie dort nach M&ouml;glichkeit selbst Fragen
beantworten. </p>

<p>Wenn Ihr Probem sich nicht von anderen Nutzern l&ouml;sen l&auml;sst,
sollten Sie sich direkt per E-Mail an uns wenden: </p>

<p style="text-align:center"><a
href="mailto:support@jondos.de">support@jondos.de</a> </p>

<p>Meist wird die Beantwortung per E-Mail jedoch einige Zeit in Anspruch
nehmen.</p>
<hr>

<p class="navipar"><span class="prevlink"><a href="debugging.html"><img
src="prev.gif" alt="&lt;-"> Debugging-Einstellungen</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_problem"><img src="next.gif" alt="-&gt;">
Problembehandlung </a></span> <span class="nextlink"><a
href="credits.html">Danksagung und Lizenz <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
