<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Erscheinungsbild</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="JAP_commandline.html"><img
src="prev.gif" alt="&lt;-"> Kommandozeilenargumente</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a></span> <span class="nextlink"><a href="payment.html">Einstellungen zur
Bezahlung <img src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>Ver&auml;ndern des Erscheinungsbildes</h2>

<p><em class="jconf">Um zu diesem Einstellungsfenster zu gelangen, klicken
Sie im Hauptfenster von JonDo auf <code class="jconf">Einstellungen</code>
und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Erscheinungsbild</code>. </em> </p>

<p>In diesem Dialog k&ouml;nnen Sie Einstellungen vornehmen, welche die
grafische Erscheinung, die Sprache und das Anzeigeverhalten nach dem Starten
von JonDo festlegen. </p>

<h3>Erscheinungsbild</h3>

<p>JonDo unterst&uuml;tzt verschiedene Formen der Darstellung von Fenstern
und Bedienelementen. </p>
<ul>
  <li><p><b>Sprache</b><br>
    Hier k&ouml;nnen Sie die Sprache f&uuml;r die Bedienelemente, Men&uuml;s
    und Dialoge einstellen. Die &Auml;nderungen werden nach dem n&auml;chsten
    Start des Programms aktiv. Wenn Sie &Auml;nderungen an der
    Spracheinstellung vornehmen, werden Sie gefragt, ob Sie das Programm neu
    starten m&ouml;chten. </p>
  </li>
  <li><p><b>Look&amp;Feel</b><br>
    Das <i>Look&amp;Feel</i> bestimmt die grafische Gesamterscheinung des
    Programms. Darunter z&auml;hlt das Aussehen von Buttons, Fenstern,
    Textfeldern und sonstigen graphischen Elementen. Das Look&amp;Feel ist
    dabei jeweils abh&auml;ngig von dem Betriebssystem, das Sie verwenden.
    Mit dieser Liste haben Sie die M&ouml;glichkeit ein Look&amp;Feel Ihrer
    Wahl f&uuml;r JonDo zu verwenden. Dar&uuml;berhinaus k&ouml;nnen Sie neue
    Look&amp;Feel-Optionen hinzuf&uuml;gen, indem Sie sich aus dem Internet
    neue Pakete herunterladen und in Ihren JonDo importieren. Diese sind
    nicht JonDo-spezifisch, d.h. Sie k&ouml;nnen theoretisch alle Pakete
    f&uuml;r verwenden, die von Java-Swing unterst&uuml;tzt werden. <em>Bitte
    beachten Sie, dass manche Bedienelemente von JonDo mit einigen
    Look&amp;Feels eventuell nicht kompatibel sind. Sie k&ouml;nnen diese
    Einstellung aber jederzeit zur&uuml;cksetzen um diese Bedienelemente
    wieder korrekt anzuzeigen.</em></p>
    <ul>
      <li><p><b>Importieren</b><br>
        Neue Look&amp;Feel-Pakete, die Sie zu Ihrem JonDo hinzuf&uuml;gen
        k&ouml;nnen, finden Sie z.B. auf <a
        href="http://www.javootoo.com">www.javootoo.com</a>. Laden Sie
        einfach die Pakete Ihrer Wahl auf Ihren Computer und klicken Sie auf
        <i>Importieren</i>. Daraufhin &ouml;ffnet ein Auswahlfenster.
        Navigieren Sie zum Speicherort des neuen LookAndFeel Pakets und
        w&auml;hlen Sie die Datei mit der <span class="nowrap">Endung
        <i>.jar</i></span>. Ein Dialog leifert Ihnen eine R&uuml;ckmeldung,
        ob das Paket importiert werden konnte. War der Vorgang erfolgreich,
        erscheint das neue Look&amp;Feel in der Auswahlliste. </p>
      </li>
      <li><p><b>Entfernen</b><br>
        Damit k&ouml;nnen Sie ein Look&amp;Feel-Paket l&ouml;schen, das Sie
        selbst hinzugef&uuml;gt haben.</p>
      </li>
    </ul>
  </li>
  <li><p><b>Schriftgr&ouml;&szlig;e</b><br>
    Hier k&ouml;nnen Sie die Schriftgr&ouml;sse f&uuml;r die Bedienelemente
    einstellen.<br>
    </p>
  </li>
</ul>

<h3><a name="expertView"></a>Ansicht von JAP/JonDo</h3>
<ul>
  <li><p><b>Erweiterte Ansicht</b><br>
    In der erweiterten Ansicht werden alle verf&uuml;gbaren Optionen
    angezeigt. </p>
  </li>
  <li><p><b>Vereinfachte Ansicht</b><br>
    In der vereinfachten Ansicht werden einige fortgeschrittene Optionen, die
    f&uuml;r unerfahrene Nutzer verwirrend sein k&ouml;nnten, nicht
    angezeigt. Die Grundfunktionalit&auml;t des Programms &auml;ndert sich
    dadurch nicht. </p>
  </li>
  <li><p><b>Mini-Ansicht immer im Vordergrund</b><br>
    Schiebt das <a href="miniwindow.html">Mini-Fenster</a> von JonDo immer
    vor alle anderen Fenster des Betriebssystems auch wenn diese aktiv sind.
    Wenn die Option abgew&auml;hlt ist, wird das <a
    href="miniwindow.html">Mini-Fenster</a> hinter anderen Fenstern
    versteckt. </p>
  </li>
  <li><p><b>DLL-Update-Hinweise ignorieren</b><br>
    Wenn diese Option aktiviert ist, wird kein Hinweis mehr angezeigt, dass
    eine aktuellere DLL-Version als die von Ihnen verwendete verf&uuml;gbar
    ist.<br>
    Die DLL ist eine Bibliothek die Windows-Nutzern Funktionen zur optischen
    Verbesserung und komfortableren Bedienung des Programms zur
    Verf&uuml;gung stellt. </p>
  </li>
</ul>

<h3><a name="afterStart"></a>Programmstart</h3>
<ul>
  <li><p><b>Gehe nach dem Start...</b><br>
    Wenn Sie diese Option aktivieren, haben Sie zwei weitere
    Auswahlm&ouml;glichkeiten: </p>
    <ul>
      <li><p><b>...in die Minimalansicht</b><br>
        Diese Option zeigt nach dem Start des Programms sofort das
        Mini-Fenster an.</p>
      </li>
      <li><p><b>...in den Systray</b><br>
        Wenn diese Einstellung gew&auml;hlt wurde, verschwindet das
        Hauptfenster des JonDo gleich nach dem Start im Systray des
        Betriebssystems. <em>Diese Funktion ist nicht unter allen
        Betriebssystemen verf&uuml;gbar und ben&ouml;tigt eine
        betriebssystemspezifische Programmbibliothek/DLL.</em> </p>
      </li>
    </ul>
  </li>
  <li><p><b>Splash-Screen anzeigen</b><br>
    Falls Sie nicht m&ouml;chten, dass unmittelbar nach dem Start und beim
    Beenden des Programms der Splash-Screen erscheint, k&ouml;nnen Sie diese
    Option deaktivieren. Sofern Sie diese Option aktivieren wird der
    Splash-Screen wieder erscheinen. </p>
  </li>
  <li><p><b>Beim Verbinden Browser starten (nur JonDo-Portable)</b><br>
    Sollten Sie das JonDo-Portable-Paket mit der Kommandozeilenoption
    <code>--portable &lt;Pfad zum Browser&gt; </code> gestartet haben und der
    angegebene Browser wurde gefunden, wird der Browser automatisch gestartet
    wenn diese Option aktiviert ist. Allerdings erfolgt der Browserstart erst
    dann, wenn nach dem Start des JonDos eine Verbindung mit einem
    Anonymisierungsdienst zustande gekommen ist. Falls Sie nicht
    w&uuml;nschen, dass ein automatischer Browserstart erfolgt, deaktivieren
    Sie diese Option. </p>
  </li>
</ul>

<h3>Pfad zur Hilfe</h3>

<p>Um die Hilfsfunktion von JonDo optimal nutzen zu k&ouml;nnen, wird Ihr
Standardbrowser verwendet um die Hilfe anzuzeigen. Dazu werden die
Hilfe-Dateien auf Ihrer Festplatte oder einem anderen Datentr&auml;ger
abgelegt. Diese Einstellung erm&ouml;glicht es Ihnen den Pfad anzugeben in
dem die Hilfe-Dateien gespeichert werden sollen. </p>

<p>Wenn Sie auf die Schaltfl&auml;che <code class="jconf">Verschieben</code>
klicken, &ouml;ffnet sich ein Dialog, der Ihnen erm&ouml;glicht einen Pfad
zur Hilfe-Datei-Installation auszuw&auml;hlen. <em>Hinweis: Bei
JonDo-Portable und unter manchen Betriebssystemen wird der Hilfepfad fest
eingestellt und es ist nicht m&ouml;glich ihn hier zu &auml;ndern.</em></p>

<h3>Fensterposition merken</h3>

<p><em class="jconf">Diese Einstellung steht Ihnen nur in der <a
href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.
</em> </p>

<p>Wenn Sie bei einem der folgenden K&auml;stchen einen Haken setzen, dann
erscheint das entsprechende Fenster von JonDo bei jedem Start an der gleichen
Stelle, an der es sich beim vorherigen Beenden befand. Sie haben die
M&ouml;glichkeit, folgende Fenster wieder an der gleichen Position beim
n&auml;chsten Programmstart erscheinen zu lassen: </p>
<ul>
  <li>Hauptfenster</li>
  <li>Einstellungsfenster</li>
  <li>Mini-Fenster</li>
</ul>

<h3>Fenstergr&ouml;&szlig;e merken</h3>

<p><em class="jconf">Diese Einstellung steht Ihnen nur in der <a
href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.
</em> </p>
<ul>
  <li><p><b>Einstellungsfenster</b><br>
    Wenn Sie diese Option aktivieren, wird JonDo das Einstellungsfenster in
    der gleichen Gr&ouml;&szlig;e wie beim letzten Aufruf anzeigen. </p>
  </li>
</ul>

<h3>Programmende</h3>

<p><em class="jconf">Diese Einstellung steht Ihnen nur in der <a
href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.
</em> </p>
<ul>
  <li><p><b>Warnung beim Beenden von JAP/JonDo</b><br>
    Ist diese Option aktiviert, wird eine Warnung beim Beenden der Programms
    angezeigt, in der Sie daran erinnert werden, dass die Proxykonfiguration
    im Browser ge&auml;ndert werden muss, wenn Sie ohne JonDo weitersurfen
    m&ouml;chten. Deaktivieren Sie diese Option wenn Sie m&ouml;chten dass
    diese Warnung nicht mehr angzeigt wird. </p>
  </li>
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="JAP_commandline.html"><img
src="prev.gif" alt="&lt;-"> Kommandozeilenargumente</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a></span> <span class="nextlink"><a href="payment.html">Einstellungen zur
Bezahlung <img src="next.gif" alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
