<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->
<H2>Einf&uuml;hrung zum JonDo</H2>

<h3><B>Der JonDo Anonymit&auml;ts-Proxy </B>
</h3>
<P>
Mit JonDo (Weiterentwicklung von <a href="http://anon.inf.tu-dresden.de" target="_blank">JAP</a>) ist es m&ouml;glich, 
Webseiten unbeobachtbar aufzurufen. Das bedeutet, da&szlig; weder der angefragte Server noch ein
Lauscher auf den Verbindungen mitbekommt, welcher Benutzer welche Webseite
aufgerufen hat - kurz <em>Anonymit&auml;t</em>.
<P>
JonDo muss auf dem Rechner des Internetnutzers installiert werden, damit
dieser unbeobachtbar und anonym im Internet surfen kann. Dies ist deshalb
erforderlich, da zur Anonymisierung alle Anfragen nicht direkt an den
Webserver, sondern &uuml;ber eine sogenannte <em>Mix-Kaskade</em> geschickt werden. Dies sind zwischengeschaltete Stationen,
&uuml;ber die alle Nachrichten geleitet werden.

<P>
Da viele Benutzer gleichzeitig den Anonymisierungsdienst nutzen, werden
die Internetverbindungen jedes Benutzers unter denen aller anderen Benutzer
versteckt: Jeder Benutzer k&ouml;nnte der Urheber einer Verbindung gewesen
sein. Niemand, kein Au&szlig;enstehender, kein anderer Benutzer, nicht
einmal der Betreiber des Anonymit&auml;tsdienstes kann herausbekommen,
welche Verbindungen ein bestimmter Benutzer aufgebaut hat.
<P>JonDo verschleiert Ihre <a href="http://www.whatismyip.com" target="_blank">IP-Adresse</a> gegen&uuml;ber Webseiten, und ersetzt diese  durch eine andere, feste IP des JonDonym-Systems. Allerdings gen&uuml;gt das alleine nicht, um die Anonymit&auml;t des Websurfers sicherzustellen. Auf vielen Webseiten finden sich sogenannte <em>aktive Inhalte</em>, die zum Aufdecken der IP-Adresse f&uuml;hren k&ouml;nnen, und die Webbrowser senden Daten, die zur Profilierung dienen k&ouml;nnen. Momentan werden solche Inhalte von JonDo noch nicht blockiert, dies kann aber durch <a href="noactive.html">Zusatzanwendungen</a> geschehen.
<h3>Anonymit&auml;t - warum?</h3>
<P> Der Zugang zum Internet ist normalerweise nur &uuml;ber die Einwahl (z.B. &uuml;ber ein Modem, DSL oder UMTS) zu einem sogenannten <em>Internet Service Provider</em> (ISP) m&ouml;glich. Manche dieser ISPs gehen extrem sorglos mit den Daten ihrer Nutzer um, wie das Beispiel AOL zeigt: Der amerikanische Provider <a href="http://www.spiegel.de/netzwelt/technologie/0,1518,430676,00.html" target="_blank">ver&ouml;ffentlichte</a> kostenlos und f&uuml;r jedermann einsehbar insgesamt 20 Millionen Suchanfragen von 650 000 AOL-Nutzern zu Forschungszwecken. Diese eigentlich gut gemeinte Aktion zeigt zum Einen, wie gering das Wissen &uuml;ber Datenschutzprobleme bei Verantwortungstr&auml;gern dieser Art ausgepr&auml;gt ist, zum Anderen, wie leicht solche sensiblen Informationen in falsche H&auml;nde geraten k&ouml;nnen. Durch Verfolgung der Suchmaschineneintr&auml;ge und deren R&uuml;ckf&uuml;hrung auf Einzelpersonen  kann leicht ein Pers&ouml;nlichkeitsprofil erstellt werden. Sogar die Namen der Suchenden oder Namen ihrer Bekannten waren teilweise im Klartext aus den genannten Suchanfragen auslesbar. Nat&uuml;rlich speichern nicht nur Provider solche Suchanfragen, sondern auch <a href="http://www.daten-speicherung.de/index.php/klage-gegen-suchmaschinen-staubsauger/" target="_blank">die Suchmaschinenbetreiber selbst</a>. Leider l&auml;sst sich deren Weitergabe (etwa Verkauf an Dritte) und deren Schutz (etwa vor dem Diebstahl durch Hacker) nicht durch die Internetnutzer selbst kontrollieren oder &uuml;berpr&uuml;fen. Dies gilt prinzipiell f&uuml;r alle Daten die beim Surfen anfallen, also f&uuml;r Verkehrsdaten und die Kommunikationsinhalte.
<P>Da die Verwendung von einmal gesammelten Daten kaum kontrolliert werden kann und das eigene Surfprofil deshalb unter Umst&auml;nden an Kriminelle oder Konkurrenten ger&auml;t, muss bereits dessen Erhebung verhindert oder zumindest soweit wie m&ouml;glich erschwert werden. Unternehmen sollten deshalb grunds&auml;tzlich auf den Schutz ihrer Verbindungsdaten und -inhalte bedacht sein, da diese der Konkurrenz wertvolle Anhaltspunkte zu eigenen Vorhaben geben k&ouml;nnten (geplante Patentierungen, Fusionen, Suche nach speziellen Mitarbeitern, Austausch von Gesch&auml;ftsgeheimnissen usw.). Privatpersonen, die im Internet sehr pers&ouml;nliche Informationen abrufen, etwa zu gesundheitlichen, psychischen, sozialen oder finanziellen Themen, sind ebenfalls gut beraten, wenn sie ihr Surfverhalten nicht f&uuml;r jedermann offen legen. Unter Umst&auml;nden flie&szlig;en die beobachteten Daten in Scoringmodelle von Unternehmen ein, die f&uuml;r die Kreditvergabe und f&uuml;r eine individuelle Preisgestaltung der Angebote benutzt werden: wer einen schlechten &bdquo;Score-Wert&ldquo; hat, muss unter Umst&auml;nden teuer (in &euro;) daf&uuml;r bezahlen. In Zukunft werden sich vielleicht auch Arbeitgeber vor der Einstellung neuer Mitarbeiter von Internetagenturen ein aus den Spuren im Netz erstelltes Pers&ouml;nlichkeitsprofil der Bewerber aush&auml;ndigen lassen.  Grunds&auml;tzlich sollten aber alle B&uuml;rger ein Interesse daran haben, sich den Blicken neugieriger Internetbeobachter zu entziehen: Wer sich beobachtet f&uuml;hlt, redet und handelt meist anders als in v&ouml;lliger Anonymit&auml;t. Gerade kritische Stimmen w&uuml;rden ohne Anonymit&auml;t aus (bewusster oder unbewusster) Angst vor Repressalien m&ouml;glicherweise zum Schweigen gebracht. Dazu tr&auml;gt auch die immer st&auml;rkere &Uuml;berwachung des Internets durch den Staat bei, begr&uuml;ndet durch die &quot;Argumente&quot; der <a href="http://www.heise.de/tp/r4/artikel/23/23625/1.html" target="_blank">Terrorismusbek&auml;mpfung</a> und der Eind&auml;mmung von <a href="http://www.nethics.net/nethics/de/themen/kinderporn/nebenfolgen.html" target="_blank">Kinderpornographie</a>.
<h3>Anonymit&auml;t kostet</h3>
<P>Starke Anonymit&auml;t gibt es nicht umsonst - der Basisdienst wird zwar ohne Bezahlung angeboten, als Nutzer muss man aber immer bereit sein, Abstriche bei der Geschwindigkeit  hinzunehmen. Eine DSL 10000 - Anonymisierung kann es nicht geben. Dazu m&uuml;ssten Server mit hunderten GBit/s Bandbreite angeboten werden, um auch wirklich mehrere tausend Nutzer aufnehmen zu k&ouml;nnen. Dies w&auml;re f&uuml;r die Betreiber aber nicht finanzierbar und unrealistisch, denn hunderte von Nutzern m&uuml;sste jeweils mehrere hundert Euro im Monat f&uuml;r diese Dienstleistung zahlen, nur damit die Kosten f&uuml;r die Server gedeckt w&uuml;rden.
<P>Wir haben uns f&uuml;r einen Kompromiss zwischen Geschwindigkeit und Kosten f&uuml;r die Nutzer entschieden: von unseren kommerziell gef&uuml;hrten Servern werden Bandbreiten von 64 bis 128 kbit/s (ISDN-Geschwindigkeit) angeboten, die zu einem ungest&ouml;rten Weberlebnis ausreichen. F&uuml;r die Bereitstellung dieser Servicequalit&auml;t wird eine kleine Geb&uuml;hr erhoben, die f&uuml;r die meisten Menschen erschwinglich ist. Es gibt au&szlig;erdem einen (deutlich langsameren) Basisdienst, der ohne Bezahlung genutzt werden kann. 
<P>F&uuml;r diejenigen, die JonDonym unterst&uuml;tzen wollen, sei es mit der kostenlosen oder kostenpflichtigen Bereitstellung von Servern als neuer Betreiber, &Uuml;bersetzungen, Programmierleistungen oder Spenden, gibt es nat&uuml;rlich nach wie vor die <a href="http://anon.inf.tu-dresden.de/kosten.html">M&ouml;glichkeit zur Partizipation</a>. 
<h3>
<B>Der JonDonym-Dienst</B>
</h3>
<P>
Der JonDonym-Dienst, mit dem sich JonDo verbindet um einen anonymen Webzugriff herzustellen, besteht aus mehreren einzeln w&auml;hlbaren Mixkaskaden, wobei deren einzelne Mixe im Regelfall von jeweils voneinander unabh&auml;ngigen Organisationen betrieben werden. Diese Institutionen haben
in einer <a href="http://anon.inf.tu-dresden.de/operators/help/operatorCommitment.html">Selbstverpflichtung</a> erkl&auml;rt, dass sie weder
Log-Files &uuml;ber die transportierten Verbindungen speichern, noch mit
den anderen Mix-Betreibern Daten austauschen, die dazu f&uuml;hren
k&ouml;nnten, dass ein Benutzer von JonDo enttarnt wird.
Die Mixbetreiber sind au&szlig;erdem <a href="certificates.html">zertifiziert</a>, so dass deren Identit&auml;t immer &uuml;berpr&uuml;fbar ist. 
<P>
Da jedoch keiner der zwischengeschalteten Stationen vollst&auml;ndig vertraut
werden soll, werden alle gesendeten Daten mehrfach verschl&uuml;sselt (1
mal pro Station). Die Verschl&uuml;sselung der Anfragen und die Entschl&uuml;sselung der
Antworten erfolgt im JonDo. Der Nutzer muss nur noch seinen Browser so
<A HREF="browser.html">konfigurieren</A>, dass alle WWW-Anfragen
&uuml;ber den JonDo gesendet werden.

<P>
Die Anonymisierung der Nutzer erfolgt dadurch, dass jede Anfrage
mehrfach verschl&uuml;sselt &uuml;ber eine Folge von Zwischenstationen, die
auf dem Mix-Konzept von David Chaum basieren, gesendet werden. Da sich in
der endg&uuml;ltigen Version alle Nutzer gleich verhalten (gleich viele
Daten pro Zeiteinheit &uuml;ber die gleiche Folge von Mixen senden), sind
unter der Annahme, dass mindestens ein Mix nicht mit einem globalen
Angreifer zusammenarbeitet, die Aktionen des einzelnen Teilnehmers nicht
mehr erkennbar.

<P>
Unser Ziel ist es, einen Dienst zur Verf&uuml;gung zu stellen, welcher
diesen Anforderungen wirklich gen&uuml;gt.

<P>
<B>Achtung!</B> Die momentan vorliegende Version erreicht diese Sicherheit
noch nicht vollst&auml;ndig, da sich die Software noch in der Entwicklung
befindet! Diese Version garantiert jedoch bereits eine wesentlich
h&ouml;here Sicherheit  als beispielsweise Systeme, die einfache
<a href="proxy_overview.html">Proxies</a> verwenden.
Uns ist au&szlig;erdem <em>kein</em>  kommerzielles System bekannt, das auch nur ann&auml;hernd die Sicherheit von JonDonym erreichen w&uuml;rde. Einzig das nicht-kommerzielle System <a href="http://tor.eff.org">Tor</a> bietet eine vergleichbare Sicherheit, und ist &auml;hnlich gut dokumentiert und untersucht. 
<P>
Die vorliegende Version sch&uuml;tzt die Anonymit&auml;t des Nutzers
zumindest gegen einen lokalen Angreifer (z.B. den Provider, den Webserver,
den Chef). Zus&auml;tzlich sch&uuml;tzt sie auch gegen die Betreiber
eines Mixes. Je nachdem, welchen Mix ein Betreiber zur Verf&uuml;gung stellt, kann er nur erfahren, welcher Teilnehmer (IP-Nummer) den Dienst nutzt <B>oder</B>
welche Anfragen in das Netz gesendet werden, nicht jedoch von
welcher IP-Nummer eine Anfrage stammt.

<P>
Gegen einen Angreifer, der alle Leitungen des Internets &uuml;berwacht bzw.
den ersten <B>und</B> den letzten Mix kontrolliert, sch&uuml;tzt die
gegenw&auml;rtige Version noch nicht.

<P>
Folgende weitere Gr&uuml;nde haben wir, das System bereits jetzt anzubieten:

<UL>
    <LI>Wir m&uuml;ssen Erfahrungen mit einen laufenden System sammeln, um noch
    enthaltene Fehler und die Probleme in der Praxis kennenzulernen und
    &uuml;berwinden zu k&ouml;nnen.
    <LI>Um einen sicheren Dienst anbieten zu k&ouml;nnen, ben&ouml;tigt man von
    Anfang an eine gro&szlig;e und stabile Anonymit&auml;tsgruppe. Diese Gruppe
    hoffen wir bereits jetzt zu gewinnen und w&auml;hrend der Weiterentwicklung
    zu halten.
</UL>

<P>
Um diese Ziele zu erreichen, ben&ouml;tigen wir Ihre Hilfe. Wir w&auml;ren
Ihnen dankbar, wenn Sie den Anonymisierungsdienst dauerhaft nutzen
w&uuml;rden und uns Ihre Probleme, Meinungen und
Verbesserungsvorschl&auml;ge mitteilen w&uuml;rden.

<P>
Weitere Informationen finden Sie auf unserer Projektwebseite <BR>
<a href="http://www.anon-online.de">http://www.anon-online.de</a>.

<!--#include virtual="/footer.html"-->
</body>
</html>