<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Konfiguration von anderen Browser</H2>
<p>
F&uuml;r eine optimale Nutzung von <b>JonDonym</b> empfehlen wir den portablen <a href="jondofox.html"> JonDoFox </a>. Wenn Sie <b>JonDoFox</b> nutzen ent&auml;llt f&uuml;r Sie der Konfigurationsaufwand, da <b>JonDoFox</b> bereits alle notwendigen Einstellungen enth&auml;lt, die notwendig sind, um beim Surfen mit JonDonym ein H&ouml;chstma&szlig; an Anymit&auml;t zu erhalten. Weitere Information zu <b>JonDoFox</b> finden sie <a href="jondofox.html"> hier </a> oder auf der <a href="https://www.jondos.de/de/jondofox"> JonDoFox-Homepage</a>.
Wenn Sie JonDonym mit einem anderen Browser nutzen wollen, ist es erforderlich, dass Sie spezielle Einstellungen selber vornehmen.<br>
</p> 
<p>
<b>Bitte beachten Sie:</b><br>
Bei falscher Konfiguration hinterlassen Browser beim Surfen eine Vielzahl digitaler Spuren, auch wenn Sie JonDonym verwenden. Diese Konfiguration selber vorzunehmen ist &auml;u&szlig;erst aufwendig und verlangt ein tieferes Verst&auml;ndnis von Web-Technologien. Dar&uuml;berhinaus ist es bei einigen Browsern, wie z.B. Internet Explorer, Opera und Safari, auch nicht m&ouml;glich die &Uuml;bertragung solcher Spuren vollst&auml;ndig zu vermeiden.
</p>

<h3>Proxy-Einstellungen</h3>

Durch die Proxy-Einstellungen konfigurieren Sie Ihren Browser so, dass er die Anfregaen f&uuml;r Webseiten nicht direkt &uuml;ber das Internet versendet, sondern and den JonDo, der die Daten anonym verschickt. 

<p>
<b>Bitte beachten Sie:</b><br>
Wenn diese Einstellungen im Browser gar nicht oder nur unvollst&auml;ndig vergenommen werden, ist Ihre Anonymit&auml;t nicht gew&auml;hrleistet, auch wenn Sie den JonDo korrekt verwenden.
</p>

W&auml;hlen Sie hier ihren Browser aus, um eine kurze Anleitung f&uuml;r die Proxy-Konfiguration Ihres Browsers zu erhalten:
<ul>
	<li><a href="browser_ie.html">Internet Explorer</a></li>
	<li><a href="browser_firefox.html">Mozilla Firefox</a></li>
	<li><a href="browser_seamonkey.html">SeaMonkey</a></li>
	<li><a href="browser_opera.html">Opera</a></li>
	<li><a href="browser_konqueror.html">Konqueror</a></li>
	<li><a href="browser_safari.html">Safari</a></li>
	<li><a href="browser_unknown.html">weitere Browser</a></li>
</ul>

<h3>Vermeiden von Datenspuren</h3>

<p>Webseiten k&ouml;nnen spezielle (aktive) Inhalte anbieten, die Ihre Identit&auml;t aufdecken (oder sogar ihren Rechner sch&auml;digen), obwohl sie scheinbar mit JonDo anonym surfen. Das kann z.B. &uuml;ber JavaScript, Java, Flash und Active Scripting  geschehen. Gef&auml;hrlich sind grunds&auml;tzlich alle Arten von dynamischen Webinhalten, die auf dem Rechner des Websurfers ausgef&uuml;hrt werden. Teilweise bieten Browser selbst komfortable M&ouml;glichkeiten, die Verwendung von solchen Inhalten zu unterbinden, teilweise kommen daf&uuml;r eher Zusatzprogramme in Frage.
</p>
<p>Weiterhin verschickt der Webbrowser selbst einige Inhalte die dazu benutzt werden k&ouml;nnen, Sie zu identifizieren, oder zumindest um ein genaues Profil von dem zu erstellen, was Sie im Netz machen - die HTTP-Header. Diese beinhalten etwa den Browsertyp, Ihre Sprache, den Referrer (von welcher Seite Sie kamen), <a href="wwwprivacy.html#cookies">Cookies und Webbugs</a>.
</p>
<p>Der Nachteil beim Verbieten dieser Inhalte ist, dass einige Webanwendungen nicht mehr genutzt werden k&ouml;nnen, etwa chatrooms, Flash-Men&uuml;s und -Animationen, Online-Spiele und allgemein alle Web 2.0-Anwendungen. Sie m&uuml;ssen sich deshalb entscheiden: m&ouml;chten SIe Ihr kurzzeitiges Vergn&uuml;gen maximieren, oder sich sicher im Netz bewegen?
</p>
<p>
Im Folgenden finden Sie einige Beschreibungen und HowTos zur Installation und Konfiguration Ihres Browsers und von Zusatzsoftware zur Aktivierung der f&uuml;r Sie richtigen Datenschutzeinstellungen.
</p>	
<uL>
	<li><a href="noactive_firefox.html">Mozilla Firefox</a></li>
	<li><a href="noactive_seamonkey.html">SeaMonkey</a></li>
	<li><a href="noactive_opera.html">Opera</a></li>
	<li><a href="noactive_konqueror.html">Konqueror</a></li>
	<li><a href="noactive_safari.html">Safari</a></li>
</ul>

<p>
<b>Hinweis</b>:<br>
Die M&ouml;glichkeiten zum Anpassen der HTTP-Header sind bei den meisten Browsern nur stark eingeschr&auml;nkt m&ouml;glich. Aus diesem Grund empfehlen wir die Benutzung von <b>JonDoFox</b>, da hier die kritischen HTTP-Header bereits f&uuml;r maximale Anonymit&auml;t angepasst sind. Auf die erweiterten Konfigurationsm&ouml;glichkeiten f&uuml;r andere Browser als den JonDoFox werden wir aus diesem Grund hier nicht weiter eingehen. Ebensowenig wird in dieser Dokumentation auf die Verwendung von Filterproxies wie <a href="http://www.proxomitron.info/">Proxomitron</a> oder <a href="http://muffin.doit.org/">Muffin</a> behandelt, da mit JonDoFox eine eitaus bessere Kntrolle zur Vermeidung von Datenspuren m&ouml;glich ist. Informationen zu deren Konfiguration und Verwendung finden sich auf den entsprechenden Projekt-Homepages. 
</p>
<!--#include virtual="/footer.html"-->

</body>
</html>