<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Zertifikatsstellen</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="forwarding_server.html"><img
src="prev.gif" alt="&lt;-"> Anti-Zensur</a></span> <span class="midlink"><a
name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Dienste </a></span>
<span class="nextlink"><a href="japconf.html">Konfigurationsdatei <img
src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>Zertifizierungsstellen</h2>

<p><em class="jconf">Dieses Einstellungsfenster steht Ihnen nur in der <a
href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.
Um zu diesem Einstellungsfenster zu gelangen, klicken Sie im Hauptfenster von
JonDo auf <code class="jconf">Einstellungen</code> und w&auml;hlen
anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Zertifizierungsstellen</code>. </em> </p>

<p>Um die Authentizit&auml;t und Integrit&auml;t digitaler Daten zu sichern,
werden unf&auml;lschbare digitale Signaturen mithilfe von geheimen
Signierschl&uuml;sseln erstellt. Die G&uuml;ltigkeit solcher Signaturen kann
mit einem &ouml;ffentlich zug&auml;nglichen Pr&uuml;fschl&uuml;ssel
sichergestellt werden, der genau zu diesem geheimen Signierschl&uuml;ssel
passt, wie ein Schlo&szlig; zum entsprechenden Schl&uuml;ssel. Allerdings wird
ein rechtsg&uuml;ltiger Nachweis ben&ouml;tigt, dass ein
Pr&uuml;fschl&uuml;ssel auch zu einer bestimmten Person oder Organisation
geh&ouml;rt. </p>

<p>Zu diesem Zweck werden <b>Zertifikate</b> verwendet. Dies sind
Datens&auml;tze, die die Identit&auml;t einer Person oder Organistation sowie
deren Pr&uuml;fschl&uuml;ssel enthalten. Um eine Rechtsg&uuml;ltigkeit dieser
Zuordnung von Schl&uuml;ssel und Identit&auml;t zu erhalten, wird das
Zertifikat wiederum von einer autorisierten Zertifizierungsstelle
(Certification Authority) signiert, deren Signatur allgemein
&uuml;berpr&uuml;ft werden kann. <br>
<img src="next.gif" alt="-&gt;"> <a href="certificates.html">Weitere
Informationen zu Zertifikatsstellen und Zertifikaten...</a> </p>

<p>F&uuml;r die Nutzung von JonDonym spielen Zertifikate eine sehr
entscheidende Rolle: So beweisen Mixe ihre Authentizit&auml;t gegen&uuml;ber
JonDo mithilfe von Signaturen. Ihr JonDo besitzt bereits alle notwendigen
Zertifikate, um sicherzustellen, dass er sich nur mit Diensten von
zertifizierten Anbietern verbindet. In diesem Einstellungsfenster haben Sie
jedoch die M&ouml;glichkeit eigene Zertifkate hinzuzuf&uuml;gen und zu
verwalten, falls Sie sich mit Kaskaden verbinden wollen, f&uuml;r die JonDo
noch keine Zertifikate besitzt. </p>

<p><b>VORSICHT</b><br>
Das Hinzuf&uuml;gen von neuen Zertifikaten ist ein sehr sensibler und
sicherheitskritischer Bereich. &Uuml;bernehmen Sie Zertifikate von nicht
vertrauensw&uuml;rdigen Zertifizierungsstellen besteht die Gefahr, dass Sie
sich zu unseri&ouml;sen Diensten verbinden k&ouml;nnen und Ihnen somit Schaden
entsteht. F&uuml;gen Sie also neue Zertifikate nur dann hinzu, wenn Sie sich
absolut sicher sind, was Sie tun. Normalerweise ist dies nicht notwendig.</p>

<h3>Zertifikatsstellen</h3>
<ul>
  <li><p><b>Ich will nur von folgenden Stellen zertifizierte Server
    verwenden</b><br>
    Diese Liste enth&auml;lt alle Zertifizierungsstellen, denen Sie vertrauen.
    Wird ein Server nicht von einer Stelle, die in dieser Liste enthalten ist,
    zertifiziert, so wird JonDo keine Verbindung zu diesem Server aufbauen.
    <strong>Wenn Sie diese Option deaktivieren werden keine
    Zertifikatspr&uuml;fungen mehr durchgef&uuml;hrt. Dritte k&ouml;nnen Ihrem
    JonDo dann vermeintlich sichere Dienste und falsche Identit&auml;ten von
    Betreibern vorgaukeln.</strong></p>
  </li>
  <li><p><b>Importieren</b><br>
    Mit dieser Schaltfl&auml;che f&uuml;gen Sie Zertifizierungsstellen hinzu.
    Im erscheinenden Dateidialog muss das entsprechende Zertifikat
    ausgew&auml;hlt werden. </p>
  </li>
  <li><p><b>Entfernen</b><br>
    Hiermit l&ouml;schen Sie den markierten Eintrag aus der Liste. </p>
  </li>
  <li><p><b>Deaktivieren</b><br>
    Durch Klicken dieser Schaltfl&auml;che vermerken Sie f&uuml;r den
    markierten Eintrag vor&uuml;bergehend den Status <code class="jconf">nicht
    vertrauensw&uuml;rdig</code>. Zertifikate, die von dieser
    Zertifizierungsstelle ausgestellt wurden, werden von Ihrem JonDo dann nicht
    mehr anerkannt. <strong>Unter Umst&auml;nden k&ouml;nnen Sie sich nicht
    mehr zu einem Dienst verbinden, wenn Sie Zertifikate von
    Zertifizierungsstellen deaktivieren.</strong></p>
  </li>
  <li><p><b>Detailinformationen...</b><br>
    Durch Anklicken dieser Schaltfl&auml;che k&ouml;nnen Sie das Zertifikat des
    gew&auml;hlten Eintrages im Detail ansehen. </p>
  </li>
</ul>

<h3>Informationen &uuml;ber Zertifizierungsstelle</h3>

<p>Hier sehen Sie entsprechende Informationen zur momentan markierten
Zertifikatsstelle. </p>
<hr>

<p class="navipar"><span class="prevlink"><a href="forwarding_server.html"><img
src="prev.gif" alt="&lt;-"> Anti-Zensur</a></span> <span class="midlink"><a
name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Dienste </a></span>
<span class="nextlink"><a href="japconf.html">Konfigurationsdatei <img
src="next.gif" alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
