<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Zertifikatsstellen</H2>
<i>Dieses Panel steht nur in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i><P>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Zertifikatsstellen</i>.
<P>Ein Zertifikat ist ein von einer Zertifizierungsinstanz (z.B. dem JonDo-Team) digital unterschriebener (digitaler) Beh&auml;lter f&uuml;r einen &ouml;ffentlichen Verschl&uuml;sselungsschl&uuml;ssel, der gegen&uuml;ber Dritten (z.B. den Nutzern) durch die Signatur best&auml;tigt, dass dieser Schl&uuml;ssel einer ganz bestimmten Person oder Organisation geh&ouml;rt. G&auml;be es diese Best&auml;tigung f&uuml;r die Zertifikate  nicht, so k&ouml;nnte sich z.B. jeder als JonDo-Team oder als vertrauensw&uuml;rdiger Mixbetreiber ausgeben und etwa Honeypot-Mixe betreiben, oder sich ganz einfach in die Kommunikation zwischen Nutzern und tats&auml;chlich vertrauensw&uuml;rdigen Mixen/Betreibern einschalten und s&auml;mtliche Daten mitlesen. Auch das Einspielen falscher Update-Nachrichten w&auml;re leicht m&ouml;glich. (<a href="certificates.html">Weitere Informationen zu Zertifikaten...</a>)
<UL>
    <LI><B>Ich will nur von folgenden Stellen zertifizierte Server verwenden:</B><BR>
    Diese Liste enth&auml;lt alle Zertifizierungsstellen, denen Sie vertrauen. Wird ein Server nicht von einer Stelle, die in dieser Liste enthalten ist, zertifiziert, so wird JonDo keine Verbindung mit diesem Server aufbauen.
    <P>
    <LI><B>Importieren:</B><BR>
    Mit dieser Schaltfl&auml;che f&uuml;gen Sie Zertifizierungsstellen hinzu. Im erscheinenden Dateidialog muss das entsprechende Zertifikat ausgew&auml;hlt werden.
    <P>
    <LI><B>Entfernen:</B><BR>
    Hiermit l&ouml;schen Sie den markierten Eintrag aus der Liste.
    <P>
    <LI><B>Deaktivieren:</B><BR>
    Durch Klicken dieses Knopfes schalten Sie den markierten Eintrag vor&uuml;bergehend in den Status "nicht vertrauensw&uuml;rdig".
    <P>
    <LI><B>Details...</B><BR>
    Durch Klicken dieses Knopfes k&ouml;nnen Sie das Zertifikat des gew&auml;hlten Eintrages ansehen.
    <P>
</UL>
    <H3>Informationen &uuml;ber Zertifikatsstelle:</H3>
    Hier sehen Sie Informationen zur momentan markierten Zertifikatsstelle.

<!--#include virtual="/footer.html"-->
</body>
</html>