<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>InfoService</H2>
<i>Dieses Panel steht nur in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i><P>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>InfoService</i>.<br>
Der InfoService wird verwendet, um den JonDo mit notwendigen Informationen
&uuml;ber den Anonymisierungsdienst zu versorgen. Dazu z&auml;hlen z.Z.:

<UL>
	<LI> Die aktuelle Versionsnummer des JonDo, um eine automatische
	Aktualisierung zu erm&ouml;glichen.
	<LI> Die Adresse des ersten Mixes.
	<LI> Informationen &uuml;ber die verf&uuml;gbaren Anonymisierungsdienste z.B. die &ouml;ffentlichen
	Versch&uuml;sselungsschl&uuml;ssel der beteiligten Server.
	<LI> Informationen &uuml;ber die Auslastung des Dienstes und die dadurch
	erreichte Anonymit&auml;t.
</UL>

Bitte beachten Sie, dass die korrekten Informationen zum InfoService bereits voreingestellt sind. Eine &Auml;nderung f&uuml;hrt m&ouml;glicherweise dazu, dass der JonDo den Anonymisierungsdienst nicht mehr erreichen kann.

<P>

<H3>Einstellungen</H3>
Auf dieser Seite sehen Sie die InfoServices, die Ihrem JonDo bekannt sind. Der derzeit bevorzugte InfoService erscheint fett gedruckt. Sie k&ouml;nnen folgende Aktionen durchf&uuml;hren:
<UL>
    <LI><B>Neu laden:</B><BR>
    Hier laden Sie eine neue Liste von InfoServices aus dem Internet herunter.
    <P>
    <LI><B>Als Standard:</B><BR>
    Durch Klicken dieser Schaltfl&auml;che wir der markierte InfoService als bevorzugter InfoService ausgew&auml;hlt.
    <P>
    <LI><B>Zertifikat:</B><BR>
    Durch Klicken wird das Zertifikat dieses InfoServices angezeigt.
    <P>
    <LI><B>Hinzuf&uuml;gen...:</B><BR>
    Wenn Sie diese Aktion w&auml;hlen, erscheinen im unteren Teil des Fenster weitere Elemente, mit denen Sie einen InfoService manuell eintragen k&ouml;nnen:
    <P>
    <UL>
        <LI><B>InfoService Host:</B><BR>
        Tragen Sie hier den Hostnamen oder die IP-Adresse des InfoServices ein, den Sie hinzuf&uuml;gen wollen.
        <P>
        <LI><B>InfoService Port:</B><BR>
        Hier m&uuml;ssen Sie den Port des neuen InfoServices eintragen.
        <P>
        <LI><B>InfoService Name:</B><BR>
        Wenn Sie wollen, k&ouml;nnen Sie hier einen Namen f&uuml;r den neuen InfoService vergeben. Der neue InfoService erscheint dann unter diesem Namen in der Liste der bekannten InfoServices. Wenn Sie dieses Feld frei lassen, erscheint der InfoService als Kombination zwischen Hostname und Port.
        <P>
        <LI><B>OK:</B><BR>
        Klicken Sie diesen Knopf, um Ihre Eintragungen zu best&auml;tigen und den neuen InfoService einzutragen.
        <P>
        <LI><B>Abbrechen:</B><BR>
        Hiermit verwerfen Sie alle Eingaben und kehren zum vorigen Fenster zur&uuml;ck.
    </UL>
    <P>
    Dieser Teil des Fensters erscheint auch, wenn Sie einen bereits manuell angelegten InfoService aus der Liste w&auml;hlen. Sie haben dann die M&ouml;glichkeit, die Daten des InfoServices zu &auml;ndern oder den InfoService zu l&ouml;schen.
    <P>
    <LI><B>L&ouml;schen:</B><BR>
    Klicken Sie hier, um den ausgew&auml;hlten InfoService aus der Liste zu entfernen.
    <P>
</UL>
<!--#include virtual="/footer.html"-->
</body>
</html>