<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Anonym-O-Meter</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
  <style type="text/css">
<!--
td {
vertical-align: top;
}
-->

  </style>
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="interface.html"><img
src="prev.gif" alt="&lt;-"> JonDo-Oberfl&auml;che</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_bedienung"><img src="next.gif" alt="-&gt;"> Bedienung
</a></span> <span class="nextlink"><a href="miniwindow.html">Minifenster <img
src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>Das Anonym-O-Meter</h2>

<p>Das Anonym-O-Meter gibt Ihnen bildliche Meldungen &uuml;ber den Status und
die Sicherheit des von Ihnen gew&auml;hlten Dienstes. Detailinformationen mit
konkreteren Daten erhalten Sie unter <a href="services.html">Details</a>.</p>

<p>Aus den Informationen des Anonym-O-Meters kann ein teilweise subjektives
Beobachtungsrisiko und eine maximal erreichbare Anonymit&auml;t abgeleitet
werden. Je mehr Nutzer aktiv sind und auch Nachrichten senden bzw. empfangen,
um so gr&ouml;&szlig;er ist die Anonymit&auml;tsgruppe jeder einzelnen ins
Internet gesendeten Nachricht, da potentiell jeder Nutzer die Nachricht
gesendet haben k&ouml;nnte. Besonders wichtig ist auch die Anzahl und
Verteilung der Dienstbetreiber: je mehr Mixe in einer Kaskade stehen, und je
weiter und internationaler diese Mixe und deren Betreiber verteilt sind, desto
geringer ist die Wahrscheinlichkeit, dass der Benutzer von den Betreibern (oder
von Dritten, welche die Betreiber dazu zwingen) beobachtet werden kann. Welcher
Wert f&uuml;r Sie pers&ouml;nlich wichtiger ist, h&auml;ngt vom Beobachter ab,
vor dem Sie sich sch&uuml;tzen m&ouml;chten. Diese Bewertung bietet, neben der
Informationsfunktion f&uuml;r die Nutzer, auch positive Anreize f&uuml;r
kommerzielle Mixbetreiber um m&ouml;glichst sichere Kaskaden aufzubauen.</p>

<table style="border-spacing:20px">
  <tbody>
    <tr>
      <td><img src="JAP.NewView_m66.anim.gif" alt="Anonym-O-Meter"></td>
      <td>Ein solches oder &auml;hnliches Bild zeigt an, dass Sie erfolgreich
        eine Verbindung mit einem Anonymisierungsdienst aufgenommen haben. Die
        Symbole geben Ihnen einen Ma&szlig; daf&uuml;r an, wie hoch die maximal
        m&ouml;gliche Anonymit&auml;t auf dem Dienst einzusch&auml;tzen ist,
        mit dem sie gerade verbunden sind. Die linken Symbole (Server-Icons)
        reflektieren die Anzahl der Server und Betreiber Optimalwert: drei
        Betreiber). Die Farben der Verbindungen dazwischen beschreiben die
        internationale Verteilung dieser Server. Je mehr Farben (au&szlig;er
        Grau) Sie sehen, desto besser ist dieser Dienst verteilt. (Optimalwert:
        Betreiber und Mixe in mindestens drei unterschiedlichen L&auml;ndern =
        eine blaue und eine gr&uuml;ne Verbindung). Das rechte Symbol bewertet
        die aktuelle Nutzerzahl des Dienstes (Optimalwert: mindestens 500).
        Diese beiden Werte, Verteilung (Distribution) und Nutzerzahl (Users),
        werden zus&auml;tzlich in je einem Bewertungs-Balken am unteren Rand
        dargestellt: je besser der Wert, desto "gr&uuml;ner" wird der jeweilige
        Balken. In reiner Zahlendarstellung werden beide Werte als 0 bis 6,
        durch Komma getrennt, dargestellt (z.B. 5,4 / 6,6 - die letzten beiden
        Werte beschreiben jeweils das theoretische Maximum: zuerst die
        Verteilung, dann die Nutzer).</td>
    </tr>
    <tr>
      <td><img src="JAP.deactivated.anim.gif"
      alt="Anonym-O-Meter deaktiviert"></td>
      <td><p>Dieses Bild erscheint, wenn Sie den Anonymit&auml;tsmodus
        ausgeschaltet haben. Sie k&ouml;nnen weitersurfen, m&uuml;ssen den
        nicht-anonymen Zugriff aber jeweils best&auml;tigen.</p>
      </td>
    </tr>
    <tr>
      <td><img src="JAP.no.measure.anim.gif"
      alt="Anonym-O-Meter ohne Messung"></td>
      <td>Wenn dieses oder ein &auml;hnliches Bild gezeigt wird, wurde eine
        Verbindung zum gew&auml;hlten Dienst hergestellt und Sie k&ouml;nnen
        auch anonym surfen. Allerdings konnten vom <a
        href="infoservice.html">InfoService</a> noch keine Statusinformationen
        geholt werden. Das kann an einem Fehler im InfoService liegen, an einer
        langsamen Internetanbindung, einer Blockade durch eine (Personal)
        Firewall oder einfach daran, dass Sie JonDo die <a
        href="infoservice.html#infoservice_auto">automatischen
        InfoService-Anfragen verboten</a> haben. </td>
    </tr>
    <tr>
      <td><img src="JAP.connecting.anim.gif"
        alt="Anonym-O-Meter Verbindungsaufbau"></td>
      <td>W&auml;hrend JonDo versucht, eine Verbindung zu einem
        Anonymisierungsdienst herzustellen, wird dieses Bild gezeigt.
        W&auml;hrenddessen wird jede Verbindung ins Internet &uuml;ber JonDo
        blockiert.</td>
    </tr>
  </tbody>
</table>
<hr>

<p class="navipar"><span class="prevlink"><a href="interface.html"><img
src="prev.gif" alt="&lt;-"> JonDo-Oberfl&auml;che</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_bedienung"><img src="next.gif" alt="-&gt;"> Bedienung
</a></span> <span class="nextlink"><a href="miniwindow.html">Minifenster <img
src="next.gif" alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
