<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="certificates.html">&larr; Zertifikate</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_browser"> &rarr; Browservorbereitung </a></span>
<span class="nextlink"><a href="browser.html">andere Browser &rarr;</a></span> 
</p>
<hr>
<h2>JonDoFox</h2>
<p>
<a href="http://www.jondos.de/de/jondofox">JonDoFox</a> ist ein Firefox-Browser, der speziell f&uuml;r das anonyme Surfen mit <b>JonDonym</b> optimiert ist. Er besteht aus einem portablen Firefox-Browser und einem von JonDos angepassten Profil.
Dieses enth&auml;lt sowohl alle notwendigen Voreinstellungen zum anonymen Surfen &uuml;ber den JonDo, als auch sicherheitskritische <a href="www.mozilla.org">Add-ons</a>, die potentielle Schwachpunkte, wie z.B. aktive Inhalte und Cookies absichern. Dabei ist der Browser portabel einsetzbar, d.h. man kann Ihn zusammen mit dem JonDo auf einen Wechseldatentr&auml;ger kopieren, um ihn auf jedem beliebigen System ohne lokale Installation auszuf&uuml;hren. Hierbei werden keinerlei Spuren auf dem System hinterlassen, auf dem Sie JonDoFox einsetzen. Aus diesem Grund empfiehlt JonDos empfiehlt den Einsatz von JonDoFox, denn dabei entf&auml;llt f&uuml;r Sie der Konfigurationsaufwand und die Gefahr, dass Sie beim Surfen Datenspuren hinterlassen, ist minimal.
</p>

<p>
<a href="http://www.jondos.de/de/jondofox">JonDoFox</a> ist f&uuml;r <a href="#ffpwindows">Windows</a>, <a href="#ffpmacosx">Mac OS X</a> und <a href="#ffplinux">Linux</a> erh&auml;ltlich. Sie haben auch die M&ouml;glichkeit, das JonDoFox-Profil zu Ihrer bereits bestehende Firefox-Installation hinzuzuf&uuml;gen.
</p>

<p><b>Bitte beachten Sie</b>:<br> Zum anonymen Surfen mit JonDonym gen&uuml;gt es nicht den JonDoFox auszuf&uuml;hren. Hierf&uuml;r ben&ouml;tigen Sie auch den JonDo-Client, den Sie auf unserer <a href="https://www.jondos.de/de/download">Homepage</a> herunterladen k&ouml;nnen. Eine Anleitung zum Starten des JonDos finden Sie hier.  
</p>

<h3><a name="ffpwindows">Installation unter Windows</a></h3>
<p>
Unter diesem <a href="https://www.jondos.de/de/downloads/JonDoFox.paf.exe">Link</a> finden sie ein JonDoFox-Paket, das bereits f&uuml;r die Verwendung mit <a href="">PortableApps</a> vorbereitet ist. Sie k&ouml;nnen diese unter Windows sowohl auf einem Wechseldatentr&auml;ger, z.B einem USB-Stick, verwenden oder das Programm lokal auf Ihrer Festplatte ausf&uuml;hren. Kopieren Sie dazu die Datei <i>JonDoFox.paf</i> auf den Datentr&auml;ger, auf dem Sie JonDoFox ausf&uuml;hren m&ouml;chten und starten Sie das Programm von dort mit einen Doppelklick auf die soeben kopierte Datei.
</p>
<h3><a name="ffpmacosx">Installation unter Mac OS X</a></h3>
<p>
Eine portable Version des JonDoFox f&uuml;r Mac OS X k&ouml;nnen Sie hier erhalten. Diese Version kann sowohl von einem portable Datentr&auml;ger als auch lokal von der Festplatte gestartet werden. Zur Installtion doppelklicken Sie bitte auf die dmg-Datei. Kopieren Sie dann einfach die Firefox-Datei auf einen Datentr&auml;ger Ihrer Wahl. Von dort aus k&ouml;nnen Sie das Programm einfach durch Doppelklick starten.
</p>
<p>
Bitte beachten Sie, dass der portable Firefox Mac OS X 10.4 oder neuer erfordert. F&uuml;r &auml;ltere Versionen installieren Sie bitte einen entsprechenden Firefox, und erg&auml;nzen Sie Ihn um das JonDoFox-Profil. Eine Anleitung dazu finden Sie <a href="#macosxffprofile">hier</a>.
</p>

<h3><a name="ffpLinux">Installation unter Linux</a></h3>
<p>
F&uuml;r Linux gibt es leider derzeit noch keine portable Firefox-Version. Wenn Sie JonDoFox unter Linux verwenden wollen, haben Sie die M&ouml;glichkeit eine Firefox-Version zu installieren und diese um das JonDoFox-Profil zu erg&auml;nzen. Das Profil ist unter diesem <a href="https://www.jondos.de/de/downloads/profile.zip">Link</a> erh&auml;ltlich.<br> Zur Installation gehen Sie bitte folgenderm&szlig;en vor:
</p>
<ol>
<li>Installieren Sie Firefox, falls dieser noch nicht auf Ihrem System installiert ist. Firefox erhalten Sie unter <a href="www.mozilla.org">www.mozilla.org</a> </li>
<li>Entpacken Sie die Datei mit <code>unzip profil.zip</code>.</li>
<li>Starten Sie nun den Firefox mit <code> firefox -P</code>. Dadurch wird der Firefox-Profilmanager ge&ouml;ffnet.</li>
<li>Fahren Sie nun fort, wie unter <a href="#ffprofilemanager">Hinzuf&uuml;gen des JonDoFox-Profils, mit dem Firefox-Profilmanager</a> beschrieben.</li>


</ol>

<h3><a name="ffprofile">Vorhandende Firefox-Installation um JonDoFox-Profil erg&auml;nzen</a></h3>
<p>Besitzen Sie bereits eine Firefox-Installation auf Ihrem System, so k&ouml;nnen Sie diese um das JonDoFox-Profil erg&auml;nzen, um ein H&ouml;chstma&szlig; an Anonymit&auml;tat zu erreichen, wenn Sie <b>JonDonym</b> nutzen. Jenachdem welches Betriebssystem Sie verwenden, gibt es dazu folgende Vorgehensm&ouml;glichkeiten:
</p>
<ul>
<li><b>Windows</b></li>
<ol>
<li>Laden Sie die <a href="https://www.jondos.de/de/downloads/profile.zip">JonDoFox-Profil-Datei</a> herunter</li> 
<li>Bei der Profil-Datei handelt es sich um ein zip-Archiv. Entpacken Sie diese. Dabei erhalten Sie einen Ordner, der <i>profile</i> hei&szlig;t.</li>
<li>Starten Sie die Eingabeaufforderung. W&auml;hlen sie dazu: Startmen&uuml; -&gt; Ausf&uuml;hren, 
<li>Geben sie in das Textfeld ein: <code>firefox -P</code> und dr&uuml;cken Sie auf OK.<br>
(Hinweis: Achten Sie bitte bei der Angabe von &quot;-P&quot; auf die Gro&szlig;- und Kleinschreibung).</li>
<li>Fahren Sie fort bei der Beschreibung: <a href="#ffprofilemanager">Hinzuf&uuml;gen des JonDoFox-Profils, mit dem Firefox-Profilmanager</a>.</li>
</ol>
<li><a name="macosxffprofile"><b>Mac OS X</b></a></li>
<ol>
<li>Laden Sie die Image-Datei <a href="https://www.jondos.de/de/downloads/JonDoFox_OS_X.dmg">JonDoFox_OS_X.dmg</a> herunter.</li>
<li>Doppelklicken Sie auf diese Image-Datei. Das Disk-Image &ouml;ffnet sich daraufhin.</li>
<li>Das Disk-Image enth&auml;lt die Datei <i>JonDoFox_Install</i>. Doppelklicken Sie auf diese. Dadurch wird eine Installtionsroutine gestartet, die das Profil automatisch zu Ihrer bestehenden Firefox-Installation hinzuf&uuml;gt.</li>
<li>Sollten Sie bereits ein Profil installiert haben, fragt die Installationroutine, ob Sie das vorhandene Profil &uuml;berschreiben soll.</li>
<li>Das Installationsprogramm gibt Ihnen eine R&uuml;ckmeldung &uuml;ber den Erfolg, bevor es sich beendet.</li>
</ol>
<li><b>Linux</b></li>
Gehen Sie hierzu vor, wie in dieser <a href="#ffplinux"> Anleitung </a> beschrieben.
</ul>

<h4><a name="ffprofilemanager">Hinzuf&uuml;gen des JonDoFox-Profils, mit dem Firefox-Profilmanager</a></h4>
<i>Bild</i>
<p>
Wenn Sie den Profilmanager ge&ouml;ffnet haben, gehen Sie nun folgenderma&szlig;en vor, um das JonDoFox-Profil hinzuzuf&uuml;gen:
</p>
<ol>
<li>W&auml;hlen sie nun &quot;Profil erstellen&quot;.</li>
<li>Es erscheint der Dialog zum Erstellen eines Profils. Klicken Sie auf &quot;Fortsetzen&quot;.</li>
<li>In dem jetzt erscheinenden Dialog k&ouml;nnen Sie einen Name f&uuml;r das Profil w&auml;hlen und den Profil-Ordner angeben. Den Namen f&uuml;r das JonDoFox-Profil k&ouml;nnen Sie frei w&auml;hlen. Als Ordner geben Sie bitte das Verzeichnis an, in das Sie die Datei <i>profile.zip</i> entpackt haben.</li>
<li>Beenden Sie die Installation des Profils, indem sie auf &quot;Fertigstellen&quot; klicken.</li>
</ol>
<hr>
<p class="navipar">
<span class="prevlink"><a href="certificates.html">&larr; Zertifikate</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_browser"> &rarr; Browservorbereitung </a></span>
<span class="nextlink"><a href="interface.html"><a href="browser.html">andere Browser &rarr;</a></a></span>
</p>

</body>
</html>