<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Netzwerk</H2>

<p>
In diesem Abschnitt k&ouml;nnen Sie alle Einstellungen vornehmen, die  Netzwerkverbindungen des JonDo betreffen. 
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Netzwerk</i>.<br>
</p> 

<h3>Umgehung von Internetzensur und -filterung</h3>

<p>
Diese Funktion ist erforderlich, wenn Sie keine Verbindung zum Anonymisierungsdienst herstellen k&ouml;nnen, weil diese in der Firewall, bei Ihrem Internet Service Provider oder durch Ihre Regierung gesperrt wurde.
</p>

<p>
In diesem Fall k&ouml;nnen Sie folgende Option aktivieren: <br>
<b>Mit anderen JAP/JonDo-Nutzern verbinden, um den Anonymisierungsdienst zu erreichen.</b>
Durch Aktivieren dieser Option stellen Sie die Verbindung zu einer Mixkaskade &uuml;ber einen JonDo vornehmen, der als <a href="">Forwarding-Server</a> agiert. 
</p>

<p>
<b>Hinweis:</b><br>
Nehmen Sie diese Einstellung bitte nur dann vor, wenn Sie sich nicht direkt mit den Mixkaskaden verbinden k&ouml;nnen. Sie reduzieren damit Ihre Bandbreite drastisch und der Verbindungsvorgang wird unn&ouml;tig erschwert. 
</p>

<h3>Listener-Portnummer</h3>
<p>
Damit JonDo die Kommunikation mit dem Internet anonymisieren kann, muss
er in die Kommunikation zwischen Browser und Server im Internet
zwischengeschaltet werden. Eine solche Zwischenstation wird allgemein als
Proxy bezeichnet. Hier k&ouml;nnen Sie die Einstellungen vornehmen, die die Proxy-Funktionen des JonDos betreffen:

Einstellung k&ouml;nnen Sie 
</p>

<ul>
    <li>
	<p>
	<b>Portnummer:</b><br>
    Tragen Sie hier die Portnummer ein, auf der JonDo die Verbindungen von Ihrem Browser entgegen nehmen soll. Bitte beachten Sie, dass Sie die Einstellungen in Ihrem Browser entsprechend <a href="browser.html">anpassen</a> m&uuml;ssen, falls Sie hier &Auml;nderungen vornehmen.
	</p>
	<p>
	<b>Hinweis:</b><br>
	Die Portnummer ist beim JonDo auf 4001
voreingestellt. Wir empfehlen diese Einstellung beizubehalten, da Sie mit vielen weiteren Einstellungen abgestimmt ist. &Auml;ndern Sie die Portnummer nur, wenn Sie genau wissen aus welchem Grund dies f&uuml;r Sie erforderlich ist.
	</p>
	</li>
    
    <li>
	<p>
	<b>Zugriff auf JonDo nur dem eigenen Rechner erlauben:</b><br>
    Wenn Sie diese Option aktivieren, dann kann nur Ihr eigener Rechner eine Verbindung zu Ihrem JonDo aufbauen. Ist sie deaktiviert, k&ouml;nnen alle Rechner, die &uuml;ber eine Netzwerkverbindung mit Ihrem Rechner verbunden sind, eine Verbindung zu Ihrem JonDo aufbauen. Damit k&ouml;nnen Unbefugte Ihren JonDo zu illegalen Zwecken mi&szlig;brauchen und ggf. auch Ihr bezahltes Guthaben verbrauchen. Solange Sie keinen triftigen Grund haben, anderen Rechnern den Zugriff zu erlauben, wird empfohlen die Option aus Sicherheitsgr&uuml;nden zu aktivieren.
	</p>
	</li>
</ul>

<h3>Zwangs-Proxy/Firewall</h3>

<p>
Einige Nutzer k&ouml;nnen den Anonymisierungsdienst nicht direkt nutzen.
Dies ist der Fall, wenn Sie sich wegen einer Firewall nicht direkt mit den
ersten Mix verbinden k&ouml;nnen. Au&szlig;erdem gibt es einige
Internet-Provider, die die Nutzung eines bestimmten Zwangs-Proxy
vorschreiben.
</p>
<p>
Wenn Sie mit Sicherheit wissen, dass Sie einen Zwangs-Proxy verwenden m&uuml;ssen, so k&ouml;nnen Sie hier die Konfiguration des Proxy-Zugangs vornehmen:
</p>

<ul>
    <p>
	<li><b>Ich muss einen "Zwangs-Proxy" verwenden:</b><br>
    Aktivieren Sie diese Option, um die Einstellungen f&uuml;r einen Zwangs-Proxy vornehmen zu k&ouml;nnen.
	</li>
	</p>
    
    <li>
	<p>
	<b>Typ:</b><br>
    Stellen Sie den Typ Ihres Proxys ein. M&ouml;gliche Typen sind "Socks-Proxy" oder "HTTP/HTTPS-Proxy".
    </p>
	</li>
    <LI>
	<p>
	<b>Host:</b><br>
    Tragen Sie hier den Hostnamen oder die IP-Adresse Ihres Proxys ein.
    </p>
    
	<li>
	<p>
	<b>Port:</b><br>
    Tragen Sie hier den Port ein, auf dem Ihr Proxy Verbindungen entgegen nimmt.
    </p>
	</li>
	
    <li>
	<p>
	<b>F&uuml;r die Verwendung des Proxy wird eine Zugriffsberechtigung ben&ouml;tigt:</b><br>
    Markieren Sie dieses Feld, wenn Sie sich an Ihrem Proxy anmelden m&uuml;ssen.
    </p>
	</li>
	
    <li>
	<p>
	<b>Nutzerkennung:</b><br>
    Tragen Sie hier Ihren Benutzernamen f&uuml;r den Zugriff auf den Proxy ein. Das Passwort wird bei der ersten Verbindung zum Proxy automatisch abgefragt.
	</p>
	</li>
</ul>

<!--#include virtual="/footer.html"-->
</body>
</html>