<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<H2>Bezahlung: Erweiterte Einstellungen</H2>
<i>Dieses Panel steht nur in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i>
<P>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i>, w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Bezahlung</i> und &ouml;ffnen anschlie&szlig;end den Tab <i>Erweiterte Einstellungen</i>. In diesem Dialog k&ouml;nnen Sie erweiterte Einstellungen f&uuml;r die Bezahlung vornehmen.
<P>
<UL><!--
    <LI><B>Best&auml;tigungsdialog vor der Benutzung eines kostenpflichtigen Dienstes anzeigen</B><BR>
    Wenn Sie diese Option aktivieren, wird ihnen ein Dialog zur Best&auml;tigung angezeigt bevor JonDo eine kostenpflichtige Kaskade benutzt. Das hat auch zur Folge, dass JonDo sich nicht automatisch mit einer Bezahlkaskade verbinden kann.
    <P>-->
    <LI><B>Nicht-anonymisierte Verbindungen zu Bezahlinstanzen erlauben</B><BR>
    Ist diese Option aktiviert, kann JonDo Informationen &uuml;ber Ihren Kontostand abfragen, auch wenn Sie gerade nicht anonym surfen.<br>
    Wird diese Option nicht aktiviert, k&ouml;nnen nur &uuml;ber eine anonymisierte Verbindung Kontodaten abgerufen werden.<br>
    Es wird deshalb empfohlen, diese Option zu aktivieren.
  <P><LI><B>Fehlermeldungen der Abrechnungsinstanz melden (Nur in der Entwicklerversion verf&uuml;gbar)</B><BR>
    Wenn diese Option aktiviert ist, werden Fehlermeldungen bez&uuml;glich der Abrechnungsinstanz angezeigt. Es wird empfohlen, diese Option zu aktivieren.
    <br>In den stabilen Versionen ist dies immer aktiviert.
    <P>
    <LI><B>Kontostand automatisch aktualisieren</B><BR>
    Wenn Sie diese Option aktivieren, versucht JonDo in regelm&auml;&szlig;igen Zeitabst&auml;nden Ihre Kontoinformationen zu aktualisieren.<br>
    Wenn Sie dies nicht erlauben, wird in JonDo nicht automatisch der aktuelle Kontostand angezeigt. Das Konto wird bei der Bezahlinstanz dennoch korrekt gef&uuml;hrt.
    <P>
	<LI><B>Warnen wenn beim Beenden von JonDo nicht von allen Konten eine Kopie existiert</B><BR>
    Sie k&ouml;nnen JonDo dazu auffordern Sie zu warnen, wenn beim Schlie&szlig;en keine Sicherheitskopie von einem oder mehreren Ihrer Konten vorliegt. Denken Sie daran, dass es keine M&ouml;glichkeit gibt Ihr Geld zur&uuml;ckzubekommen, wenn die JonDo-Konfiguration besch&auml;digt oder gel&ouml;scht wurde und keine Sicherheitskopie Ihrer Konten bei Ihnen vorliegt.
      <P>
  <LI><B>Verbindungs-Timeout</B><BR>
    Setzt das Timeout f&uuml;r Verbindungen zur Bezahlinstanz. Wenn Sie Probleme beim Erzeugen oder Aufladen von Konten haben, k&ouml;nnte eine Erh&ouml;hung des Timeouts diese m&ouml;glicherweise beheben. 
</UL>

<!--#include virtual="/footer.html"-->
</body>
</html>