<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="appearance.html"><img src="prev.gif"> Ver&auml;ndern des Erscheinungsbilds</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif"> Konfiguration </a></span>
<span class="nextlink"><a href="update.html">Einspielen von Updates <img src="next.gif"></a></span> 
</p>
<hr>

<h2>Bezahlung</h2>
<p>
Um zu diesem Einstellungsfenster zu gelangen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i> und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Bezahlung</i>.<br>
In diesem Dialog k&ouml;nnen Sie neue Konten anlegen um die <a href="premiumservice.html">Premiumdienste</a> nutzen zu k&ouml;nnen.
Desweiteren haben Sie hier die M&ouml;glichkeit Ihre bereits bestehenden Konten verwalten und alle weiteren Einstellungen vorzunehmen, die Sie ben&ouml;tigen, um die Premiumdienste zu nutzen.
</p>

<h3>Konten</h3>
<p>
In der Liste sehen Sie die Konten, die Sie bereits angelegt haben. Wenn Sie diesen Dialog zum ersten Mal aufrufen, ist die Liste leer, da Sie noch kein Konto angelegt haben.
</p>
<p>
Neben der Liste mit den Konten sehen sie das Erstellungsdatum, das Datum der letzten Kontostandsaktualisierung und das G&uuml;ltigkeitsdatum des markierten Kontos. Nach Ablauf des G&uuml;ltigkeitsdatums k&ouml;nnen Sie das Konto leider nicht mehr verwenden. Wenn Sie weiter auf die Premiumdienste zugreifen m&ouml;chten, legen Sie bitte ein neues Konto an. 
</p>
<p>
Wenn neben der Liste der Hinweis "Keine Sicherheitskopie vorhanden" angezeigt ist, haben Sie von dem gew&auml;hlten Konto noch keine Kopie erstellt. Ein Klick auf den Hiweis hat den gleichen Effekt wie ein Klick auf den Knopf <i>Sichern</i>.
</p>
<p> 
Sie k&ouml;nnen folgende Aktionen durchf&uuml;hren:
</p>
<ul>
    <li>
	<p>
	<b>Konto erzeugen</b><br>
    Hiermit legen Sie ein neues Konto an. Der Kontoerstellungsprozess kann etwas Zeit in Anspruch nehmen, da hierf&uuml;r ein aufw&auml;ndiger kryptographischer Vorgang gestartet werden muss. Dies ist notwendig, damit die Kontoerzeugung vertraulich erfolgen kann und Ihnen keine gef&auml;lschten Informationen &uuml;bermittelt werden. W&auml;hrend des Erstellungsvorgangs werden Sie m&ouml;glicherweise aufgefordert, eine Sicherheitsfrage zu beantworten. 
	Der Ablauf der Kontoerzeugung unterscheidet sich je nach Bezahlmethode. Bitte folgen Sie dazu den Anweisungen am Bildschirm. Wenn Ihr Konto erfolgreich erstellt wurde, erscheint es in der Liste der verf&uuml;gbaren Konten.
    </p>
	<p>
	<b>WICHTIG :</b><br>
	Bitte <a href="#saveaccount">sichern Sie Ihr Konto</a>, nachdem Sie es erzeugt haben.  Ihr Guthaben geht unwiederbringlich verloren, falls die Konfigurationsdatei des JAPs gel&ouml;scht wird. Am sinnvollsten ist es, die Kontodatei auf einem externen Wechelsdatentr&auml;ger, z.B. einem USB-Stick zu sichern. Falls es zu einem Datenverlust auf Ihrem System kommt, kann auch eine lokal abgespeicherte Kontodatei verlorengehen.
	</p>	
	</li>
	          
    <li>
	<p>
	<b>Transaktionen</b><br>
	Hier k&ouml;nnen Sie sich die letzten Aufladetransaktionen Ihrer Konto ansehen.
	</p>
	<p>
	<b>Hinweis:</b><br>
	Beachten Sie, dass f&uuml;r ein Konto jeweils nur eine Transaktion m&ouml;glich ist. Sie k&ouml;nnen also kein leeres Konto wieder aufladen. Erzeugen Sie in diesem Fall einfach ein neues Konto.
	</p>
	</li>
  
	<li>
	<p>
	<b>Passwort &auml;ndern</b><br>
    Durch Klicken dieser Schaltfl&auml;che k&ouml;nnen Sie ein neues Passwort f&uuml;r die Verschl&uuml;sselung Ihrer Kontodaten angeben. Das Passwort gilt f&uuml;r alle Konten.<br>
	Wenn Sie ihr Passwort l&ouml;schen wollen, gehen Sie auf <i>Passwort &auml;ndern</i>, lassen Sie das Textfeld f&uuml;r das neue Passwort und die Best&auml;tigung einfach leer und klicken <span class="nowrap">auf <i>OK</i></span>.
    </p>
	</li>
	
	<li>
	<p>
	<b>Importieren</b><br>
	Wenn Sie diese Aktion w&auml;hlen, k&ouml;nnen Sie ein zuvor gesichertes Konto wieder importieren.
	</p>
	</li>
</ul>

<h3>Informationen zum Kontostand</h3>
<p>
Hier sehen Sie das Resvolumen, das sich noch auf Ihrem aktuellen Konto befindet. Au&szlig;erdem wird Ihnen der bisherige Gesamtverbrauch angezeigt und angegeben, welchen Betrag Sie insgesamt auf das Konto einbezahlt haben.
</p>
<p>
Sie k&ouml;nnen folgende Aktionen ausf&uuml;hren:
</p>
<ul>
    <li>
	<p>
	<b>Aktivieren</b><br>
Mit diesem Knopf aktivieren Sie das gew&auml;hlte Konto. Das Konto wird bei der Verbindung zu einer kostenpflichtigen Kaskade zum Bezahlen genutzt. Beim Wechsel des aktiven Kontos muss erst die Verbindung zur Kaskade getrennt werden. Das aktivierte Konto ist fett hervorgehoben.<br>
Sollten Sie ihre Konten passwortgesch&uuml;tzt haben und dieses Passwort beim Starten nicht eingegeben haben, so k&ouml;nnen sie ihre Konten durch diesen Knopf entsperren, sofern sie das richtige Passwort kennen.
	</p>
    </li>
    
	<li>
	<p>
	<b>Aktualisieren</b><br>
	Wenn Sie diese Aktion w&auml;hlen, wird der aktuelle Kontostand von der Bezahlinstanz abgefragt.
	</p>
	</li>
	        
    <li>
	<p>
	<b>L&ouml;schen</b><br>
	Hiermit l&ouml;schen Sie Ihr Konto.<br>
	</p>
	<p>
	<b>ACHTUNG:</b> Sollte sich auf Ihrem Konto noch Guthaben befinden, ist dieses <b>unwiederbringlich verloren</b>, wenn Sie keine Sicherheitskopie angelegt haben!
	</p>
  
    <li>
	<p>
	<b><a name="saveaccount">Sichern</a></b><br>
    Dieser Knopf speichert Ihre Kontodaten in einer externen Datei. Dies ist  sinnvoll, um bei Datenverlust Ihrer Festplatte oder Neuinstallation von JonDo oder des Gesamtsystems wieder Zugriff auf Ihr Konto erhalten zu k&ouml;nnen. Sie sollten die Exportdatei also auf ein externes Medium (z.B. USB-Stick) speichern. Es wird empfohlen, ein neu angelegtes Konto zur Sicherung zu exportieren.
	</p>
	</li>
</ul>

<h3>Erweiterte Einstellungen</h3>
<p>
<i>Diese Einstellungen stehen Ihnen in der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur Verf&uuml;gung.</i>
</p>
<p>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i>, w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Bezahlung</i> und &ouml;ffnen anschlie&szlig;end den Tab <i>Erweiterte Einstellungen</i>. In diesem Dialog k&ouml;nnen Sie erweiterte Einstellungen f&uuml;r die Bezahlung vornehmen.
</p>
<ul><!--
    <LI><B>Best&auml;tigungsdialog vor der Benutzung eines kostenpflichtigen Dienstes anzeigen</B><BR>
    Wenn Sie diese Option aktivieren, wird ihnen ein Dialog zur Best&auml;tigung angezeigt bevor JonDo eine kostenpflichtige Kaskade benutzt. Das hat auch zur Folge, dass JonDo sich nicht automatisch mit einer Bezahlkaskade verbinden kann.
    <P>-->
    <li>
	<p>
	<b>Nicht-anonymisierte Verbindungen zu Bezahlinstanzen erlauben</b><br>
    Ist diese Option aktiviert, kann JonDo Informationen &uuml;ber Ihren Kontostand abfragen, auch wenn Sie gerade nicht anonym surfen.<br>
    Wird diese Option nicht aktiviert, k&ouml;nnen nur &uuml;ber eine anonymisierte Verbindung Kontodaten abgerufen werden.<br>
    Es wird deshalb empfohlen, diese Option zu aktivieren.
	</p>
	</li>
  
	<li>
	<p>
	<b>Fehlermeldungen der Abrechnungsinstanz melden (Nur in der Entwicklerversion verf&uuml;gbar)</b><br>
    Wenn diese Option aktiviert ist, werden Fehlermeldungen bez&uuml;glich der Abrechnungsinstanz angezeigt. Es wird empfohlen, diese Option zu aktivieren.
    <br>In den stabilen Versionen ist dies immer aktiviert.
    </p>
	</li>
   
	<li>
	<p>
	<b>Kontostand automatisch aktualisieren</b><br>
    Wenn Sie diese Option aktivieren, versucht JonDo in regelm&auml;&szlig;igen Zeitabst&auml;nden Ihre Kontoinformationen zu aktualisieren.<br>
    Wenn Sie dies nicht erlauben, wird in JonDo nicht automatisch der aktuelle Kontostand angezeigt. Das Konto wird bei der Bezahlinstanz dennoch korrekt gef&uuml;hrt.
    </p>
	</li>
	
	<li>
	<p>
	<b>Warnen wenn beim Beenden von JonDo nicht von allen Konten eine Kopie existiert</b><br>
    Sie k&ouml;nnen JonDo dazu auffordern Sie zu warnen, wenn beim Schlie&szlig;en keine Sicherheitskopie von einem oder mehreren Ihrer Konten vorliegt. Denken Sie daran, dass es keine M&ouml;glichkeit gibt Ihr Geld zur&uuml;ckzubekommen, wenn die JonDo-Konfiguration besch&auml;digt oder gel&ouml;scht wurde und keine Sicherheitskopie Ihrer Konten bei Ihnen vorliegt.
	</p>
	</li>
	  
	<li>
	<p>
	<b>Verbindungs-Timeout</b><br>
    Setzt das Timeout f&uuml;r Verbindungen zur Bezahlinstanz. Wenn Sie Probleme beim Erzeugen oder Aufladen von Konten haben, k&ouml;nnte eine Erh&ouml;hung des Timeouts diese m&ouml;glicherweise beheben. 
	</p>
	</li>
</ul>
<!--#include virtual="/footer.html"-->
<hr>
<p class="navipar">
<span class="prevlink"><a href="appearance.html"><img src="prev.gif"> Ver&auml;ndern des Erscheinungsbilds</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif"> Konfiguration </a></span>
<span class="nextlink"><a href="update.html">Einspielen von Updates <img src="next.gif"></a></span> 
</p>

</body>
</html>