<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Bezahlung</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="appearance.html"><img
src="prev.gif" alt="&lt;-"> Ver&auml;ndern des Erscheinungsbilds</a></span>
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a></span> <span class="nextlink"><a href="update.html">Einspielen von
Updates <img src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>Bezahlung</h2>

<p><em class="jconf">Um zu diesem Einstellungsfenster zu gelangen, klicken
Sie im Hauptfenster von JonDo auf <code class="jconf">Einstellungen</code>
und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Bezahlung</code>. <strong>Hinweis: Dieser Dialog ist nicht in
allen Versionen des Programms verf&uuml;gbar.</strong></em></p>

<p>In diesem Dialog k&ouml;nnen Sie neue Konten anlegen um die <a
href="premium.html">Premiumdienste</a> nutzen zu k&ouml;nnen.
Desweiteren haben Sie hier die M&ouml;glichkeit Ihre bereits bestehenden
Konten zu verwalten. </p>

<h3>Konten</h3>

<p>In der Liste sehen Sie die Konten, die Sie bereits angelegt haben. Wenn
Sie diesen Dialog zum ersten Mal aufrufen, ist die Liste leer, da Sie noch
kein Konto angelegt haben. </p>

<p>Neben der Liste mit den Konten sehen Sie folgende Informationen zu Ihrem
Konto: </p>
<ul>
  <li><p><b>Erstellungsdatum</b><br>
    gibt an, wann an welchem Datum das Konto erzeugt wurde. </p>
  </li>
  <li><p><b>G&uuml;ltig bis</b><br>
    Bis zu diesem Datum k&ouml;nnen Sie das entsprechende Konto nutzen. </p>
  </li>
  <li><p><b>Bezahlinstanz</b><br>
    Bei diesem Anbieter wurde das Konto erzeugt. Darunter ist ein Verweis zu
    den geltenden Allgemeinen Gesch&auml;ftsbedingungen des
    Bezahldienstleisters angegeben. <strong>Bitte beachten Sie, dass die
    Allgemeinen Gesch&auml;ftsbedingungen der Anbieter von Mix-Diensten davon
    unabh&auml;ngig g&uuml;ltig sind.</strong></p>
  </li>
</ul>

<p>Wenn neben der Liste der Hinweis "Keine Sicherheitskopie vorhanden"
angezeigt ist, haben Sie von dem gew&auml;hlten Konto noch keine
Sicherheitskopie erstellt. Wir empfehlen Ihnen, <b>von jedem Ihrer Konten
eine Sicherung auf einem externen Datentr&auml;ger anzulegen</b>. Dadurch ist
Ihr Guthaben vor Datenverlust gesch&uuml;tzt. Durch einen Klick auf den
Hinweis oder der Schaltfl&auml;che <a href="#saveaccount"><code
class="jconf">Exportieren</code></a> haben Sie die M&ouml;glichkeit das
ausgew&auml;hlte Konto zu sichern.</p>

<p>Sie k&ouml;nnen folgende Aktionen durchf&uuml;hren: </p>
<ul>
  <li><p><b>Konto erzeugen</b><br>
    Hiermit legen Sie ein neues Konto an. Der Kontoerstellungsprozess kann
    etwas Zeit in Anspruch nehmen, da hierf&uuml;r ein aufw&auml;ndiger
    kryptographischer Vorgang gestartet werden muss. Dies ist notwendig,
    damit die Kontoerzeugung vertraulich erfolgen kann und Ihnen keine
    gef&auml;lschten Informationen &uuml;bermittelt werden. W&auml;hrend des
    Erstellungsvorgangs werden Sie m&ouml;glicherweise aufgefordert, eine
    Sicherheitsfrage zu beantworten. Der Ablauf der Kontoerzeugung
    unterscheidet sich je nach Bezahlmethode. Bitte folgen Sie dazu den
    Anweisungen am Bildschirm. Wenn Ihr Konto erfolgreich erstellt wurde,
    erscheint es in der Liste der verf&uuml;gbaren Konten. </p>
    <p><b>WICHTIG</b><br>
    Bitte <a href="#saveaccount">sichern Sie Ihr Konto</a>, nachdem Sie es
    erzeugt haben, auf einen externen Datentr&auml;ger, z.B. einem USB-Stick
    zu sichern. Dies sch&uuml;tzt Sie vor Datenverlust. </p>
  </li>
  <li><b>Transaktionen</b><br>
    Hier k&ouml;nnen Sie sich die letzten Zahlungsvorg&auml;nge f&uuml;r Ihre
    Konten ansehen. Pro Konto ist jeweils nur eine Transaktion m&ouml;glich.
    Sie k&ouml;nnen ein leeres Konto, auf das Sie nichts eingezahlt oder das
    Sie verbraucht haben, jederzeit l&ouml;schen. Sie k&ouml;nnen auch
    jederzeit ein oder mehrere neue Konten anlegen.</li>
  <li><p><b>Passwort &auml;ndern</b><br>
    Durch Klicken dieser Schaltfl&auml;che k&ouml;nnen Sie ein neues Passwort
    f&uuml;r die Verschl&uuml;sselung Ihrer Kontodaten angeben. Das Passwort
    gilt f&uuml;r alle Konten.<br>
    Wenn Sie ihr Passwort l&ouml;schen wollen, gehen Sie auf <code
    class="jconf">Passwort &auml;ndern</code>, lassen Sie das Textfeld
    f&uuml;r das neue Passwort und die Best&auml;tigung einfach leer und
    klicken <span class="nowrap">auf <code class="jconf">OK</code></span>.
    </p>
  </li>
  <li><p><b>Importieren</b><br>
    Wenn Sie diese Aktion w&auml;hlen, k&ouml;nnen Sie ein zuvor gesichertes
    Konto wiederherstellen. </p>
  </li>
</ul>

<h3>Informationen zum Kontostand</h3>

<p>Hier sehen Sie alle Informationen, die f&uuml;r das gerade
ausgew&auml;hlte Konto verf&uuml;gbar sind, und k&ouml;nnen bestimmte
Aktionen auf dieses Konto ausf&uuml;hren. Im einzelnen aufgelistet werden</p>
<ul>
  <li>das Restvolumen, das sich noch auf Ihrem aktuellen Konto befindet,</li>
  <li>der bisherige Gesamtverbrauch und </li>
  <li>der Betrag den Sie auf das Konto einbezahlt haben</li>
</ul>

<p>Sie k&ouml;nnen folgende Aktionen ausf&uuml;hren: </p>
<ul>
  <li><p><b>Aktivieren</b><br>
    Mit diesem Knopf aktivieren Sie das gew&auml;hlte Konto zur Verbindung
    mit einem Premiumdienst. Das derzeit aktivierte Konto ist
    hervorgehoben.<br>
    Passwortgesch&uuml;tzte Konten k&ouml;nnen Sie durch einen Klick auf
    diesen Knopf und die Eingabe Ihres Passworts wieder entsperren. </p>
  </li>
  <li><p><b>Aktualisieren</b><br>
    Wenn Sie diese Aktion w&auml;hlen, wird der aktuelle Kontostand von der
    Bezahlinstanz abgefragt. </p>
  </li>
  <li><p><b>L&ouml;schen</b><br>
    Hiermit l&ouml;schen Sie das ausgew&auml;hlte Konto.<br>
    </p>
    <p><b>ACHTUNG!</b><br>
    Sollte sich auf Ihrem Konto noch Guthaben befinden, ist dieses
    <b>m&ouml;glicherweise verloren</b>, wenn Sie keine Sicherheitskopie
    angelegt haben! </p>
  </li>
  <li><p><b><a name="saveaccount">Exportieren</a></b><br>
    Dieser Knopf speichert das ausgew&auml;hlte Konto in einer Datei. Dies
    ist sinnvoll, um bei Datenverlust Ihrer Festplatte oder Neuinstallation
    von JonDo oder des Gesamtsystems wieder Zugriff auf Ihr Konto erhalten zu
    k&ouml;nnen. Deshalb ist es die sicherste L&ouml;sung, wenn sie Ihr Konto
    auf ein externes Medium (z.B. einen USB-Stick) speichern. </p>
  </li>
</ul>

<h3>Erweiterte Einstellungen</h3>

<p><em class="jconf">Um zu diesem Einstellungsfenster zu kommen, klicken Sie
im Hauptfenster von JonDo auf <code class="jconf">Einstellungen</code>,
w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Bezahlung</code> und &ouml;ffnen anschlie&szlig;end den Tab
<code class="jconf">Erweiterte Einstellungen</code>. Diese Einstellungen
stehen Ihnen nur in der <a href="appearance.html#expertView">erweiterten
Ansicht</a> zur Verf&uuml;gung.</em> </p>
<ul>
  <!--
  <LI><B>Best&auml;tigungsdialog vor der Benutzung eines kostenpflichtigen Dienstes anzeigen</B><BR>
  Wenn Sie diese Option aktivieren, wird ihnen ein Dialog zur Best&auml;tigung angezeigt bevor JonDo eine kostenpflichtige Kaskade benutzt. Das hat auch zur Folge, dass JonDo sich nicht automatisch mit einer Bezahlkaskade verbinden kann.
  <P>-->
  <li><b>Anonyme Verbindungen zu Bezahlinstanzen</b><br>
    <em>Nur (wenn direkte Verbindung nicht m&ouml;glich</em>) bringt JonDo
    dazu, Informationen &uuml;ber Ihren Kontostand und Daten zur
    Kontoerstellung &uuml;ber den gerade aktiven JonDonym-Dienst zu
    &uuml;bertragen wenn die jeweilige Bezahlinstanz &uuml;ber eine direkte
    Verbindung nicht erreichbar ist. Dies ist beispielsweise dann der Fall
    wenn Ihr Provider den Zugang zur Bezahlinstanz blockiert. 
    <p><em>Immer (nicht-anonyme Verbindung verbieten)</em> f&uuml;hrt dazu,
    dass Bezahlinstanzen ausschlie&szlig;lich &uuml;ber JonDonym-Dienste
    kontaktiert werden. <strong>Durch diese Einstellung k&ouml;nnen Sie unter
    Umst&auml;nden keine Konten mehr anlegen und Ihren aktuellen Kontostand
    nicht mehr abrufen.</strong></p>
    <p><em>Niemals (nur direkte Verbindung gestatten)</em> kann sinnvoll
    sein, um Kosten zu sparen. Denn <strong>&uuml;ber kostenpflichtige
    JonDonym-Dienste &uuml;bertragene Bezahlinstanz-Daten werden aus
    zwingenden technischen Gr&uuml;nden genauso abgerechnet wie alle
    sonstigen Nutzdaten</strong>. Durch diese Einstellung wird verhindert,
    dass die anonyme Verbindung genutzt wird um Bezahlinstanz-Daten zu
    &uuml;bertragen.</p>
  </li>
  <li><p><b>Fehlermeldungen der Abrechnungsinstanz melden (nur zum Debugging
    deaktivieren!)</b><br>
    Wenn diese Option aktiviert ist, werden Fehlermeldungen der
    Abrechnungsinstanz des jeweils gew&auml;hlten Dienstes angezeigt. Es wird
    empfohlen, diese Option zu aktivieren. <em>Diese Einstellung ist nur in
    der Beta-Version verf&uuml;gbar.</em></p>
  </li>
  <li><p><b>Kontostand automatisch aktualisieren</b><br>
    Wenn Sie diese Option aktivieren, versucht JonDo in
    regelm&auml;&szlig;igen Zeitabst&auml;nden Ihre Kontoinformationen zu
    aktualisieren. Wenn Sie dies nicht erlauben, wird in JonDo nicht
    automatisch der aktuelle Kontostand angezeigt. Das Konto wird bei der
    Bezahlinstanz dennoch korrekt weitergef&uuml;hrt. </p>
  </li>
  <li><p><b>Warnen wenn beim Beenden von JAP/JonDo nicht von allen Konten
    eine Kopie existiert</b><br>
    Sie k&ouml;nnen hier eine Warnung beim Schlie&szlig;en des Programms
    aktivieren die erscheint wenn keine Sicherheitskopie von einem oder
    mehreren Ihrer Konten vorliegt um Sie vor Datenverlust zu sch&uuml;tzen.
    </p>
  </li>
  <li><p><b>Verbindungs-Timeout</b><br>
    Setzt das Timeout f&uuml;r Verbindungen zur Bezahlinstanz. Wenn Sie
    Probleme beim Erzeugen oder Aufladen von Konten haben, kann eine
    Erh&ouml;hung des Timeouts diese in manchen F&auml;llen beheben. </p>
  </li>
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="appearance.html"><img
src="prev.gif" alt="&lt;-"> Ver&auml;ndern des Erscheinungsbilds</a></span>
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt
</a><a href="index.html#mi_config"><img src="next.gif" alt="-&gt;">
Konfiguration </a></span> <span class="nextlink"><a
href="update.html">Einspielen von Updates <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
