<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->


<h2>Premiumdienste</h2>

<p>
Ihr JonDo ist der Zugang f&uuml;r eine Reihe von Anonymisierungsdiensten. Von besonders hoher Qualit&auml;t sind dabei die <b>Premiumdienste</b>. Wenn Sie Wert legen auf hohe Zuverl&auml;ssigkeit und Verf&uuml;gbarkeit sowie starke Sicherheitseigenschaften und eine hohe Bandbreite, sind Premiumdienste Ihre erste Wahl. Gegen&uuml;ber den kostenlosen Dienste bieten diese folgende Vorteile: 
</p>

<ul>
<li>
<p>
<b>Mehr Sicherheit durch l&auml;ngere Kaskaden</b>:<br> 
Die Mixkaskaden der Premiumdienste bestehen aus mindestens drei Mixen, die jeweils von unterschiedlichen Anbietern betrieben werden. Auf diese Weise ist Ihre Privatssph&auml;re nicht nur gegen&uuml;ber externen Angreifern gesch&uuml;tzt, sondern auch vor den Betreibern der Mixe selbst. Somit k&ouml;nnen Sie sich Ihrer Anonymit&auml;t sicher sein, ohne den Betreibern uneingeschr&auml;nktes Vertrauen entgegenbringen zu m&uuml;ssen.
</p>
</li>

<li>
<p>
<b>Bessere Performance durch garantierte Bandbreite</b>:<br> 
Die Mixbetreiber m&uuml;ssen ein Mindestma&szlig; an Ressourcen zur Verf&uuml;gung stellen, um f&uuml;r die Nutzer der Premiumdienste eine hohe Bandbreite und eine minimale Verz&ouml;gerung zu gew&auml;hrleisten. Auf diese Weise k&ouml;nnen wir Ihnen eine Bandbreite von minimal ISDN-Geschwindigkeit (64-128 kBit) garantieren, wobei in den meisten F&auml;llen h&ouml;here Bandbreiten erzielt werden.   
</p>
</li>

<li>
<p>
<b>Hohe Verf&uuml;gbarkeit durch mehrere Mixkaskaden</b>:<br>
F&uuml;r die Nutzer von Premiumdiensten stehen eine ganze Reihe von Mixkaskaden zur Verf&uuml;gung. Sie k&ouml;nnen zwischen jeder dieser Kaskaden w&auml;hlen, wenn Sie einen Zugang zu den Premiumdiensten besitzen. Somit stehen Ihnen zu jeder Zeit immer ausreichend Kaskaden zur Verf&uuml;gung, mit denen Sie sich verbinden k&ouml;nnen. 
</p>
</li>
</ul>

<p>
Mithilfe der Bezahlfunktion Ihres JonDos sind Sie in der Lage, die Premiumdienste zu nutzen. Um auf diese zugreifen zu k&ouml;nnen, haben Sie die M&ouml;glichkeit <a href="payment_account.html"> Konten </a> zu erstellen. Ein Konto umfasst ein bestimmtes Daten-Volumen, welches Sie &uuml;ber die Premiumdienste abrufen k&ouml;nnen.
Wenn Sie dieses Datenvolumen verbraucht haben, kann diese leere Konto gel&ouml;scht werden. Wenn Sie die Premiumdienste weiter nutzen m&ouml;chten, haben Sie die M&ouml;glichkeit ein neues Konto zu erzeugen.   
</p>
<p>
Wenn Sie ein Konto erzeugen, steht Ihnen eine Reihe von Tarifen zur Auswahl, die sich in Ihrem Preis, dem verf&uuml;gbaren Datenvolumen und der G&uuml;ltigsdauer unterscheiden.
Das Konto wird automatisch aktiviert, sobald Sie JonDos den Betrag &uuml;berwiesen haben, den der von Ihnen gew&auml;hlte Tarif kostet.
F&uuml;r die &Uuml;berweisung k&ouml;nnen Sie zwischen verschiedenen Bezahloptionen ausw&auml;hlen. Derzeit stehen Ihnen zur Verf&uuml;gung:
</p>
<ul>
    <li><b>paysafecard</b></li>
	<li><b>Barzahlung per Brief</b></li>      
	<li><b>Anonyme Bar&uuml;berweisung</b></li>
	<li><b>&Uuml;berweisung</b></li>
    <li><b>PayPal (z.B. Kreditkarte oder ecash)</b></li>
	<li><b>e-gold</b></li>
</ul>
<p>
<p>
Bei den Tarifen haben Sie die Wahl zwischen:
 </p>
<table width="100%" cellspacing="1" cellpadding="1" border="0">
    <tbody>
        <tr>
            <td><strong>Tarif</strong></td>
            <td><strong>Preis</strong></td>
            <td><strong>Max. Volumen</strong></td>
            <td><strong>Max. Laufzeit</strong></td>
            <td><strong>Gesch&auml;tzte Webseitenaufrufe</strong></td>
        </tr>
        <tr>
            <td>Tiny</td>
            <td>1,00 Euro</td>
            <td>120 MB</td>
            <td>2 Monate</td>
            <td>2400</td>
        </tr>
        <tr>
            <td>Medium</td>
            <td>5,00 Euro</td>
            <td>700 MB</td>
            <td>3 Monate</td>
            <td>14000</td>
        </tr>
        <tr>
            <td>Large</td>
            <td>10,00 Euro</td>
            <td>1,5 GB</td>
            <td>3 Monate</td>
            <td>30000</td>
        </tr>
        <tr>
            <td>XXL</td>
            <td>30,00 Euro</td>
            <td>5 GB</td>
            <td>7 Monate</td>
            <td>100000</td>
        </tr>
        <tr>
            <td>Huge</td>
            <td>50,00 Euro</td>
            <td>10 GB</td>
            <td>1 Jahr</td>
            <td>200000</td>
        </tr>
    </tbody>
</table>

<p>(Preisliste vom 06.01.2008)</p>
<p>
<b>Bitte beachten Sie</b>:<br>
Die Tarife und Bezahlmethode k&ouml;nnen sich &auml;ndern. Den neusten Stand finden Sie auf unserer Homepage unter <a href="https://www.jondos.de/de/payment">www.jondos.de/de/payment</a>.
</p>

<b>Hinweis:</b><br>
Mit der Erzeugung eines Kontos entstehen Ihnen keinerlei Zahlungsverpflichtungen. 
JonDos ist <b>kein Abonnement</b>, bei dem Sie nach der Erzeugung eines Kontos zu weiteren Zahlungen verpflichtet sind. 
Das Guthaben auf einem Konto ist <b>Prepaid</b>, d.h. mit Eingang der Zahlung wird Ihr Datenvolumen freigeschaltet und Sie k&ouml;nnen 
alle Premiumdienste solange nutzen, bis Ihr Guthaben aufgebraucht oder die G&uuml;ltigkeit des Kontos abgelaufen ist. Dabei steht es Ihnen frei, ob Sie danach neue Konten erzeugen m&ouml;chten, um die Premiumdienste zu nutzen.
</p>
<p>
Die f&uuml;r die Bezahlung erforderlichen Einstellungen im JonDo finden Sie in dieser <a href="payment.html">Anleitung</a>. 
</p>

<!--#include virtual="/footer.html"-->
</body>
</html>