<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="prevlink"><a href="services.html"><img src="prev.gif"> Dienste</a></span> 
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif"> Konfiguration </a><a href="anon.html"> <img src="next.gif"> Anonymit&auml;t </a><a href="services.html"><img src="next.gif"> Dienste</a></span>
<span class="nextlink"><a href="services_tor.html">TOR <img src="next.gif"></a></span> 
</p>
<hr>

<h2>AN.ON/JonDonym</h2>
<p>
Um zu diesem Einstellungsfenster zu kommen, klicken Sie im Hauptfenster von JonDo auf <i>Einstellungen</i>, w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <i>Dienste</i> und &ouml;ffnen anschlie&szlig;end den Tab <i>AN.ON/JonDonym</i>.
</p>

<p>
Der JonDo ist die Zugangssoftware f&uuml;r den Anonymiserungsdienst JonDonym, der aus dem AN.ON-Projekt hervorgegangen ist. Dieses Einstellungsfenster bietet Ihnen folgende Informationen und Einstellungsm&ouml;glichkeiten f&uuml;r den Zugang zu JonDonym:
</p>

<h3><a name="filter">Dienstfilter</a></h3>

<p>
Die Anzeige der verf&uuml;gbaren JonDonym-Dienste erfolgt durch einen Dienstfilter, der auch von Ihnen angepasst werden kann. Jenachdem welchen Filter man aus der Dienstfilter-Liste ausw&auml;hlt, erscheint in der Anzeige darunter eine Liste von Diensten, die den Auswahlkriterien des aktuellen Filters entsprechen. In der Auswahlliste des Dienstfilters finden Sie bereits voreingestellte Filter, mit denen Sie entsprechende Dienste ausw&auml;hlen k&ouml;nnen. Folgende Filter stehen Ihnen zur Verf&uuml;gung:
</p>
<ul>

<li>
<b>Alle Dienste</b>:<br>
Zeigt alle verf&uuml;gbaren Dienste an, ohne eine Vorauswahl vorzunehmen.
</li>

<li>
<a href="premiumservice.html"><b>Premiumdienste</b></a>:<br>
Zeigt nur die Premiumdienste an.
</li>

<li>
<b>Kostenfreie Dienste</b>:<br>
Blendet alle Dienste aus, die kostenpflichtig sind.
</li>

<li>
<b>Eigene Dienste</b>:<br>
Dieser Filter zeigt nur Dienste an, die im JonDo durch den Benutzer <a href="#manuell">manuell angelegt</a> wurden. 
</li>

</ul>

<p>
Mithilfe des letzten Eintrags <i><b>Benutzerdefinierter Filter</b></i> sind Sie in der Lage selbst die Auswahlkriterien f&uuml;r JonDonym-Dienste festzulegen. Dieser Filter bietet im Gegensatz zu den vordefinierten auch die M&ouml;glichkeit mehrere Kriterien miteinander zu kombinieren.
</p>
<p>
W&auml;hlen Sie diesen Eintrag und klicken Sie auf den Button <i>Anpassen</i>, um Ihren eigenen Filter zusammenszustellen. Dazu k&ouml;nnen Sie folgende Auswahlkriterien Ihren Anforderungen entsprechend anpassen:
</p>
<ul>
<li>
<p>
<b>Bezahlung</b>:<br>
W&auml;hlen Sie, ob nur Premium-, nur kostenlose oder alle Dienste angezeigt werden sollen. 
</p>
</li>

<li>
<p>
<b>Struktur</b>:<br>
Bestimmen Sie, ob Ihnen Einzelmixe gen&uuml;gen oder ob Sie nur Mixkaskaden als Dienste nutzen wollen. 
</p>
<p>
<b>Hinweis</b>:<br>
Wenn Sie Dienste nutzen, die nur aus Einzelmixen bestehen, ist Ihre Privatssph&auml;re nur dann gesichert, wenn der entsprechende Betreiber uneingeschr&auml;nkt vertrauensw&uuml;rdig ist.
</p>
</li>

<li>
<p>
<b>Betreiber</b>:<br>
Hier k&ouml;nnen Sie entscheiden, ob Sie Dienste ausblenden wollen, sofern eine bestimmte Organisation/Person als Mixbetreiber daran beteiligt ist. 
</p>
</li>

<li>
<p>
<b>Internationalit&auml;t</b>:<br>
Bestimmen, wieviele unterschiedliche Nationen mindestens beim Betrieb des Dienstes beteiligt sein sollen.
Dies umfasst sowohl den Sitz der mixbetreibenden Organistionen als den geographischen Standpunkt der Server.<br> 
</p>
<p>
<b>Hinweis</b>:<br>
Je h&ouml;her die Internationalisierung, desto h&ouml;her ist die Sicherheit des Dienstes einzusch&auml;tzen.
</p>
</li>

<li>
<p>
<b>&Uuml;bertragungsgeschwindigkeit und Antwortzeit</b>:<br>
Hier k&ouml;nnen Sie eine minimale Geschwindigkeit und eine maximale Verz&ouml;gerung angeben, die der Dienst erf&uuml;llen muss, um Ihren Anforderungen zu gen&uuml;gen. 
</p>
</li>
</ul>

<p>
Wenn Sie alle Auswahlkriterien nach Ihren Vorstellungen angepasst haben, klicken Sie auf <i>&Uuml;bernehmen</i>, um Ihren selbstdefinierten Filter zu aktivieren. Mit <i>Abbrechen</i> k&ouml;nnen Sie Ihre Eingaben wieder r&uuml;ckg&auml;ngig machen.
</p>

<h3>Verf&uuml;gbare Anonymisierungsdienste</h3>
<p>
Mit dem Dienstfilter sind Sie in der Lage, aus den verf&uuml;gbaren Diensten diejenigen auszuw&auml;hlen, die Ihren Anfordrungen entsprechen. &Uuml;ber die einzelnen Dienste wiederum k&ouml;nnen Sie weitere Informationen abrufen. Wenn Sie mit dem Mauszeiger &uuml;ber einen Eintrag in der Auswahlliste unter dem Dienstfilter fahren, so wird Ihnen der Name, bzw. die IP-Adresse des ersten Mixes sowie dessen Ports angezeigt, zu denen sich der JonDo verbinden kann. Die Haken links neben einem Diensteintrag sind f&uuml;r die verf&uuml;gbaren Diensten stets aktiviert. Entfernt man den Haken, bewirkt dies, dass sich der JonDo nicht mit diesem Dienst verbindet. Daducrh l&auml;sst sich sich eine noch genauere Dienstauswahl erzielen, als dies mit dem benutzerdefinierten Dienstfilter ohnehin schon m&ouml;glich ist.    
</p>
<p>
Rechts neben der Auswahlliste wird Ihnen zudem noch folgende Infomationen zum ausgew&auml;hlten Dienst angezeigt:
<ul>
<li>
<p>
<b>Anonymit&auml;tsgrad</b>:<br>
Gibt mit einen Wert zwischen eins und zehn an, wie hoch das Ma&szlig; an Provatssaph&auml;re ist, dass aktuell mit dem dem Dienst erreicht werden kann. Dieser Wert ist abh&auml;ngig von der aktuellen Zahl an Nutzern, die mit dem Dienst verbunden sind, der L&auml;nge der Mixkaskade und deren Internationalit&auml;t.
</p>
</li>

<li>
<p>
<b> &Uuml;bertragungsgeschwindigkeit</b>:<br>
Gibt die Geschwindigkeit an, mit der die Daten durch die Kaskade gesendet und wieder empfangen werden. Dieser Wert wird durch die InfoServices bestimmt.
</p>
</li>
<li>
<p>
<b>Antwortzeit</b>:<br>
Gibt f&uuml;r die ausgew&auml;hlte Kaskade an, wieviel Zeit vergeht, zwischen dem Senden eines Datenpakets und dem Empfangen der entsprechende Antwort. Deiser Wert wird ebenso durch die InfoServices bestimmt.
</p>
</li>
</ul>

<p>
Vervollst&auml;ndigt werden die Angaben &uuml;ber den ausgew&auml;hlten Dienst im unteren Teil des Fensters. 
Dort werden f&uuml;r jeden Mix, aus denen der Dienst, besteht ein Symbol angezeigt. Sie erkennen daran, wieviele Mixe eine Kaskade besitzt. Durch Flaggensymbole die sich rechts neben den Mixsymbolen befinden, erhalten Sie zudem auf einen Blick Aufschluss &uuml;ber die Nationlit&auml;t des Mixbetreibers (obere Flagge) und den geographischen Standort des Mixes (untere Flagge). Befindet sich nur eine Flagge neben dem Mixsymbol, so befinden sich der Sitz des Betreibers und der Mixstandort im selben Land.
</p>
<p>
Klicken Sie auf ein Mix-Symbol, um folgende Informationen zu dem entsprechenden Mix zu erhalten:
</p>

<ul>
	<li>
	<p>
	<b>Position</b>:<br>
	Hier k&ouml;nnen Sie sehen, welche Position der gew&auml;hlte Mix in der Kaskade einnimmt.
    </p>
	</li>
		 
	<li>
	<p>
	<b>Betreiber</b>:<br>
	Hier sehen Sie den Namen der Organisation, die den gew&auml;hlten Server betreibt. Wenn Sie die Maus &uuml;ber den Betreibernamen bewegen, zeigt sich die URL des Betreibers. Ein Klick auf den Betreiber &ouml;ffnet die Homepage des Betreibers. Das Flaggensymbol links gibt Ihnen Aufschluss dar&uuml;ber, in welchem Land der Mixbetreiber seinen Sitz hat.
	</p>
	</li>
		
	<li>
	<p>
	<b>Email</b>:<br>
	Die Emailadresse geh&ouml;rt zum Ansprechpartner des gew&auml;hlten Servers. Ein Klick darauf &ouml;ffnet Ihr Emailprogramm.
	</p>
	</li>
	
	<li>
	<p>
	<b>Standort</b>:<br>
	Der geographische Standort des Servers wird hier angezeigt. Ein Klick darauf &ouml;ffnet eine Karte. Das Flaggensymbol links	zeigt Ihnen auf einen Blick, in welchem Land der Mix seinen Standort hat.
	</p>
	</li>
	  
	<li>
	<p>
	<b>Zertifikat</b>:<br>
	Hier k&ouml;nnen Sie erkennen, ob das Zertifikat des Servers verifiziert werden konnte und ob es noch g&uuml;ltig ist oder schon abgelaufen. Mit einem Klick darauf k&ouml;nnen Sie das Zertifikat einsehen.
(<a href="certificates.html">Weitere Informationen zu Zertifikaten...</a>)    
	</p>
	</li>
</ul>

<h3>Aktionen zu den verf&uuml;gbaren Diensten</h3>

<p>
Unter dem Anzeigefenster mit den verf&uuml;gbaren JonDonym-Diensten finden Sie eine Reihe von Buttons, mit den Sie folgende Aktionen durchf&uuml;hren k&ouml;nnen:
</p>

<ul>
	<li>
	<p>
	<b>Neu laden</b>:<br>
    Ein Klick auf diese Schaltfl&auml;che bewirkt, dass der JonDo den InfoService erneut nach verf&uuml;gbaren Diensten abfragt.
    </p>
	</li>
	
	<li>
	<p>
	<b>Ausw&auml;hlen</b>:<br>
    Dieser Knopf setzt den momentan markierten Dienst als aktiven Dienst. Der JonDo wird versuchen, mit diesem Dienst eine Verbindung herzustellen, wenn die Anonymit&auml;t im Hauptfenster auf "Ein" geschaltet wird.
    </p>
	<p>
	<b>Hinweis</b>:<br>
	Wenn Sie einen Premiumdienst aktivieren, aber noch kein Konto dazu besitzen &ouml;ffnet sich ein Dialog zur Kontoerzeugung.
	</p>
	</li>
	
	<li>
	<p>
	<b><a name="manuell">Hinzuf&uuml;gen</a></b> (Dienst manuell anlegen):<br>
    Hiermit k&ouml;nnen Sie manuell einen Dienst eintragen, dessen Zugangsdaten Sie kennen, der aber nicht vom InfoService als verf&uuml;gbar gemeldet wurde. Nach einem Klick auf diese Schaltfl&auml;che erscheinen im unteren Teil des Fensters folgende Felder:
    </p>
    <ul>
        <li>
		<p>
		<b>Host</b>:<br>
        Tragen Sie hier den Hostnamen oder die IP-Adresse des Dienstes ein.
        </p>
		</li>
		
		<li>
		<p>
		<b>Port</b>:<br>
        Tragen Sie hier den Port des Dienstes ein.
        </p>
		</li>
		
		<li>
		<p>
		<b>Ok</b>:<br>
        Wenn Sie die obigen Felder ausgef&uuml;llt haben, tragen Sie den Dienst hiermit in die Liste der verf&uuml;gbaren Dienste ein.
        </p>
		</li>
		
		<li>
		<p>
		<b>Abbrechen</b>:<br>
        Hiermit machen brechen Sie den Vorgang ab. Der neu angelegte Dienst verschwindet wieder aus der Liste.
        </p>
		</li>
	</ul>
	
	<li>
	<p>
	<b>L&ouml;schen</b>:<br>
	Dieses Schaltfeld ist nur aktiv, wenn Sie einen bereits <a href="#manuell">angelegten manuellen</a> Dienst in der Liste ausw&auml;hlen. Damit entfernen Sie den gew&auml;hlten Dienst aus der Liste.
    </p>
	</li>
</ul>
<hr>
<p class="navipar">
<span class="prevlink"><a href="services.html"><img src="prev.gif"> Dienste</a></span> 
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_config"> <img src="next.gif"> Konfiguration </a><a href="anon.html"> <img src="next.gif"> Anonymit&auml;t </a><a href="services.html"><img src="next.gif"> Dienste</a></span>
<span class="nextlink"><a href="services_tor.html">TOR <img src="next.gif"></a></span> 
</p>

<!--#include virtual="/footer.html"-->
</body>
</html>