<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: AN.ON/JonDonym-Einstellungen</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="services.html"><img
src="prev.gif" alt="&lt;-"> Dienste</a></span> <span class="midlink"><a
name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Anonymit&auml;t </a><a
href="services.html"><img src="next.gif" alt="-&gt;"> Dienste</a></span> <span
class="nextlink"><a href="services_general.html">Erweiterte Einstellungen <img
src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>AN.ON/JonDonym</h2>

<p><em class="jconf">Um zu diesem Einstellungsfenster zu gelangen, klicken Sie
im Hauptfenster von JonDo auf <code class="jconf">Einstellungen</code>,
w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Dienste</code> und &ouml;ffnen anschlie&szlig;end den Reiter
<code class="jconf">AN.ON/JonDonym</code>. </em> </p>

<p>Um die Informationen und Einstellungen in diesem Fenster besser zu
verstehen, lesen Sie am Besten zun&auml;chst die Einf&uuml;hrung zu <a
href="jondonym.html">JonDonym und AN.ON</a>. </p>

<h3><a name="filter">Filter</a></h3>

<p>Ein sogenannter <em>Dienstfilter</em> bestimmt, mit welchen
AN.ON/JonDonym-Diensten sich Ihr JonDo verbinden kann. Abh&auml;ngig davon,
welchen Filter Sie ausw&auml;hlen, erscheint in der Anzeige darunter eine Liste
von Diensten die den Auswahlkriterien des Filters entsprechen. Folgende
vordefinierte Filter stehen Ihnen zur Verf&uuml;gung: </p>
<ul>
  <li><b>Alle Dienste</b><br>
    Zeigt alle verf&uuml;gbaren Dienste an, die mit hoher Wahrscheinlichkeit
    eine ausreichende Leistung bieten.</li>
  <li><p><b>Premiumdienste</b><br>
    Zeigt nur Premiumdienste an, und auch nur solche, welche gute
    Leistungesdaten aufweisen.</p>
  </li>
  <li><p><b>Kostenfreie Dienste</b><br>
    Blendet alle Dienste aus, die kostenpflichtig sind, und zeigt von den
    verbliebenen nur jene an, die mit hoher Wahrscheinlichkeit eine
    ausreichende Leistung bieten.</p>
  </li>
  <li><p><b>Eigene Dienste</b><br>
    Dieser Filter zeigt nur Dienste an, die von Ihnen <a href="#manuell">selbst
    angelegt</a> wurden, etwa um die Verbindung zu einem speziellen Dienst zu
    testen. </p>
  </li>
</ul>

<p>Mithilfe des letzten Eintrags <i><b>Benutzerdefinierter Filter</b></i>
k&ouml;nnen Sie selbst die Auswahlkriterien f&uuml;r Dienste festzulegen.
Dieser Filter bietet im Gegensatz zu den vordefinierten auch die
M&ouml;glichkeit mehrere Kriterien miteinander zu kombinieren. Klicken Sie
einfach auf die Schaltfl&auml;che <b>Filter anpassen</b>, um Ihren eigenen
Filter zusammenszustellen. Dazu k&ouml;nnen Sie folgende Auswahlkriterien Ihren
Anforderungen entsprechend anpassen: </p>
<ul>
  <li><p><b>Kaskadenl&auml;nge</b><br>
    Bestimmen Sie, ob Ihnen Einzelmixe gen&uuml;gen oder ob Sie nur Mixkaskaden
    als Dienste nutzen wollen. </p>
    <p><b>Hinweis</b><br>
    Wenn Sie Dienste nutzen, die nur aus Einzelmixen bestehen, ist Ihre
    Privatsph&auml;re nur dann gesichert, wenn der entsprechende Betreiber
    uneingeschr&auml;nkt vertrauensw&uuml;rdig ist. </p>
  </li>
  <li><p><b>Betreiber</b><br>
    Hier k&ouml;nnen Sie entscheiden, ob Sie Dienste ausblenden wollen, sofern
    eine bestimmte Organisation/Person als Mixbetreiber daran beteiligt ist.
    </p>
  </li>
  <li><p><b>Internationalit&auml;t</b><br>
    Bestimmen, wieviele unterschiedliche Nationen mindestens beim Betrieb des
    Dienstes beteiligt sein sollen. Dies umfasst sowohl den Sitz der
    mixbetreibenden Organisationen als auch den geographischen Standpunkt der
    Server.<br>
    </p>
    <p><b>Hinweis</b><br>
    Je h&ouml;her die Internationalisierung, desto h&ouml;her ist die
    Sicherheit des Dienstes einzusch&auml;tzen. </p>
  </li>
  <li><p><b>Qualit&auml;t</b><br>
    W&auml;hlen Sie, ob nur <a href="jondonym.html#premium">Premium-</a>, nur
    kostenlose oder alle Dienste angezeigt werden sollen. </p>
    <p><b>Hinweis</b><br>
    Die Qualit&auml;t der Premiumdienste &uuml;bertrifft die der kostenlosen in
    den wichtigen Punkten Sicherheit, Geschwindigkeit und Verf&uuml;gbarkeit.
    </p>
  </li>
  <li><p><b>Geschwindigkeit und Antwortzeit</b><br>
    Hier k&ouml;nnen Sie eine minimale Geschwindigkeit und eine maximale
    Verz&ouml;gerung angeben, die der Dienst erf&uuml;llen muss, um Ihren
    Anforderungen zu gen&uuml;gen.</p>
  </li>
</ul>

<p>Wenn Sie alle Auswahlkriterien nach Ihren Vorstellungen angepasst haben,
klicken Sie auf <code class="jconf">&Uuml;bernehmen</code>, um Ihren
selbstdefinierten Filter zu aktivieren. Mit <code
class="jconf">Abbrechen</code> k&ouml;nnen Sie Ihre Eingaben wieder
r&uuml;ckg&auml;ngig machen. </p>

<p><b>Sperren einzelner Dienste</b></p>

<p>Die Haken links neben einem Diensteintrag sind f&uuml;r die verf&uuml;gbaren
Dienste standardm&auml;&szlig;ig aktiviert. Entfernt man den Haken, bewirkt
dies, dass sich der JonDo nicht mit diesem Dienst verbindet. Dadurch l&auml;sst
sich eine noch genauere Dienstauswahl erzielen, als dies mit dem
benutzerdefinierten Dienstfilter ohnehin schon m&ouml;glich ist. </p>

<h3><a name="serviceinfos">Informationen &uuml;ber die verf&uuml;gbaren
Dienste</a></h3>

<p>&Uuml;ber die einzelnen Dienste k&ouml;nnen Sie sehr detaillierte
Informationen abrufen. Wenn Sie mit dem Mauszeiger &uuml;ber einen Eintrag in
der Auswahlliste unter dem Dienstfilter fahren, werden Ihnen die Adresse des
ersten Mixes sowie dessen Zugangsports angezeigt. Rechts neben der Auswahlliste
sehen Sie zudem noch folgende Informationen zum ausgew&auml;hlten Dienst: </p>
<ul>
  <li><p><b>Anonymit&auml;t</b><br>
    Gibt mit einen Wert zwischen 0 und zehn an, wie hoch das Ma&szlig; an
    Privatssph&auml;re ist, dass aktuell mit dem Dienst erreicht werden kann.
    Dieser Wert ist abh&auml;ngig von der aktuellen Zahl an Nutzern, die mit
    dem Dienst verbunden sind, der L&auml;nge der Mixkaskade und deren
    Internationalit&auml;t (<a href="jap.JAPNewView_anonymometer.html">vgl.
    Anonym-O-Meter</a>). Wenn alle Mixbetreiber dieses Dienstes zur Umsetzung
    besonderer rechtsverbindlicher Vorschriften gezwungen ist, welche die
    Anonymit&auml;t unter Umst&auml;nden negativ beeinflussen k&ouml;nnen,
    erscheint hier ein Warnzeichen&#xa0;<img alt="" src="img/certs/invalid.png"> auf das Sie klicken k&ouml;nnen, um weitere
    Informationen zu erhalten.</p>
  </li>
  <li><p><b>Nutzeranzahl</b><br>
    Anhand diese Wertes k&ouml;nnen Sie sehen, wieviele Nutzer aktuell mit dem
    Dienst verbunden sind. Je h&ouml;her die Anzahl der Nutzer ist, desto
    h&ouml;her ist auch Ihre Privatsph&auml;re bei der Nutzung des Dienstes.
    </p>
  </li>
  <li><p><b>Geschwindigkeit</b><br>
    Gibt die Geschwindigkeit an, mit der die Daten durch die Kaskade gesendet
    und wieder empfangen werden. Dieser Wert wird durch die InfoServices
    gemessen und &uuml;ber alle Messungen innerhalb der letzte Stunde
    berechnet. </p>
  </li>
  <li><p><b>Antwortzeit</b><br>
    Gibt die Zeit an die zwischen dem Senden eines Datenpakets und dem Empfang
    der Antwortdaten vergeht. Dieser Wert wird durch die InfoServices gemessen
    und &uuml;ber alle Messungen innerhalb der letzte Stunde berechnet. </p>
  </li>
  <li><p><b>Verf&uuml;gbarkeit</b><br>
    Wie zuverl&auml;ssig und stabil der ausgew&auml;hlte Dienst arbeitet,
    k&ouml;nnen Sie anhand dieser Information erkennen. Dieser Wert wird durch
    die InfoServices gemessen und &uuml;ber alle Messungen innerhalb der letzte
    Stunde berechnet.</p>
  </li>
</ul>

<p>Vervollst&auml;ndigt werden die Angaben im unteren Teil des Fensters. Dort
wird f&uuml;r jeden Mix des gew&auml;hlten Dienstes ein Symbol angezeigt. Sie
erkennen daran, wieviele Mixe eine Kaskade besitzt. Durch Flaggensymbole, die
sich rechts neben den Mix-Symbolen befinden, erhalten Sie zudem auf einen Blick
Aufschluss &uuml;ber die Nationlit&auml;t des Mixbetreibers (untere Flagge) und
den geographischen Standort des Mixes (obere Flagge). Befindet sich nur eine
Flagge neben dem Mix-Symbol, so befinden sich der Sitz des Betreibers und der
Mixstandort im selben Land. Farbig umrandete Flaggen geben einen schnellen
&Uuml;berblick &uuml;ber den <a
href="certificates.html#status">Zertifizierungsstatus</a> des jeweiligen
Mixes.</p>

<p>Klicken Sie auf ein Mix-Symbol oder die rechts/links-Pfeile, um zu dem
jeweiligen Mix der Kaskade folgende Informationen zu erhalten: </p>
<ul>
  <li><p><b>Mix-Name</b><br>
    Der Name, der dem Mix von seinem Betreiber gegeben wurde.</p>
  </li>
  <li><p><b>Mix-Standort</b><br>
    Der geographische Standort des Servers wird hier angezeigt. Das
    Flaggensymbol links zeigt Ihnen auf einen Blick in welchem Land der Mix
    seinen Standort hat.</p>
  </li>
  <li><p><b>Betreiber</b><br>
    Der Name der Organisation, die den gew&auml;hlten Mix betreibt. Das
    Flaggensymbol links gibt Ihnen Aufschluss dar&uuml;ber, in welchem Land der
    Mixbetreiber seinen Sitz hat. </p>
  </li>
  <li><p><b>Zertifikate (Schaltfl&auml;che)</b><br>
    Am Icon der Schaltfl&auml;che k&ouml;nnen Sie den <a
    href="certificates.html#status">Zertifizierungsstatus</a> des jeweiligen
    Mixes auf einen Blick erkennen. Ein Klick darauf &ouml;ffnet Details zu den
    Zertifikaten. (<a href="certificates.html">Weitere Informationen zu
    Zertifikaten...</a>)</p>
  </li>
  <li><p><b>E-Mail (Schaltfl&auml;che)</b><br>
    Ein Klick &ouml;ffnet Ihr Emailprogramm mit der Adresse des Betreibers des
    gew&auml;hlten Mixes. Sie k&ouml;nnen die E-Mail-Adresse au&szlig;erdem
    einsehen, wenn Sie Ihre Maus &uuml;ber die Schaltfl&auml;che bewegen.</p>
  </li>
  <li><p><b>Homepage (Schaltfl&auml;che)</b><br>
    Ein Klick &ouml;ffnet Ihren Browser mit der Adresse des Betreibers des
    gew&auml;hlten Mixes. Sie k&ouml;nnen die Homepage-Adresse au&szlig;erdem
    einsehen, wenn Sie Ihre Maus &uuml;ber die Schaltfl&auml;che bewegen.</p>
  </li>
  <li><p><b>Landkarte (Schaltfl&auml;che)</b><br>
    Wenn der Mix-Betreiber detaillierte Standortinformationen f&uuml;r seinen
    Server angegeben hat, k&ouml;nnen Sie diese auf einer Karte einsehen die
    sich auf einen Klick hin &ouml;ffnet.</p>
  </li>
  <li><p><b>Recht (Schaltfl&auml;che)</b><br>
    Diese Schaltfl&auml;che erscheint nur, wenn ein Mixbetreiber zur Umsetzung
    besonderer rechtsverbindlicher Vorschriften gezwungen ist, welche die
    Anonymit&auml;t unter Umst&auml;nden negativ beeinflussen k&ouml;nnen. Sie
    &ouml;ffnet eine Webseite mit weiteren Erkl&auml;rungen.</p>
  </li>
</ul>

<h3>Aktionen zu den verf&uuml;gbaren Diensten</h3>

<p>Unter dem Anzeigefenster mit den verf&uuml;gbaren JonDonym-Diensten finden
Sie eine Reihe von Buttons, mit denen Sie folgende Aktionen durchf&uuml;hren
k&ouml;nnen: </p>
<ul>
  <li><p><b>Neu laden</b><br>
    Ein Klick auf diese Schaltfl&auml;che bewirkt, dass JonDo alle Dienste aus
    der Liste l&ouml;scht und den InfoService erneut nach verf&uuml;gbaren
    Diensten abfragt. </p>
  </li>
  <li><p><b>Ausw&auml;hlen</b><br>
    Dieser Knopf setzt den momentan markierten Dienst als aktiven Dienst. JonDo
    wird versuchen mit diesem Dienst eine Verbindung herzustellen wenn die
    Anonymit&auml;t im Hauptfenster auf <code class="jconf">Ein</code>
    geschaltet wird. </p>
    <p><b>Hinweis</b><br>
    Wenn Sie einen Premiumdienst aktivieren aber noch kein Konto dazu besitzen,
    &ouml;ffnet sich ein Dialog zur Kontoerzeugung und es wird keine Verbindung
    zum Dienst hergestellt.</p>
  </li>
  <li><p><b><a name="manuell">Hinzuf&uuml;gen</a></b><br>
    Hiermit k&ouml;nnen Sie selbst einen Dienst eintragen dessen Zugangsdaten
    Sie kennen, der aber nicht vom InfoService als verf&uuml;gbar gemeldet
    wurde.</p>
    <p><em>Diese Funktion wird nur in Ausnahmef&auml;llen ben&ouml;tigt, etwa
    dann, wenn Sie zu keinem InfoService eine Verbindung aufbauen k&ouml;nnen
    um Informationen &uuml;ber Dienste automatisch abzurufen..</em></p>
    <p>Nach einem Klick auf diese Schaltfl&auml;che erscheinen im unteren Teil
    des Fensters folgende Felder: </p>
    <ul>
      <li><p><b>Host</b><br>
        Tragen Sie hier den Hostnamen oder die IP-Adresse des Dienstes ein. </p>
      </li>
      <li><p><b>Port</b><br>
        Tragen Sie hier den Port des Dienstes ein. </p>
      </li>
      <li><p><b>Ok</b><br>
        Wenn Sie die obigen Felder ausgef&uuml;llt haben, tragen Sie den Dienst
        hiermit in die Liste der verf&uuml;gbaren Dienste ein. </p>
      </li>
      <li><p><b>Abbrechen</b><br>
        Hiermit brechen Sie den Vorgang ab und im unteren Teil erscheinen
        wieder die Informationen zum aktuellen Dienst. </p>
      </li>
    </ul>
  </li>
  <li><p><b>&Auml;ndern</b><br>
    Diese Schaltfl&auml;che ist nur dann aktiv, wenn ein <a
    href="#manuell">manuell angelegter</a> Dienst in der Liste exisitert und
    ausgew&auml;hlt ist. Durch diese Aktion k&ouml;nnen Sie die Einstellungen
    von einem manuell angelegten Dienst wieder &auml;ndern. </p>
  </li>
  <li><p><b>L&ouml;schen</b><br>
    Auch auf diese Schaltfl&auml;che k&ouml;nnen Sie nur dann klicken, wenn Sie
    einen bereits angelegten manuellen Dienst in der Liste ausgew&auml;hlt
    haben. Damit entfernen Sie den entsprechenden Dienst wieder aus der Liste.
    </p>
  </li>
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="services.html"><img
src="prev.gif" alt="&lt;-"> Dienste</a></span> <span class="midlink"><a
name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a><a href="anon.html"><img src="next.gif" alt="-&gt;"> Anonymit&auml;t </a><a
href="services.html"><img src="next.gif" alt="-&gt;"> Dienste</a></span> <span
class="nextlink"><a href="services_general.html">Erweiterte Einstellungen <img
src="next.gif" alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
