<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: Einspielen von Updates</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body>
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="prevlink"><a href="payment.html"><img
src="prev.gif" alt="&lt;-"> Einstellungen zur Bezahlung</a></span> <span
class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a></span> <span class="nextlink"><a href="net.html">Netzwerk <img
src="next.gif" alt="-&gt;"></a></span> </p>
<hr>

<h2>Einspielen von Updates</h2>

<p><em class="jconf">Um zu diesem Einstellungsfenster zu gelangen, klicken
Sie im Hauptfenster von JonDo auf <code class="jconf">Einstellungen</code>
und w&auml;hlen anschlie&szlig;end aus der linken Liste den Eintrag <code
class="jconf">Update</code>. Dieses Einstellungsfenster steht Ihnen nur in
der <a href="appearance.html#expertView">erweiterten Ansicht</a> zur
Verf&uuml;gung. </em> </p>

<p>In diesem Dialog k&ouml;nnen Sie pr&uuml;fen, ob neue Versionen von JonDo
zum Einspielen verf&uuml;gbar sind. </p>

<h3>Installierte Version</h3>
<ul>
  <li><p><b>Version</b><br>
    Hier sehen Sie die Versionsnummer des JonDos. </p>
  </li>
  <li><p><b>Datum</b><br>
    Dieses Feld zeigt Ihnen den Zeitpunkt, an dem die momentan installierte
    Version ver&ouml;ffentlicht wurde. </p>
  </li>
  <li><p><b><a name="type" id="type">Art</a></b><br>
    Es gibt zwei verschiedene Versionsarten: Die <em>stabile Version</em>
    wurde ausgiebig getestet. Die <em>Beta-Version</em>, auch
    <em>Entwicklerversion</em> genannt, enth&auml;lt alle derzeit
    verf&uuml;gbaren Funktionen, die sich aber noch in der Testphase
    befinden. Aus diesem Grund ist die <em>Beta-Version</em> eher geeignet
    f&uuml;r erfahrene und experimentierfreudige Benutzer. </p>
  </li>
</ul>

<h3>Aktuelle Version</h3>

<p>Die hier angezeigten Informationen beziehen sich aber nicht auf die auf
Ihrem System installierte Version, sondern auf diejenige, die momentan zum
Download zur Verf&uuml;gung steht. Mit Hilfe der Auswahlbox <code
class="jconf">Art</code> k&ouml;nnen Sie festlegen, ob Sie zur <em>Stabilen
Version</em> oder zur <em>Entwicklerversion</em> umschalten m&ouml;chten. </p>

<h3>Optionen</h3>
<ul>
  <li><p><b>Anonyme Update-Verbindungen</b><br>
    <em>Nur (wenn direkte Verbindung nicht m&ouml;glich)</em> bringt JonDo
    dazu, Verbindungen zum Update-Server &uuml;ber den gerade aktiven
    JonDonym-Dienst herzustellen wenn der Server &uuml;ber eine direkte
    Verbindung nicht erreichbar ist. Dies ist beispielsweise dann der Fall
    wenn Ihr Provider den Zugang zum Update-Server blockiert. </p>
    <p><em>Immer (nicht-anonyme Verbindung verbieten)</em> f&uuml;hrt dazu,
    dass Updates ausschlie&szlig;lich &uuml;ber JonDonym-Dienste
    heruntergeladen werden. <strong>Durch diese Einstellung k&ouml;nnen Sie
    unter Umst&auml;nden keine Updates mehr einspielen. Allerdings sind Sie
    dadurch vor einer gezielten Manipulation Ihrer Software durch den
    Hersteller gesch&uuml;tzt, da dieser Ihre Installation nicht
    identifizieren kann.</strong> </p>
    <p><em>Niemals (nur direkte Verbindung gestatten)</em> kann sinnvoll
    sein, um Kosten zu sparen. Denn <strong>&uuml;ber kostenpflichtige
    JonDonym-Dienste &uuml;bertragene Update-Daten werden aus zwingenden
    technischen Gr&uuml;nden genauso abgerechnet wie alle sonstigen
    Nutzdaten</strong>. Durch diese Einstellung wird verhindert, dass die
    anonyme Verbindung genutzt wird um Updates herunterzuladen.</p>
  </li>
  <li><p><b>Hinweisfenster anzeigen, wenn neue JAP/JonDo-Version
    verf&uuml;gbar ist</b><br>
    Liegt eine neue Version von JonDo vor und haben Sie diese Option
    aktiviert, erscheint ein Hinweisfenster mit der M&ouml;glichkeit, das
    Update vorzunehmen. Wenn diese Option deaktiviert ist, wird in der
    Statuszeile im Hauptfenster nur noch ein kleiner Hinweis angezeigt. Die
    Pr&uuml;fung auf Updates erfolgt beim Start des Programms und danach alle
    12 Stunden. </p>
  </li>
  <li><p><b>Hinweisfenster anzeigen, wenn neue Version von Java (JRE)
    verf&uuml;gbar ist</b><br>
    JonDo pr&uuml;ft beim Start und danach alle 12 Stunden, ob eine neuere
    JAVA-Version verf&uuml;gbar ist. Haben Sie diese Option aktiviert,
    erscheint ein Hinweisfenster. Eine Aktualisierung der JRE muss manuell
    erfolgen. <a href="updateJava.html">Mehr...</a> </p>
  </li>
</ul>

<h3>Info</h3>

<p>In diesem Feld werden Ihnen Informationen &uuml;ber den Fortschritt beim
Installieren eines Updates angezeigt. Au&szlig;erdem zeigt es das Ergebnis
der Pr&uuml;fung auf neuere Versionen. </p>

<h3>Weitere Bedienelemente</h3>
<ul>
  <li><p><b>Pr&uuml;fe, ob neue Updates vorhanden sind</b><br>
    Wenn Sie diesen Knopf anklicken wird gepr&uuml;ft, ob eine neuere Version
    als die bei Ihnen installierte zum Download zur Verf&uuml;gung steht. </p>
  </li>
  <li><p><b>Upgrade</b><br>
    Hiermit k&ouml;nnen Sie die neueste Version von JonDo gem&auml;&szlig;
    Ihrer Auswahl unter <a href="#type">Art</a> aus dem Internet laden und
    auf Ihrem System installieren. </p>
  </li>
</ul>
<hr>

<p class="navipar"><span class="prevlink"><a href="payment.html"><img
src="prev.gif" alt="&lt;-"> Einstellungen zur Bezahlung</a></span> <span
class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a
href="index.html#mi_config"><img src="next.gif" alt="-&gt;"> Konfiguration
</a></span> <span class="nextlink"><a href="net.html">Netzwerk <img
src="next.gif" alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
