<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: WWW und Privatsp&auml;hre</title>
  <link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>

<body lang="de">
<!--#include virtual="/header.html"-->

<p class="navipar"><span class="midlink"><a name="doctop"
href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_intro"><img
src="next.gif" alt="-&gt;"> Einf&uuml;hrung</a></span> <span
class="nextlink"><a href="jondonym.html">JonDonym <img src="next.gif"
alt="-&gt;"></a></span> </p>
<hr>

<h2>Das World Wide Web und Ihre Privatsph&auml;re</h2>

<p>Das World Wide Web ist aus Ihrem Alltag sicher nicht mehr wegzudenken. Die
zahlreichen Dienste wie Online-Banking, Fahrkartenausk&uuml;nfte,
Nachschlagewerke o.&auml;. sind eine gro&szlig;e Hilfe bei Ihren
allt&auml;glichen Aufgaben. Au&szlig;erdem nutzen Sie wahrscheinlich auch
Unterhaltungs- und Einkaufsm&ouml;glichkeiten, bleiben durch soziale Netzwerke
mit Freunden in Kontakt oder tauschen sich in Foren mit Menschen aus, die
&auml;hnliche Interessen wie Sie besitzen. Um auf das Web zuzugreifen, stehen
Ihnen eine ganze Reihe ausgereifter, hochfunktionaler aber trotzdem gut
bedienbarer Programme zur Verf&uuml;gung, die Browser. Die bekanntesten
Webbrowser sind der Internet Explorer, Firefox, Opera, Safari und Chrome.</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->

<p>Die Kommunikation mit dem Internet erzeugt eine ganze Reihe von digitalen
Spuren, die automatisiert erfasst, gespeichert und ausgewertet werden
k&ouml;nnen. Einige Unternehmen haben sich deshalb darauf spezialisiert,
individuelle Nutzerprofile mithilfe von Surf-Daten zu erstellen. Solche
Datens&auml;tze haben eine hohen wirtschaftlichen Wert, da Unternehmen durch
diese ein umfassenderes Bild von Verbrauchern, also Ihnen, erhalten
k&ouml;nnen. Dies wird im Fachjargon der Datensammler als <a
href="http://www.schober.de/site/index.php?id=137">Datenanreicherung</a>
bezeichnet. </p>

<p>Es gibt viele Gr&uuml;nde, warum man digitale Surf-Spuren vermeiden sollte:
manche der beobachteten Daten flie&szlig;en in Scoringmodelle ein, die f&uuml;r
die Vergabe von Krediten, f&uuml;r eine individuelle Preisgestaltung von
Angeboten oder die Zul&auml;ssigkeit einer Bezahlung per Nachnahme benutzt
werden. Arbeitgeber k&ouml;nnen sich vor der Einstellung neuer Mitarbeiter ein
Pers&ouml;nlichkeitsprofil der Bewerber aus Spuren im Netz erstellen lassen.
Die Meinungsfreiheit wird eingeschr&auml;nkt, wenn Regierungen oder
Institutionen einzelne Surfer f&uuml;r den Besuch, die Benutzung oder die
Editierung bestimmter Webangebote verfolgen oder deren Benutzung gar nicht erst
zulassen. Firmen k&ouml;nnen Mitarbeiter anderer Unternehmen oder sogar der
Konkurrenz auf ihren Webseiten erkennen und anschlie&szlig;end mittels
Werbeanrufen oder E-Mails bel&auml;stigen. Browserdaten erlauben es,
Schwachstellen im surfenden Rechner aufzudecken. Dadurch kann
anschlie&szlig;end ein Hacker den Rechner direkt kontaktieren und angreifen.</p>

<p>Problematisch an den Internetspuren ist auch, dass diese <b>ohne Ihre
Zustimmung</b> und von Ihnen weitestgehend <b>unbemerkt erhoben, gespeichert,
weitergeleitet und verarbeitet</b> werden. Die konkreten Techniken, welcher
sich die Datensammler im Web bedienen, werden im Folgenden kurz vorgestellt.</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->

<h3><a name="active" id="active">Aktive Webinhalte</a></h3>

<p>Webseiteninhalte, die &uuml;ber die <em>aktiven Browser-Plugins</em> Flash,
Java, ActiveX und Silverlight zug&auml;nglich sind, machen das Web dynamisch
und bunt - aber auch gef&auml;hrlich. Denn Sie erlauben Webseiten, Code auf
Ihrem Rechner auszuf&uuml;hren. Wenn sie ausgef&uuml;hrt werden, k&ouml;nnen
diese Plugin-Inhalte einige details Ihrer Rechenr- und Netzwerkkonfiguration
auslesen und an den Webserver senden. Mithilfe einiger Tricks k&ouml;nnen diese
sogar auf Ihrem Rechner Dateien lesen und &auml;ndern und im Extremfall die
vollst&auml;ndige Kontrolle &uuml;ber diesen erhalten. Vorsicht ist vor allem
vor signierten Java-Applets geboten: Wenn Sie deren Signatur akzeptieren, hat
das Applet und damit auch der besuchte Web-Server automatisch alle
Benutzerrechte auf Ihrem Rechner. Er kann also insbesondere Ihre <a
href="#ip">IP-Adresse</a>, Ihre <a href="#mac">MAC-Adresse</a>, weitere Details
Ihrer Rechner- und Netzwerkkonfiguration und sogar Festplatteninhalte auslesen.
Es hilft auch nichts, nur Webseiten zu besuchen, die als
"vertrauensw&uuml;rdig" gelten. Dieses Konzept ist &uuml;berholt, da
mittlerweile auch zahlreiche gro&szlig;e und bekannte Webseiten gehackt und mit
Schadcode gef&uuml;llt werden. Nur das Blockieren/Deaktivieren der
Plugin-Inhalte bringt wirkliche Sicherheit.</p>

<p>Die Browsersprache <em>JavaScript</em> ist gegen Angriffe auf Ihre
Privatsph&auml;re besser gesch&uuml;tzt als die genannten Plugins aber nicht
v&ouml;llig sicher. Wir empfehlen deshalb, JavaScript-Inhalte nur bei Bedarf in
Ihrem Browser zu aktivieren und ansonsten zu blockieren. JavaScript ist nicht
zu verwechseln mit <em>Java</em> bzw. dem <em>aktiven Java-Plugin</em> was
trotz &auml;hnlichem Namen etwas v&ouml;llig anderes ist (siehe oben).</p>

<p>Ohne einen gut abgesicherten Browser sollten Sie sich daher nicht im
Internet bewegen, da Ihr Rechner ansonsten Gefahr l&auml;uft, angegriffen zu
werden. Statt Ihren Browser selber entsprechend zu konfigurieren, was einiges
an Erfahrung erfordert, k&ouml;nnen Sie z.B. den kostenlosen <a
href="jondofox.html">JonDoFox</a> verwenden. Dieser auf Mozilla Firefox
basierende Browser blockiert nicht nur standardm&auml;&szlig;ig alle aktiven
Inhalte (sie k&ouml;nnen diese bei Bedarf wieder einschalten) sondern
verf&uuml;gt auch &uuml;ber weitere umfangreiche Schutzmechanismen. Die meisten
Webinhalte bleiben dennoch erreichbar. YouTube-Videos oder Videos anderer
Portale, die im Flash-Format vorliegen, k&ouml;nnen mithilfe spezieller
Software heruntergeladen und danach gefahrlos in diversen
Videoabspielprogrammen betrachtet werden. Webseiten, welche die Verwendung
aktiver Plugins erzwingen, sollten Sie wenn m&ouml;glich meiden.</p>

<h3><a name="cookies">Cookies</a></h3>

<p>Ohne Cookies k&ouml;nnen Webserver bestimmte Anwendungen nur schwer
umsetzen. Hat ein Benutzer eine Webseite eines Server abgerufen, kann dieser
den Besuch von vorher von demselben Server abgerufenen Seiten nicht ohne
weiteres diesem selben Benutzer zuordnen. Manche Webangebote ben&ouml;tigen
jedoch eine Art "Ged&auml;chtnis". Ein Beispiel daf&uuml;r sind
Einkaufsportable, bei denen der Webserver sich merken muss, welche Waren sich
bereits in Ihrem virtuellen Einkaufswagen befinden. Dieses "Ged&auml;chtnis"
wird meist &uuml;ber sogenannte Cookies realisiert, kleine Textdateien, welche
Ihnen der besuchte Webserver zusammen mit jeder Antwortseite zusendet.
Kontaktiert Ihr Browser den Server erneut, schickt er diesem automatisch auch
das vorher gespeicherte Cookie zu. Der Server ordnet Ihnen dadurch den
richtigen Einkaufswagen zu.</p>

<p>Cookies k&ouml;nnen aber auch dazu missbraucht werden, um Ihre Schritte im
Internet zu verfolgen. Diese Technik kann vor allem bei Web-Portalen (wie
Yahoo) und Suchmaschinen (wie Google) erfolgreich angewandt werden, da Sie
diese h&auml;ufig benutzen um andere Webseiten zu erreichen. &Uuml;ber Cookies
k&ouml;nnen diese Anbieter gro&szlig;e Teile Ihres Surfverhaltens &uuml;ber
Jahre hinweg aufzeichnen und leicht einen Personenbezug &uuml;ber Ihr
"angereichertes" Profil zu Ihnen herstellen. Die meisten Internetnutzer haben,
ohne es zu wissen, sogar ganze Sammlungen hunderter Cookies von verschiedensten
Webseiten auf Ihrem Rechner. Sie sollten Cookies deshalb auf jeden Fall
sp&auml;testens nach dem Ende Ihrer Browsersitzung l&ouml;schen. Moderne
Browser haben daf&uuml;r meist eine optionale Funktion integriert welche der
Nutzer aber erst aktivieren muss. In <a href="jondofox.html">JonDoFox</a> ist
dies bereits voreingestellt.</p>

<h3><a name="header" id="header">Browser(HTTP)-Header</a></h3>

<p>Bei jedem Aufruf einer Webseite senden Browser bestimmte Informationen im
Rahmen des sogenannten HTTP-Protokolls die von der besuchten Seite ausgewertet
werden k&ouml;nnen: Sprache, Browsername und -version, Betriebssystem und
-version, unterst&uuml;tzte Zeichens&auml;tze, Dateitypen, Kodierungen und die
vorher aufgerufene Webseite. Die &Uuml;bertragung dieser sogenannten
Browser-Header ist die die Darstellung von Webseiten nicht notwendig, kann
allerdings zur Wiedererkennung, Profilierung und Analyse von Surfern genutzt
werden.</p>

<p>Mittlerweile wurden verschiedene Filterprogramme und -dienste entwickelt, um
problematische Browser-Header zu verbergen oder zu ver&auml;ndern (z.B.
Privoxy, Proxomitron). Leider k&ouml;nnen diese Anwendungen keine
verschl&uuml;sselten Verbindungen filtern: sobald man eine vermeintlich
"sichere" Webseite (HTTPS, Browser-Schloss) aufruft, versagt die Filterung.
Au&szlig;erdem erlauben es diese Programme jedem Nutzer, seine Header-Daten
selbst zu definieren. Gerade dadurch, dass man aber etwa den Browsertyp auf
einen individuellen Wert setzt, macht man sich quasi perfekt verfolgbar. Im
Programm <a href="about.html">JonDo</a> ist deshalb eine automatische Filterung
eingebaut, die allen Benutzern, zumindest f&uuml;r unverschl&uuml;sselte
Verbindungen (HTTP), ein einheitliches Header-Profil zuweist. Wer eine noch
h&ouml;here Sicherheit erreichen m&ouml;chte, sollte jedoch den <a
href="jondofox.html">JonDoFox-Browser</a> benutzen. Dieser &uuml;bertr&auml;gt
immer dasselbe Profil auch bei verschl&uuml;sselten Verbindungen. Dadurch ist
gew&auml;hrleistet, dass Webseiten h&ouml;chstens erkennen k&ouml;nnen, dass es
sich beim Besucher um einen JonDonym-Benutzer handelt, aber nicht um welchen
genau.</p>

<h3>Browserverlauf</h3>

<p>Mithilfe bestimmter Tricks k&ouml;nnen Webseiten erkennen, welche anderen
Webseiten in Ihrem Browserverlauf (History) liegen. Dazu f&uuml;gt die von
Ihnen besuchte Webseite bestimmte Formatierungsanweisungen (CSS, Stylesheets)
mit Links auf "interessante" fremde Webseiten in Ihnen abgerufenen Seiten ein.
Wenn Sie eine der fremden Webseiten vorher besucht haben, reagiert Ihr Browser
darauf, indem er ein in der jeweiligen Formatierungsanweisung definiertes
Kommando ausf&uuml;hrt und beispielsweise ein kleines Bild vom Webserver
nachl&auml;d. Die Webseite kann dadurch Ihren Browserverlauf ganz oder
teilweise erraten.</p>

<p>Gegen diese Technik gibt es - au&szlig;er dem Deaktivieren des
Browserverlaufs wie es in <a href="jondofox.html">JonDoFox</a> voreingestellt
ist - momentan noch keinen zuverl&auml;ssigen Schutz.</p>

<h3>Browser-Cache</h3>

<p>&Uuml;ber den Inhalt Ihres Browser-Caches kann man auf vorher besuchte und
daher im Browser zwischengespeicherte Webseiten schlie&szlig;en: Die Zeit, die
beim Laden einer Webseite vergeht, &auml;ndert sich, wenn Teile der Seite
bereits im Browser-Cache liegen. Mittels einer geschickte Verteilung der Bilder
auf der Webseite, welche jeweils einzeln nachgeladen werden, kann der Webserver
den Cache nach und nach analysieren.</p>

<p>Im Gegensatz zum Abschalten des Browserverlaufs h&auml;tte das Abschalten
des Caches gravierende Auswirkungen auf die Surfgeschwindigkeit, weshalb wir
dies nicht empfehlen. Im <a href="jondofox.html">JonDoFox</a> ist stattdessen
eine Schutzfunktion eingebaut, welche f&uuml;r Inhalte von Drittseiten den
Cache umgeht. Au&szlig;erdem wird der Cache beim Schlie&szlig;en des Browsers
automatisch gel&ouml;scht. Dadurch kann eine Webseite keine Informationen
&uuml;ber andere Seiten gewinnen, sondern nur &uuml;ber sich selbst.</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->

<h3>Webbugs und Werbebanner</h3>

<p>Sehr wahrscheinlich finden Sie von Datensammlern wie <a
href="http://www2.infonline.de/">ivwbox.de (INFONLINE)</a>, <a
href="http://www.doubleclick.com/">doubleclick.net</a>, <a
href="http://www.advertisement.com/">advertisement.com</a> oder <a
href="http://www.google.com">Google</a> sogar dann ein oder mehrere sogenannte
<a href="#cookies">Cookies</a> in Ihrem Browser, wenn Sie deren Webseiten
niemals besucht haben. Dies liegt daran, dass diese Unternehmen auf anderen
Webseiten einen einfachen Trick benutzen um Ihnen dennoch Cookies
"unterzuschieben" und Ihr Surfverhalten zu beobachten: <em>Webbugs</em> </p>

<p>"Webbugs" sind &uuml;blicherweise Bilder von 1x1 Pixeln und damit f&uuml;r
den Betrachter unsichtbar. Sie k&ouml;nnen alternativ aber auch &uuml;ber
sichtbare, in eine Webseite eingebettete Werbebanner realisiert werden. Die
Webseite, welche Sie gerade besuchen, enth&auml;lt ein Bild (Webbug), das vom
Server eines Statistikdienstes (etwa Doubleclick, Google Analytics) nachgeladen
wird. Dadurch kann der Statistikdienst in Ihrem Browser unbemerkt ein Cookie
setzen oder ver&auml;ndern. Dieses Cookie schickt der Browser nun mit jeder
neuen Anfrage nach Seiten, in denen ein Webbug des Statistikdienstes
eingebettet ist, wieder an diesen zur&uuml;ck. Wenn der Statistikdienst auf
vielen unterschiedlichen Webseiten eingesetzt wird, kann er nun gro&szlig;e
Teile Ihrer Browsersitzung verfolgen. Arbeitet der Betreiber des
Statistikdienstes zus&auml;tzlich mit dem Betreiber Ihrer &uuml;blicherweise
genutzten Suchmaschine zusammen bekommt er ein fast vollst&auml;ndiges Bild
Ihrer Internetaktivit&auml;ten.</p>

<p>Die Privatsph&auml;re-Funktionen aktueller Browser, die entweder pauschal
alle Cookies sperren oder nur Cookies von "Drittseiten" blockieren, alternativ
aber auch alle Cookie-Daten beim Beenden des Browsers l&ouml;schen, reichen
f&uuml;r einen optimalen Schutz dagegen leider nicht aus. Um eine Verfolgung
Ihrer Zugriffe zu verhindern sollten m&ouml;glichst alle Cookies
standardm&auml;&szlig;ig blockiert und nur bei Bedarf f&uuml;r die Dauer der
Browsersitzung zugelassen werden. <a href="jondofox.html">JonDoFox</a> ist
deswegen bereits so vorkonfiguriert, dass zun&auml;chst alle Cookies blockiert
werden, jede Webseite aber mit nur zwei Mausklicks freigeschaltet werden kann.
Wir empfehlen, Cookies immer nur tempor&auml;r zuzulassen, so dass Sie
sp&auml;testens bei der n&auml;chsten Browsersitzung wieder automatisch
blockiert sind.</p>

<p>Eine andere unangenehme Eigenschaft von Webbugs ist, dass sie beim Abruf
neben Cookies auch Ihre <a href="#ip">IP-Adresse</a> automatisch an den
Statistikdienst &uuml;bermitteln. Selbst mit einer sehr guten
Browserkonfiguration, dem Abschalten von Cookies und automatischen
Webbug-Filtern k&ouml;nnen Sie dies niemals zuverl&auml;ssig verhindern.
Dagegen hilft nur die Verwendung eines Anonymisierungsdienstes wie <a
href="jondonym.html">JonDonym</a>.</p>

<h3><a name="TCPTimestamps" id="TCPTimestamps">TCP-Zeitstempel</a></h3>

<p>Das Transmission Control Protocol (TCP) ist ein Protokoll zur
Daten&uuml;bertragung zwischen Computern. Es ist notwendig f&uuml;r eine Reihe
von Internetdiensten wie http (WWW), smtp (E-Mail) und ftp. Wenn beispielsweise
Ihr Rechner eine Anfrage nach einer Webseite schickt, werden diese Daten
innerhalb vieler kleiner sogenannter TCP-Pakete versendet. Neben diesen Daten
enth&auml;lt ein solches TCP-Paket auch einige optionale Informationsfelder
(optionale Header). Eine dieser Optionen ist der TCP-Zeitstempel. Der Wert
dieses Zeitstempels ist proportional zur aktuellen Zeit auf Ihrem Computer, und
wird gem&auml;&szlig; der internen Uhr Ihres Rechners automatisch
erh&ouml;ht.</p>

<p>Der Zeitstempel kann vom Clienten- und/oder Server-Ger&auml;t zur
Performanceoptimierung eingesetzt werden. Jedoch kann ein Internetserver Ihren
Computer anhand der Zeitstempel wiedererkennen und verfolgen: Indem er den
Abweichungen in der Uhrzeit misst, kann er ein <a
href="http://www.cs.washington.edu/homes/yoshi/papers/PDF/">individuelles
Zeit-Versatz-Profil</a> f&uuml;r Ihren Computer berechnen. Au&szlig;erdem kann
er die Zeit sch&auml;tzen, zu der Ihr Rechner zuletzt neu gestartet wurde.
Diese Tricks funktionieren sogar dann, wenn Sie Ihre Internetverbindungen
ansonsten perfekt anonymisiert haben. </p>

<p>Wenn Sie m&ouml;chten, k&ouml;nnen <a
href="http://www.saintcorporation.com/cgi-bin/demo_full_tut.pl?tutorial_name=TCP_timestamps.html&amp;fact_color=doc&amp;tag=">Sie
selbst</a> die <a
href="http://www.saintcorporation.com/cgi-bin/demo_full_tut.pl?tutorial_name=TCP_timestamps.html&amp;fact_color=doc&amp;tag=">Zeitstempel
abschalten</a>. Problematisch ist, dass dies <a
href="https://forums.symantec.com/t5/blogs/blogarticlepage/blog-id/grab_bag/article-id/72#M72">auf
Windows-Systemen m&ouml;glicherweise nicht funktioniert</a>. Wenn Sie
stattdessen <a href="jondonym.html">JonDonym</a> verwenden, sind Sie jedoch
davor gesch&uuml;tzt, auf diese Weise beobachtet zu werden. Denn JonDonym-Mixe
ersetzen Ihre potenziell unsicheren TCP-Pakete automatisch durch ihre
eigenen.</p>

<h3><a name="mac" id="mac">MAC-Adresse</a></h3>

<p>Die MAC-Adresse (MAC=Media-Access-Control, manchmal auch
<em>Ethernet-ID</em>, <em>Airport-ID</em> oder <em>physikalische Adresse</em>
genannt) ist die Hardware-Adresse jedes einzelnen Netzwerkger&auml;tes. Jeder
Rechner kann &uuml;ber mehrere solcher physischer oder virtueller
Netzwerkger&auml;te verf&uuml;gen (kabelgebunden <em>(LAN)</em>, drahtlos
<em>(WLAN)</em>, mobil <em>(GPRS, UMTS)</em>, virtuell <em>(VPN)</em>, ...).
Die MAC-Adresse dient zur eindeutigen Identifizierung des jeweiligen
Ger&auml;ts in einem lokalen Rechnernetz. Im Internet wird sie nicht
ben&ouml;tigt und nicht &uuml;bertragen. Auch Ihr Zugangsprovider kann sie nur
dann sehen, wenn Ihr Rechner nicht &uuml;ber einen Router, sondern direkt mit
dem Internet verbunden ist, etwa &uuml;ber ein Modem. Da Ihr Provider Sie
ohnehin an Ihren Zugangsdaten wiedererkennt, ist dies jedoch kein Nachteil
f&uuml;r Ihre Privatsph&auml;re. Die MAC-Adresse l&auml;sst sich au&szlig;erdem
<a
href="http://de.wikipedia.org/wiki/MAC-Adresse#Abfrage_und_Setzen_einer_MAC-Adresse">selbst
&auml;ndern</a>.</p>

<h3><a name="ip" id="ip">IP-Adresse</a></h3>

<p>Die IP-Adresse (z.B. 121.56.22.136) erh&auml;lt Ihr Rechner oder Ihr Router
automatisch bei der Interneteinwahl von Ihrem Provider zugewiesen. Dieser
speichert sie &uuml;blicherweise zusammen mit Ihren Kundendaten und Ihrer
Online-Zeit monate- oder sogar jahrelang. Sie ist Ihre eindeutige Kennung im
Internet, die immer mitgesendet wird, wenn Sie eine direkte Verbindung zu einem
Internetdienst aufbauen. Anhand der IP-Adresse erkennt der Webserver, an wen er
die Antwort zur&uuml;cksenden muss. Solange Ihre IP-Adresse sich nicht
&auml;ndert, l&auml;sst sich damit gut nachverfolgen, zu welcher Zeit sie
welchen Webseitenbetreiber kontaktiert haben. Die IP-Adresse offenbart
au&szlig;erdem Ihren Provider, in vielen F&auml;llen Ihren momentanen
Aufenthaltsort und manchmal (speziell in Unternehmen und Rechenzentren) auch
genau den Rechner, an dem Sie gerade sitzen. Durch die IP-Adresse kann in
vielen F&auml;llen ein direkter Personenbezug hergestellt werden. </p>

<p>Einen Teil der Informationen, die Ihre IP-Adresse und Ihr Browser &uuml;ber
sie verraten, k&ouml;nnen Sie <a
href="https://www.jondos.de/de/anontest">&uuml;ber die JonDos-Testseite
einsehen</a>.</p>

<p>W&auml;hrend sich die bisher genannten Surf-Spuren ohne spezielle
Server-Dienste verwischen lassen, ist dies bei Ihrer IP-Adresse nicht ganz so
einfach m&ouml;glich. Deswegen wurde die Software <a
href="about.html">JonDo</a> entwickelt: Um den Zusammenhang zwischen Ihrer
IP-Adresse und den von Ihnen besuchten Webseiten zu verschleiern, stellt <a
href="about.html">JonDo</a> eine Verbindung zu dem Dienst <a
href="jondonym.html">JonDonym</a> her. Dieser schaltet die Server verschiedener
Organisationen zwischen Ihren Rechner und das Internet. Sie surfen dann jeweils
mit der IP-Adresse des letzten Servers in einer Kette/Kaskade mehrerer
sogenannter Mix-Server. Die von Ihnen &uuml;bertragenen Daten werden dabei
f&uuml;r jeden Mix-Server einzeln verschl&uuml;sselt und in Gr&ouml;&szlig;e
und Reihenfolge leicht ver&auml;ndert, so dass niemand Ihren Datenstrom
belauschen oder erraten kann. Sie sind damit auch f&uuml;r den Fall
gesch&uuml;tzt, dass einzelne (aber nicht alle) Betreiber gehackt, bestochen,
bedroht oder anderweitig zur Beobachtung Ihrer Zugriffe gezwungen werden.</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->
<hr>

<p class="navipar"><span class="midlink"><a name="docbottom"
href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_intro"><img
src="next.gif" alt="-&gt;"> Einf&uuml;hrung</a></span> <span
class="nextlink"><a href="jondonym.html">JonDonym <img src="next.gif"
alt="-&gt;"></a></span> </p>
<!--#include virtual="/footer.html"-->
</body>
</html>
