<html>
<head>
<link rel="stylesheet" type="text/css" href="../../xhelpfrms.css">
</head>
<body>
<!--#include virtual="/header.html"-->

<p class="navipar">
<span class="midlink"><a name="doctop" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_intro"> <img border="0" src="next.gif"> Einf&uuml;hrung</a></span>
<span class="nextlink"><a href="jondonym.html">JonDonym <img src="next.gif"></a></span> 
</p> 
<hr>

<h2>Das World Wide Web und Ihre Privatsph&auml;re</h2>

<p>
Vermutlich ist auch f&uuml;r Sie das World Wide Web nicht mehr aus Ihrem Alltag wegzudenken. Die zahlreichen Informationen und Dienste, wie Online-Banking, Fahrkartenausk&uuml;nfte u.&auml;. erleichtern Ihren Alltag ungemein. Dazu nutzen Sie wahrscheinlich auch die zahlreiche Unterhaltungs- und Einkaufsm&ouml;glichkeiten, bleiben durch soziale Netzwerke mit Freunden in Kontakt oder tauschen sich in den zahlreichen Foren mit Menschen, die &auml;hnliche Interessen wie Sie besitzen. Das WWW bietet den Nutzer mit seiner einfachen Technologie diese vielf&auml;ltigen Nutzungsm&ouml;glichkeiten. Um auf das Web zuzugreifen, stehen Ihnen eine ganze Reihe ausgereifter, hochfunktionaler aber trotzdem gut bedienbarer Programme zur Verf&uuml;gung, die sog. Browser. Die prominentesten Beispiele sind der Internet Explorer oder der frei verf&uuml;gbare Firefox. 
</p>

<p>
Viele Menchen sind heute, was das Web betrifft, kein unbeschriebenes Blatt mehr, haben schon  CDs, B&uuml;cher oder andere Artikel online bestellt, Programme geladen oder einfach zur Unterhaltung oder Information diverse Webseiten und Blogs besucht. Das Web ist allerdings auch eine sehr ergiebige Quelle an Informationen anderer Art. So hinterlassen Sie selbt beim Abruf von Daten eine ganze Reihe von digitalen Spuren, die automatisiert erfasst, gespeichert und ausgewertet k&ouml;nnen. Die h&auml;ufigste Spur, die Sie beim Surfen im Internet hinterlassen ist Ihre IP-Adresse, die Sie automatsich bei der Internet-einwahl erhalten. Dies ist eine eindeutige Kennung im Internet, die immer mitgesendet wird, wenn Sie einen beliebigen Dienst im Internet kontaktieren, so auch beim Web. Anhand dieser Adresse erkennt Ihr Kommunikationspartner, z.B. ein Webseitenbetreiber, an wen er die Antwort zur&uuml;cksenden muss. Leider l&auml;sst sich damit auch sehr gut nachverfolgen, zu welcher Zeit, sie welchen Webseitenbetreiber kontaktiert haben, um welche Daten abzurufen. 
</p>
<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>

<h3>Privatsph&auml;re - Warum?</h3>
<p>
Datenspuren werden aus ganz unterschiedlichen Gr&uuml;nden mitverfolgt. Sei es zu Marktforschungs- und Werbezwecken f&uuml;r Anbieter kommerzieller Webdienste, zur Erstellung individueller Nutzerprofile oder der Verfolgung von kriminellen und terroristischen Machenschaften, bis hin zur Spionage, sowohl in der Politik als auch in der Industrie. F&uuml;r Unternehmen ist es deshalb unverzichtbar, ihre Verbindungsdaten und -inhalte zu sch&uuml;tzen, da diese der Konkurrenz wertvolle Anhaltspunkte zu Vorhaben geben k&ouml;nnten, wie z.B. geplante Patentierungen, Fusionen, die Suche nach speziellen Mitarbeitern oder der Austausch von Gesch&auml;ftsgeheimnissen. Auch Privatpersonen rufen im Web viele pers&ouml;nliche Informationen ab, etwa zu gesundheitlichen, psychischen, sozialen oder finanziellen Themen. Ohne zus&auml;tzliche Schutzmechanismen k&ouml;nnen diese sensiblen Informationen verwendet, um Privatnutzer zu durchleuchten und Ihre Privatssph&auml;hre zu verletzen. Oftmals reicht dazu allein die Kommunikationsbeziehung, um auf den ausgetauschten Inhalt zu schlie&szlig;en. So werden allein schon entsprechende Schl&uuml;sse gezogen, wenn ein Nutzer beispielsweise eine Schuldnerberatungsseite abruft, m&ouml;glicherweise auch die falschen. So flie&szlig;en die beobachteten Daten unter Umst&auml;nden in Scoringmodelle von Unternehmen ein, die f&uuml;r die Kreditvergabe und f&uuml;r eine individuelle Preisgestaltung der Angebote benutzt werden: wer einen schlechten &bdquo;Score-Wert&ldquo; hat, muss Nachteile daf&uuml;r in Kauf nehmen, auch wenn dies m&ouml;glicherweise unberechtigt ist. Denkbar ist auch, dass sich Arbeitgeber vor der Einstellung neuer Mitarbeiter von Internetagenturen ein aus den Spuren im Netz erstelltes Pers&ouml;nlichkeitsprofil der Bewerber aush&auml;ndigen lassen.
</p>


<p>
Unabh&auml;ngig davon, welcher Zweck mit dem Sammeln von Daten im Web verfolgt wird, es stehen hierf&uuml;r viele technische M&ouml;glichkeiten zur Verf&uuml;gung, die eine Gemeinsamkeit haben: Sie erfordern keinen gro&szlig;en technischen Aufwand und werden von denjenigen, deren Spuren ausgewertet werden, weitestgehend nicht bemerkt. Zwei beliebte und h&auml;ufig verwendete Techniken, die im Web eingesetzt werden, wollen wir Ihnen hier kurz vorstellen: Cookies und Webbugs.
</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->

<h3><a name="cookies">Cookies</a></h3>
<p>
Zugegeben, das Besorgniserregendste an Cookies sind sicherlich die Geschichten, die &uuml;ber Sie verbreitet werden und die dazu f&uuml;hren, dass sie falsch eingesch&auml;tzt werden. Cookies k&ouml;nnen zwar weder Ihre Festplatte l&ouml;schen oder die Kontrolle &uuml;ber Ihren Computer &uuml;bernehmen, aber geht man aber unachtsam mit Ihnen um, k&ouml;nnen Sie Ihre Privatssph&auml;re empfindlich verletzen. 
</p>
<p>
Im Prinzip haben Cookies einen sehr praktischen Nutzen. Eingangs wurde erw&auml;hnt, dass das Web viele Nutzungsm&ouml;glichkeiten bietet, auch wenn die Technologie, die dahintersteht relativ einfach ist - in mancherlei Hinsicht leider zu einfach. So hat man f&uuml;r das Web in seiner urspr&uuml;nglichen Form kein &quot;Ged&auml;chtnis&quot; vorgesehen. Rief man also eine Webseite von einem Server ab, hat dieser nach dem Senden der Antwort schon wieder vergessen, was man vorher gemacht haben. Damit lassen sich aber bestimmte Anwendungen nicht realisieren, wie z.B. Webshops, bei denen der Webserver sich merken muss, welche Waren sich bereits in Ihrem virtuellen Einkaufswagen befinden. Aus diesem Grund hat die Firma Netscape die Cookies entwickelt, als eine Art nachger&uuml;stetes Ged&auml;chtnis f&uuml;r Webanwendungen. Das Prinzip ist einfach: Mit jeder Antwort sendet Ihnen der Server einen speziell markierten Datensatz mit. Ihr Browser erkennt anhand der Markierung: Dieser Datensatz ist ein Cookie, der auf der Festplatte abgelegt werden soll. Kontaktiert Ihr Browser einen Server, kontrolliert er zuvor die Festplatte, ob ein enstprechender Cookie gespeichert ist, und wenn ja, schickt er den entsprechenden Datensatz wieder mit. Der Server &quot;erinnert&quot; sich dadurch wieder, welches Ihr virtueller Einkaufswagen war.
</p>
<p>
Bei all dem praktischen Nutzen, den Cookies bieten, liegt aber auch deren Mi&szlig;brauch nicht fern. Die Daten, die ein Cookie enth&auml;lt, sind keineswegs nur f&uuml;r den Server interessant, der Sie Ihnen zugeschickt hat. Die Daten k&ouml;nnen im Prinzip an jeden beliebigen Server versendet werden. Wenn Ihr Webshop also auch die Artikelnummern in dem Cookie ablegt und Ihr Browser diesen an einen zentralen Werbeserver versendet, kann man leicht ein individuelles Interessensprofil erstellen. Das Gemeine an Cookies ist: Sie allein k&ouml;nnen f&uuml;r eine Identifizierung bereits ausreichend sein. Auch wenn Ihre IP-Adresse bei jeder Internet-Einwahl wechselt, die Daten eines Cookies bleiben auf der Festplatte bestehen. Aus diesem Grund kann Sie Amazon immer wieder mit Namen begr&uuml;&szlig;en, wenn Sie sich dort einmal eingeloggt waren, auch wenn Sie zwischenzeitlich Ihre Internetverbindung getrennt hatten. Besonders heikel wird es, wenn dieser zentrale Werbeserver nicht nur Cookies von einem Webshop-Anbieter sammelt. Die Entwickler der Browser haben hierauf reagiert und so ist bei den meisten Browsern bereits voreingestellt, dass Cookies nur zu den Server zur&uuml;ckgesendet werden d&uuml;rfen, von denen Sie auch erstellt wurden. Leider ist auch dieser Schutzmechanismus mit einfachsten, im wahrsten Sinne &quot;unsichtbaren&quot; Mitteln zu umgehen: den sog. Webbugs.
</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->

<h3>Webbugs</h3>

<p>
Ein "Webbug" ist &uuml;blicherweise ein Bild von 1x1 Pixeln, in der gleichen Farbe wie der Hintergrund der Webseite und damit f&uuml;r den Nutzer unsichtbar. Sie sind auch weniger zum Anschauen als zum Ausp&auml;hen gedacht. Webbugs k&ouml;nnen die Privatssph&auml;re gleich in mehrerer Hinsicht unterlaufen. In allen F&auml;llen wird von Betreibern, die Webseiten mit Webbugs versehen, folgendes ausgenutzt: Grafiken und Bilder auf Webseiten sind nicht direkt eingebunden sondern als Verweise, die dem Browser erm&ouml;glichen sie nachzuladen. Dabei ist es m&ouml;glich, dass ein Bild von einem anderen Server geladen wird, als die Webseite, die das Bild enth&auml;lt. Dadurch kann eine Webseite, die z.B. in einem Webshop ein bestimmtes Produkt vorstellt mit speziellen Webbugs eines anderen Anbieters versehen wurde, der zentral Nutzerprofile erstellt. L&auml;dt Ihr Browser die entsprechende Grafik nach, kann dieser Datensammler nachvollziehen, f&uuml;r welches Produkt Sie sich interessieren. So &ouml;ffnen Sie auch wieder dem Cookie-Mi&szlig;brauch T&uuml;r und Tor, denn wenn der Webbrowser Bilder von einem &quot;Datensammler&quot; nachl&auml;dt, kann dieser auch Cookies mitsenden. Diese sschickt der Browser und mit jeder neuen Anfrage nach Webbugs wieder an den Datensammler zur&uuml;ck.
</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->

<h3>Behalten Sie die Kontrolle &uuml;ber Ihre Daten</h3>
<p>
Wenn Sie der Meinung, sind, dass dies dreiste Tricksereien sind, um m&ouml;glichst ungehemmt Daten zu sammeln, sollten Sie wissen: Diese Mechanismen sind im Web allt&auml;glich. Sie dienen der Statistikerfassung zum Zweck von Marktforschung und Werbeoptimierung. Es werden die Anzahl von Klicks auf bestimmte Seite oder Werbebanner ausgewertet und damit das Interesse von Verbrauchern f&uuml;r bestimmte Seiteninhalte oder Produkte erfasst. In den meisten F&auml;llen erfolgt die Auswertung dieser Daten abstrakt, d.h. man ist nicht direkt an Ihren privaten Interessen sondern an den Nutzerinteressen im Allgemeinen interessiert. Einige Unternehmen haben sich auch auf individuelle Nutzerprofile spezialisiert. Sie sammeln umfangreiche individuelle Informationen von Verbrauchern bestimmten Personen, bis Sie sehr umfangreiche Datens&auml;tze mit pers&ouml;nlichen Angaben erstellt haben. Unternehmen k&ouml;nnen diese dann erwerben, um bespielsweise die Interessensprofile, die sie schon besitzen um noch mehr pers&ouml;nliche Informationen zu erg&auml;nzen. Sie erhalten damit ein noch umfassenderes Bild von Verbrauchern. Im Fachjargon der Datensammler wird dies als <a href="http://www.schober.de/site/index.php?id=137">Datenanreicherung</a> bezeichnet. 
</p>
<p>
Auf welche Weise die Daten ausgewertet werden ist jedoch zweitrangig. Schwerwiegend ist, dass Ihre Daten &uuml;berhaupt und dazu noch von Ihnen weitestgehend <b>unbemerkt weitergeleitet und verarbeitet</b> werden. Wurden sie je von Anbietern wie <a href="http://www2.infonline.de">ivwbox.de (INFONLINE)</a>, <a href="http://www.doubleclick.com/">doubleclick.net</a> oder <a href="http://www.advertisement.com/">advertisement.com</a>
nach Ihrer Zustimmung gefragt, ob diese Daten von Ihnen erheben d&uuml;rfen? Nein? Wenn Sie Ihre Cookies kontrollieren, ist die Wahrscheinlichkeit &auml;u&szlig;erst hoch, dass auch von diesen Anbietern Cookies auf Ihrer Festplatte gespeichert sind und Sie damit Daten an diese weitergeleitet haben.
</p>
<p>
<b>Bitte bedenken Sie:</b><br>
Auch wenn Sie der Meinung sind, dass Sie keinen Bedarf an Privatssp&auml;hre im Web haben, weil Sie sich nichts zuschulden kommen lassen: Durch die automatische Erfassung der digitalen Spuren im Web, 
erh&auml;lt man kaum einen &Uuml;berblick dar&uuml;ber:
<ul>
<li> Wer meine digitalen Spuren mitverfolgt.</li>
<li> Was er &uuml;ber mich in Erfahrung gebracht hat.</li>
<li> Welche Schl&uuml;sse er daraus zieht.</li>
<li> Welchen Zweck er damit verfolgt. </li>
<li> An wen er die gesammelten Spuren und seine Schlussfolgerungen weitergibt, (beabsichtigt oder unbeabsichtigt).</li>
</ul>
<p>
<b>Mit <a href="about.html#JonDonym">JonDonym</a> k&ouml;nnen Sie die Kontrolle &uuml;ber Ihre Daten wieder zur&uuml;ckerhalten</b>.<br> 
Die Software <b>JonDo</b> bietet Ihnen Zugang zu diesem Dienst. Er stellt sicher, dass:
</p>
<ul>
<li>Au&szlig;enstehende, nicht nachvollziehen k&ouml;nnen, mit wem sie kommunizieren</li> 
<li>vor den Webdiensten, die Sie kontaktieren, ihre IP-Adresse und damit Ihre Identit&auml;t verschleiert ist</li>
<li>selbst vor Anbietern der JonDonym-Dienste Ihre Privatssph&auml;re gesichert ist.</li> 
</ul>
<p>
Aber auch wenn die IP-Adresse eine sehr kritische Spur ist, die sie hinterlassen, sie ist bei weitem nicht die einzige. Um Ihre Privatssph&auml;re zusch&uuml;tzen, vor dem Mi&szlig;brauch mit Cookies und Webbugs oder dem Hinterlassen weiterer Datenspuren im Web wurde der <a href="jondofox.html">JonDoFox</a> entwickelt. Dabei handelt es sich um einen Firefox-Browser der die notwendigen Erweiterungen und Konfiguration enth&auml;lt, um sicherzustellen, dass Sie keine digitalen Spuren beim Surfen hinterlassen.
</p>
<!--<div class="topdown_navi">
<a href="#doctop"> Beginn &uarr; </a><a href="#docbottom"> &darr; Ende </a>
</div>-->

<hr>
<p class="navipar">
<span class="midlink"><a name="docbottom" href="index.html#mi_toc">Inhalt </a><a href="index.html#mi_intro"> <img src="next.gif"> Einf&uuml;hrung</a></span>
<span class="nextlink"><a href="jondonym.html">JonDonym <img src="next.gif"></a></span> 
</p>

<!--#include virtual="/footer.html"-->
</body>
</html>